<?php
/**
 * Import English lexicon entries
 *
 * @language en
 * @package modx
 * @subpackage lexicon
 */
$_lang['import_allowed_extensions'] = 'حدد قائمة محددة بفواصل من ملحقات الملفات للاستيراد.<br /><small><em> اتركها فارغة ليتم استيراد كل الملفات وفقا لأنواع المحتوى المتوفرة في موقعك. سيتم تعيين الأنواع الغير معروفة كنص عادي.</em></small>';
$_lang['import_base_path'] = 'أدخل مسار الملف الأساسي الذي يحتوي الملفات التي سيتم استيرادها.<br /><small><em>اترك المساحة فارغة ليتم ستخدام إعداد مسار الملف الثابت للسياق الهدف. <em></small/>';
$_lang['import_duplicate_alias_found'] = 'المصدر [[id+]] يستخدم مسبقا الاسم المستعار [[alias+]]. الرجاء إدخال اسم مستعار فريد.';
$_lang['import_element'] = 'أدخل عنصر HTML الجذر ليتم استيراده:';
$_lang['import_element_help'] = 'تزويد JSON مع الربط "حقل":"قيمة". اذا كانت القيمة تبدأ بـ $ تكون مثل محدد jQuery. الحقل يمكن أن يكون حقل مصدر أو اسم عنصر قالب.';
$_lang['import_enter_root_element'] = 'أدخل العنصر الجذر ليتم استيراده:';
$_lang['import_files_found'] = '<strong>تم العثور على الوثائق %s للاستيراد...</strong><p/>';
$_lang['import_parent_document'] = 'الوثيقة الحاوية:';
$_lang['import_parent_document_message'] = 'استخدم شجرة الوثائق المعروضة أدناه لاختيارالموقع الحاوي وذلك لاستيراد الملفات الخاصة بك فيه.';
$_lang['import_resource_class'] = 'اختار صف modResource لاستيراد:<br /><small><em>استخدم modStaticResource لكي تربط مع الملفات الثابتة، أو modDocument لكي تنسخ المحتوى مع قاعدة المعطيات.</em></small>';
$_lang['import_site_failed'] = '<span style="color:#990000">فشل!</span>';
$_lang['import_site_html'] = 'استيراد الموقع من HTML';
$_lang['import_site_importing_document'] = 'استيراد الملف <strong>%s</strong> ';
$_lang['import_site_maxtime'] = 'وقت الاستيراد الأعظمي:';
$_lang['import_site_maxtime_message'] = 'هنا يمكنك تحديد عدد الثواني التي يحتاجها مدير المحتوى لاستيراد الموقع (تجاوز إعدادات PHP). أدخل 0 لوقت غير محدود. يرجى ملاحظة أن وضع 0 أو زمن عالي جداً يمكن أن يؤثر بشكل سلبي على السيرفر لذلك لا ينصح بها.';
$_lang['import_site_message'] = '<p>استخدام هذه الأداة يمكنك من استيراد المحتوى من مجموعة ملفات HTML إلى قاعدة البيانات. <em>يرجى ملاحظة أنك ستحتاج إلى نسخ الملفات و/أو المجلدات في المجلد core/import. 
<em></p><p/>الرجاء ملء خيارات النموذج أدناه، بشكل اختياري حدد مصدر حاوي للملفات المستوردة من شجرة المستند، واضغط على \'استيراد HTML\' لبدء عملية الاستيراد. سيتم حفظ الملفات المستوردة في الموقع المحدد، باستخدام، حيثما كان ذلك ممكناً، اسم الملف كاسم مستعار للمستند، عنوان الصفحة كعنوان المستند.<p/>';
$_lang['import_site_resource'] = 'استيراد المصادر من الملفات الثابتة';
$_lang['import_site_resource_message'] = '<p>استخدام هذه الأداة يمكنك من استيراد المصدر من مجموعة ملفات ثابتة إلى قاعدة البيانات. <em>يرجى ملاحظة أنك ستحتاج إلى نسخ الملفات و/أو المجلدات في المجلد core/import. 
<em></p><p/>الرجاء ملء خيارات النموذج أدناه، بشكل اختياري حدد مصدر حاوي للملفات المستوردة من شجرة المستند، واضغط على \'استيراد المصادر\' لبدء عملية الاستيراد. سيتم حفظ الملفات المستوردة في الموقع المحدد، باستخدام، حيثما كان ذلك ممكناً، اسم الملف كاسم مستعار للمستند، عنوان الصفحة كعنوان المستند.<p/>';
$_lang['import_site_skip'] = '<span/>تخطي!<"span style="color:#990000>';
$_lang['import_site_start'] = 'بدء الاستيراد';
$_lang['import_site_success'] = '<span style="color:#009900">تم بنجاح!</span>';
$_lang['import_site_time'] = 'تم الانتهاء من الاستيراد. استغرقت عملية الاستيراد %s ثانية لتكتمل.';
$_lang['import_use_doc_tree'] = 'استخدم شجرة الوثائق المعروضة أدناه لاختيارالموقع الحاوي وذلك لاستيراد الملفات الخاصة بك فيه.';