<?php
/**
 * Menu English lexicon topic
 *
 * @language en
 * @package modx
 * @subpackage lexicon
 */
$_lang['action'] = 'إجراء';
$_lang['action_desc'] = 'مسار وحدة تحكم الستخدام لعنصر القائمة هذا. يتم إنشاء المسار إلى وحدة تحكم بإلحاق بادئة معينة لكل من مسار التسمية ، وحدات التحكم, قالب اﻹدارة ، مثال:  [core_namespace_path]controllers/[mgr_theme]/user/update.class.php';
$_lang['description_desc'] = 'النص، أو مفتاح المعجم، الذي سيتم استخدامه لعرض نص عنوان هذه الصفحة في القائمة.';
$_lang['handler'] = 'الحامل';
$_lang['handler_desc'] = '(اختياري) عند التحديد ،لن يتم استخدام حقل العمل، ولكن بدلاً من ذلك يتم  تشغيل جافا سكريبت  بدلاً من ذلك عندما يتم النقر فوق عنصر القائمة.';
$_lang['icon'] = 'أيقونة';
$_lang['icon_desc'] = 'أيقونة / ترميز اختياري.';
$_lang['lexicon_key'] = 'مفتاح المعجم';
$_lang['lexicon_key_desc'] = 'النص، أو مفتاح المعجم، الذي سيتم استخدامه لتقديم نص عنوان هذه الصفحة في القائمة.';
$_lang['menu_create'] = 'إنشاء قائمة';
$_lang['menu_confirm_remove'] = 'هل أنت متأكد أنك تريد حذف هذه القائمة؟';
$_lang['menu_err_ae'] = 'هناك قائمة موجودة مسبقاً بهذا الاسم. الرجاء تحديد  نص مختلف.';
$_lang['menu_err_nf'] = 'لم يتم العثور على القائمة!';
$_lang['menu_err_ns'] = 'لا توجد قائمة محددة!';
$_lang['menu_err_remove'] = 'حدث خطأ أثناء محاولة إزالة القائمة.';
$_lang['menu_err_save'] = 'حدث خطأ أثناء محاولة حفظ القائمة.';
$_lang['menu_parent'] = 'القائمة الحاوية';
$_lang['menu_parent_err_ns'] = 'لم يتم تحديد القائمة الحاوية!';
$_lang['menu_parent_err_nf'] = 'لم يتم العثور على القائمة الحاوية!';
$_lang['menu_remove'] = 'حذف عنصر القائمة';
$_lang['menu_top'] = 'القائمة العليا';
$_lang['menu_update'] = 'تحديث القائمة';
$_lang['menus'] = 'القوائم';
$_lang['namespace'] = 'فضاء الأسماء';
$_lang['namespace_desc'] = 'التسمية التي يستند عليها عنصر القائمة هذا. وهذا سيحدد المسار لوحدة التحكم التي يتم تحميلها.';
$_lang['parameters'] = 'بارامترات';
$_lang['parameters_desc'] = 'أي معلمات طلب تريد بعنوان انترنت "URL" عند النقر فوق هذه القائمة. (مثال : &expire = 1)';
$_lang['permissions'] = 'الصلاحيّة';
$_lang['permissions_desc'] = 'مفتاح إذن مطلوب لتحميل عنصر القائمة هذا.';
$_lang['topmenu'] = 'القائمة العليا';
$_lang['topmenu_desc'] = 'يسمح لك بربط الإجراءات مع عناصر القائمة في شريط القوائم العليا من مدير MODX. ببساطة قم  بوضع القوائم في المكان الذي تريده على حسب موقعها.';
