<?php
/**
 * TV English lexicon topic
 *
 * @language en
 * @package modx
 * @subpackage lexicon
 */
$_lang['has_access'] = 'يملك حق الوصول؟';
$_lang['filter_by_category'] = 'فلترة حسب الصنف...';
$_lang['rank'] = 'ترتيب';
$_lang['rendering_options'] = 'خيارات إعادة الرسم';
$_lang['tv'] = 'عنصر قالب';
$_lang['tv_access_msg'] = 'اختر مجموعات المصدر التي ينتمي إليها عنصر القالب هذا. يمكن فقط للمستخدمين الذين لهم إمكانية الوصول إلى المجموعات المختارة تعديل عنصر القالب هذا. إذا لم يتم تحديد أي مجموعة، فكل المستخدمين الذين لهم إمكانية الوصول إلى المدير سيكون لهم القدرة على تعديل عنصر القالب.';
$_lang['tv_binding_msg'] = 'هذا الحقل يدعم ارتباطات مصدر البيانات باستخدام أوامر @';
$_lang['tv_caption'] = 'تسمية';
$_lang['tv_change_template_msg'] = 'سيؤدي تغيير القالب إلى إعادة تحميل عناصر القالب، وخسارة أي تغييرات غير محفوظة. </ br /><br> هل أنت متأكد من أنك تريد تغيير هذا القالب؟';
$_lang['tv_desc_caption'] = 'النص الذي سيتم استخدامه إلى جانب عناصر القالب عند تعديله في المصدر.';
$_lang['tv_desc_category'] = 'التصنيف الذي ينتمي له عنصر القالب هذا.';
$_lang['tv_desc_description'] = 'وصف مختصر لعنصر القالب هذا.';
$_lang['tv_desc_name'] = 'اسم عنصر القالب هذا. سيكون متاح باستخدام الوسم [[NameOfTV*]].';
$_lang['tv_description'] = 'التوصيف';
$_lang['tv_err_delete'] = 'حصل خطأ أثناء حذف عنصر القالب.';
$_lang['tv_err_duplicate'] = 'حصل خطأ أثناء محاولة تكرار عنصر القالب.';
$_lang['tv_err_duplicate_templates'] = 'حصل خطأ أثناء تكرار قوالب عناصر القالب.';
$_lang['tv_err_duplicate_documents'] = 'حصل خطأ أثناء تكرار مستندات عنصر القالب.';
$_lang['tv_err_duplicate_documentgroups'] = 'حصل خطأ أثناء تكرار مجموعات المستند لعنصر القالب.';
$_lang['tv_err_exists_name'] = 'يوجد مسبقا عنصر قالب بالاسم  "[[name+]]".';
$_lang['tv_err_invalid_name'] = 'يوجد لديك محارف غير صالحة في اسم عنصر القالب.';
$_lang['tv_err_locked'] = 'عنصر القالب مقفل!';
$_lang['tv_err_nf'] = 'لم يتم العثور على عنصر القالب.';
$_lang['tv_err_nfs'] = 'لم يتم العثور على عنصر القالب مع المفتاح: [[id+]]';
$_lang['tv_err_ns'] = 'عنصر القالب غير محدد.';
$_lang['tv_err_reserved_name'] = 'لا يمكن لعنصر القالب أن يملك نفس اسم حقل المصدر.';
$_lang['tv_err_save_access_permissions'] = 'حصل خطأ أثناء محاولة حفظ سماحيات وصول عنصر القالب.';
$_lang['tv_err_save'] = 'حصل خطأ أثناء حفظ عنصر القالب.';
$_lang['tv_inuse'] = 'المستندات (المستند) التالية تستخدم حاليا عنصر القالب هذا. للاستمرار في عملية الحذف اضغط على زر الحذف وإلا اضغط على زر إلغاء الأمر.';
$_lang['tv_input_options'] = 'خيارات الإدخال';
$_lang['tv_input_options_msg'] = '<p>هنا يمكنك تعديل خيارات الإدخال لعنصر القالب، خاص بنوع إعادة رسم المدخل الذي قمت بتحديده.</p>';
$_lang['tv_lock'] = 'قفل العنصر عن التعديل';
$_lang['tv_lock_msg'] = 'يجب أن يكون لدى المستخدمين الواصفة edit_locked من أجل تعديل عنصر القالب هذا.';
$_lang['tv_management_msg'] = 'إدارة حقول محتوى مخصصة إضافية (عناصر القالب) من أجل المستندات الخاصة بك.';
$_lang['tv_msg'] = 'إضافة أو تعديل عناصر القالب هنا. يجب أن يتم إسناد عناصر القالب إلى القوالب لكي يصبح الوصول إليهم ممكنا من كتلة الكود والوثائق.';
$_lang['tv_name'] = 'اسم العنصر';
$_lang['tv_new'] = 'عنصر قالب جديد';
$_lang['tv_novars'] = 'لم يتم العثور على عناصر القالب';
$_lang['tv_output_options'] = 'خيارات الخرج';
$_lang['tv_output_options_msg'] = '<p>هنا يمكنك تعديل خيارات الخرج لعنصر القالب، خاص بنوع إعادة رسم الخرج الذي اخترته.</p>';
$_lang['tv_properties'] = 'الخصائص الافتراضية';
$_lang['tv_rank'] = 'الترتيب';
$_lang['tv_reset_params'] = 'إعادة تعيين البارامترات';
$_lang['tv_sources.intro_msg'] = 'هنا يمكنك إسناد مصادر الوسائط التي ستستخدم لعنصر القالب هذا في كل سياق محدد. انقر نقرا مزدوجا على اسم المصدر في الشبكة لتغييره.';
$_lang['tv_tmpl_access'] = 'الوصول إلى القالب';
$_lang['tv_tmpl_access_msg'] = 'اختر القوالب المسموح لها  بالوصول إلى عنصر القالب هذا.';
$_lang['tv_widget'] = 'شريط';
$_lang['tv_widget_prop'] = 'خصائص الشريط';
$_lang['tvd_err_remove'] = 'حصل خطأ أثناء محاولة إزالة عنصر القالب من المستند.';
$_lang['tvdg_err_remove'] = 'حصل خطأ أثناء محاولة إزالة عنصر القالب من مجموعة المستند.';
$_lang['tvdg_err_save'] = 'حصل خطأ أثناء محاولة إرفاق عنصر القالب بمجموعة المستند.';
$_lang['tvs'] = 'عناصر القالب';
$_lang['tvt_err_nf'] = 'لا يملك عنصر القالب حق الوصول إلى القالب المحدد.';
$_lang['tvt_err_remove'] = 'حصل خطأ أثناء محاولة إزالة عنصر القالب من القالب.';
$_lang['tvt_err_save'] = 'حصل خطأ أثناء محاولة إرفاق عنصر القالب بالقالب.';
