<?php
/**
 * Import English lexicon entries
 *
 * @language en
 * @package modx
 * @subpackage lexicon
 */
$_lang['import_allowed_extensions'] = 'Пазначце падзелены коскамі спіс пашырэнняў файлаў для імпарту.<br /><small><em>Пакіньце пустым каб імпартаваць усе файлы ў адпаведнасці з тыпамі зместу, даступнымі на вашым сайце. Невядомыя тыпы будуць дададзены як звычайны тэкст.</em></small>';
$_lang['import_base_path'] = 'Увядзіце базавы шлях, па якім змешчаны файлы для імпарту.<br /><small><em>Пакіньце пустым, каб выкарыстоўваць наладу мэтавага кантэксту са статычным шляхам да файлаў.</em></small>';
$_lang['import_duplicate_alias_found'] = 'Рэсурс [[+id]] ужо выкарыстоўвае псеўданім [[+alias]]. Калі ласка, увядзіце унікальны псеўданім.';
$_lang['import_element'] = 'Увядзіце каранёвы HTML элемент для імпарту:';
$_lang['import_element_help'] = 'Забеспечце JSON фармату "field":"value". Калі значэнне пачынаецца з $ гэта JQuery-падобны селектар. Полем (field) можа быць поле рэсурсу або імя зменнай шаблону.';
$_lang['import_enter_root_element'] = 'Увядзіце каранёвы элемент для імпарту:';
$_lang['import_files_found'] = '<p><strong>Знойдзена %s дакументаў для імпарту...</strong></p>';
$_lang['import_parent_document'] = 'Бацькоўскі дакумент:';
$_lang['import_parent_document_message'] = 'Выкарыстоўвайце дрэва дакументаў ніжэй, каб выбраць бацькоўскі рэсурс для імпарту файлаў у яго.';
$_lang['import_resource_class'] = 'Выберыце клас modResource для імпарту:<br /><small><em>Выкарыстоўвайце modStaticResource для спасылак на статычныя файлы, або modDocument для капіявання змесціва ў базу дадзеных.</em></small>';
$_lang['import_site_failed'] = '<span style="color:#990000">Няўдала!</span>';
$_lang['import_site_html'] = 'Імпартаваць сайт з HTML';
$_lang['import_site_importing_document'] = 'Імпартуецца файл <strong>%s</strong> ';
$_lang['import_site_maxtime'] = 'Максімальны час імпарту:';
$_lang['import_site_maxtime_message'] = 'Тут вы можаце пазначыць колькасць секунд, цягам якіх MODX можа імпартаваць сайт (будуць перавызначаны налады PHP). Увядзіце "0" для неабмежаванага часу. Калі ласка, звярніце ўвагу, што значэнне "0" або вельмі вялікая колькасць у секундах можа парушыць працу вашага сервера і не рэкамендуецца.';
$_lang['import_site_message'] = '<p>З дапамогай гэтага інструмента вы можаце імпартаваць змесціва з набору HTML-файлаў у базу дадзеных. <em>Калі ласка, звярніце ўвагу, што вам трэба будзе капіяваць файлы і/або каталогі ў каталог core/import.</em></p><p>Калі ласка, запоўніце форму ніжэй, пры неабходнасці абярыце бацькоўскі рэсурс у дрэве дакументаў для імпартаваных файлаў і націсніце «Імпарт HTML», каб пачаць працэс імпарту. Імпартаваныя файлы будуць захаваны ў абраным месцы, выкарыстоўваючы, дзе гэта магчыма, імя файла ў якасці псеўданіма дакумента, загаловак старонкі ў якасці загалоўка дакумента.</p>';
$_lang['import_site_resource'] = 'Імпарт рэсурсаў з статычных файлаў';
$_lang['import_site_resource_message'] = '<p>З дапамогай гэтага інструмента вы можаце імпартаваць у базу дадзеных рэсурсы з набору статычных файлаў. <em>Калі ласка, звярніце ўвагу, што вам трэба будзе капіяваць файлы і/або каталогі ў каталог core/import.</em></p><p>Калі ласка, запоўніце форму ніжэй, пры неабходнасці абярыце бацькоўскі рэсурс у дрэве дакументаў для імпартаваных файлаў і націсніце «Імпарт рэсурсаў», каб пачаць працэс імпарту. Імпартаваныя файлы будуць захаваны ў абраным месцы, выкарыстоўваючы, дзе гэта магчыма, імя файла ў якасці псеўданіма дакумента, і, калі гэта HTML, загаловак старонкі ў якасці загалоўка дакумента.</p>';
$_lang['import_site_skip'] = '<span style="color:#990000">Прапушчана!</span>';
$_lang['import_site_start'] = 'Пачаць імпарт';
$_lang['import_site_success'] = '<span style="color:#009900">Паспяхова!</span>';
$_lang['import_site_time'] = 'Імпарт скончаны. Імпарт заняў %s секунд.';
$_lang['import_use_doc_tree'] = 'Выкарыстоўвайце дрэва дакументаў ніжэй, каб выбраць бацькоўскі рэсурс для імпарту файлаў у яго.';