<?php
/**
 * Login English lexicon topic
 *
 * @language en
 * @package modx
 * @subpackage lexicon
 */
$_lang['login_language'] = 'Мова';
$_lang['login_activation_key_err'] = 'Няправільны код актывацыі! Калі ласка, праверце ліст з кодам актывацыі і пераканайцеся, што вы загрузілі правільны URL.';
$_lang['login_blocked_admin'] = 'Ваш доступ да сістэмы кіравання заблакаваны адміністратарам.';
$_lang['login_blocked_error'] = 'Вы часова заблакаваныя і не можаце ўвайсці ў сістэму кіравання сайтам. Паспрабуйце пазней.';
$_lang['login_blocked_ip'] = 'Вам забаронена ўваходзіць у сістэму кіравання сайтам з гэтага IP-адрасу.';
$_lang['login_blocked_time'] = 'Вам забаронена ўваходзіць у сістэму кіравання сайтам у цяперашні час. Калі ласка, паспрабуйце пазней.';
$_lang['login_blocked_too_many_attempts'] = 'Вы былі заблакаваныя з-за занадта вялікай колькасці няўдалых спробаў уваходу.';
$_lang['login_button'] = 'Увайсці';
$_lang['login_cannot_locate_account'] = 'Няправільнае імя карыстальніка або пароль. Калі ласка, праверце уведзеныя дадзеныя і паспрабуйце зноў.';
$_lang['login_copyright'] = '&copy; 2005-[[+current_year]] by <a href="http://modx.com/about/" target="_blank">MODX, LLC</a>. MODX Revolution&trade; распаўсюджваецца пад ліцэнзіяй GPLv2 ці па больш позняй версіі гэтай ліцэнзіі.';
$_lang['login_email_label'] = 'Email ўліковага запісу:';
$_lang['login_err_unknown'] = 'Пры спробе аўтарызацыі адбылася невядомая памылка.';
$_lang['login_forget_your_login'] = 'Запамятавалi сваё імя карыстальніка?';
$_lang['login_hostname_error'] = 'Імя вашага хаста не паказвае назад на ваш IP-адрас.';
$_lang['login_message'] = 'Калі ласка, увядзіце вашыя уліковыя дадзеныя для ўваходу ў панэль кіравання сайтам. Звярніце ўвагу, вашы імя карыстальніка і пароль адчувальныя да рэгістра!';
$_lang['login_password'] = 'Пароль';
$_lang['login_password_reset_act_sent'] = 'Ліст для скіду пароля дасланы. Калі ласка, праверце паштовую скрыню.';
$_lang['login_remember'] = 'Запомніць мяне';
$_lang['login_send_activation_email'] = 'Даслаць ліст для актывацыі';
$_lang['login_title'] = 'Уваход у панэль кіравання MODX CMF';
$_lang['login_user_err_nf_email'] = 'Карыстальнік з такім адрасам электроннай пошты ці імем не знойдзены. Калі ласка, паспрабуйце яшчэ раз.';
$_lang['login_username'] = 'Імя карыстальніка';
$_lang['login_username_or_email'] = 'Імя карыстальніка або email';
$_lang['login_username_password_incorrect'] = 'Няправільнае імя карыстальніка або пароль. Калі ласка, праверце уведзеныя дадзеныя і паспрабуйце зноў.';
$_lang['login_user_inactive'] = 'Ваш улiковы запiс быў заблакаваны. Калі ласка, звяжыцеся з вашым сістэмным адміністратарам для адмены блакіроўкі.';
