<?php
/**
 * Menu English lexicon topic
 *
 * @language en
 * @package modx
 * @subpackage lexicon
 */
$_lang['action'] = 'Дзеянне';
$_lang['action_desc'] = 'Шлях кантролера для выкарыстання ў гэтым элеменце меню. Шлях да кантролера будуецца шляхам дадання перад пазначаным значэннем шляху прасторы імёнаў, слова controllers і назвы тэмы адмінкі. (Напрыклад: user/update для прасторы імёнаў ядра будзе [core_namespace_path]controllers/[mgr_theme]/user/update.class.php)';
$_lang['description_desc'] = 'Тэкст або ключ слоўніка, які будзе выкарыстаны для паказу тэксту апісання гэтай старонкі ў меню.';
$_lang['handler'] = 'Апрацоўшчык';
$_lang['handler_desc'] = '(Неабавязкова) Калі пазначана, поле Дзеянне не будзе выкарыстоўвацца, але замест гэтага будзе запушчаны JavaScript у той час, калі элемент меню будзе нажаты.';
$_lang['icon'] = 'Значок';
$_lang['icon_desc'] = 'Дадатковы значок або разметка.';
$_lang['lexicon_key'] = 'Ключ слоўніка';
$_lang['lexicon_key_desc'] = 'Тэкст або ключ слоўніка, які будзе выкарыстаны для паказу тэксту загалоўка гэтай старонкі ў меню.';
$_lang['menu_confirm_remove'] = 'Вы ўпэнены, што жадаеце выдаліць меню: "[[+menu]]"?<br />Заўвага: усе залежныя меню таксама будуць выдаленыя!';
$_lang['menu_err_ae'] = 'Меню з такім імем ужо існуе. Калі ласка пазначце іншае імя.';
$_lang['menu_err_nf'] = 'Меню не знойдзена!';
$_lang['menu_err_ns'] = 'Меню не пазначана!';
$_lang['menu_err_remove'] = 'Адбылася памылка пры спробе выдаліць меню.';
$_lang['menu_err_save'] = 'Адбылася памылка пры спробе захаваць меню.';
$_lang['menu_parent'] = 'Бацькоўскае меню';
$_lang['menu_parent_err_ns'] = 'Бацькоўскае меню не пазначана!';
$_lang['menu_parent_err_nf'] = 'Бацькоўскае меню не знойдзена!';
$_lang['menu_top'] = 'Галоўнае меню';
$_lang['menus'] = 'Меню';
$_lang['namespace'] = 'Прастора імёнаў';
$_lang['namespace_desc'] = 'Прастора імёнаў на якой аснаваны гэты элемент меню. Гэтая налада вызначыць шлях для загружаемага кантролера.';
$_lang['parameters'] = 'Параметры';
$_lang['parameters_desc'] = 'Любыя параметры, якія вы хочаце дадаць да выніковай URL у час кліку па гэтым меню. (Напрыклад: &expier=1)';
$_lang['permissions'] = 'Дазволы';
$_lang['permissions_desc'] = 'Ключ дазволу які патрэбны для загрузкі гэтага элемента меню.';
$_lang['topmenu'] = 'Галоўнае меню';
$_lang['topmenu_desc'] = 'Тут дазволена звязаць дзеянні з элементамі меню ў верхнім радку меню сістэмы кіравання MODX. Проста змясціце элементы меню ў пажаданым парадку.';
