<?php
/**
 * Setting English lexicon topic
 *
 * @language en
 * @package modx
 * @subpackage lexicon
 */
$_lang['area'] = 'Раздзел';
$_lang['area_authentication'] = 'Аўтэнтыфікацыя і бяспека';
$_lang['area_caching'] = 'Кэшаванне';
$_lang['area_core'] = 'Ядро';
$_lang['area_editor'] = 'Тэкставы рэдактар';
$_lang['area_file'] = 'Файлавая сістэма';
$_lang['area_filter'] = 'Фільтр па раздзеле...';
$_lang['area_furls'] = 'Дружалюбныя URL';
$_lang['area_gateway'] = 'Шлюз';
$_lang['area_language'] = 'Слоўнік і мовы';
$_lang['area_mail'] = 'Пошта';
$_lang['area_manager'] = 'Сістэма кіравання';
$_lang['area_phpthumb'] = 'phpThumb';
$_lang['area_proxy'] = 'Проксі';
$_lang['area_session'] = 'Сеансы і кукі';
$_lang['area_lexicon_string'] = 'Вобласць запісу слоўніка';
$_lang['area_lexicon_string_msg'] = 'Увядзіце ключ запісу слоўніка для раздзела. Калі запіс з такім ключом не будзе знойдзена, адлюструецца сам ключ. <br /> Раздзелы прасторы «core»: authentication, caching, file, furls, gateway, language, manager, session, site, system';
$_lang['area_site'] = 'Сайт';
$_lang['area_system'] = 'Сістэма і сервер';
$_lang['areas'] = 'Раздзелы';
$_lang['charset'] = 'Кадоўка';
$_lang['country'] = 'Краіна';
$_lang['description_desc'] = 'Кароткае апісанне налады. Можна паказаць ключ слоўніка.';
$_lang['key_desc'] = 'Ключ налады. Налада будзе даступная ў кантэнце праз падстаноўшчык [[++ key]].';
$_lang['name_desc'] = 'Назва налады. Можна паказаць ключ слоўніка.';
$_lang['namespace'] = 'Прастора імёнаў';
$_lang['namespace_desc'] = 'Прастора назваў, з якім гэты параметр звязаны. Тэма слоўніка "default" для гэтай прасторы імёнаў будзе выкарыстана пры праглядзе.';
$_lang['namespace_filter'] = 'Фільтр па прасторы імёнаў...';
$_lang['search_by_key'] = 'Пошук па ключу...';
$_lang['setting_create'] = 'Стварыць новую наладу';
$_lang['setting_err'] = 'Калі ласка, праверце свае дадзенныя ў наступных палях: ';
$_lang['setting_err_ae'] = 'Налада з такім ключом ужо існуе. Калі ласка, пазначце іншы ключ.';
$_lang['setting_err_nf'] = 'Налада не знойдзена.';
$_lang['setting_err_ns'] = 'Налада не пазначана';
$_lang['setting_err_remove'] = 'Адбылася памылка пры спробе выдаліць наладу.';
$_lang['setting_err_save'] = 'Адбылася памылка пры спробе захаваць наладу.';
$_lang['setting_err_startint'] = 'Назва налады не можа пачынацца з лічбы.';
$_lang['setting_err_invalid_document'] = 'Дакумент з ID %d не існуе. Калі ласка, выберыце існуючы дакумент.';
$_lang['setting_remove'] = 'Выдаліць наладу';
$_lang['setting_remove_confirm'] = 'Вы сапраўды жадаеце выдаліць гэтую наладу? Гэта можа парушыць працу MODX.';
$_lang['setting_update'] = 'Абнавіць наладу';
$_lang['settings_after_install'] = 'У выпадку новай устаноўкі вам неабходна пракантраляваць уведзеныя налады, і, пры неабходнасці, змяніць іх. Пасля таго, як вы праверыце ўсе налады, націсніце «Захаваць» для абнаўлення налад базы даных. <br /> <br />';
$_lang['settings_desc'] = 'Тут вы можаце змяніць асноўныя опцыі і налады панэлі кіравання, а гэтак жа функцыянавання сайта. Двойчы клікніце па наладзе ў калонцы «Значэнне» для рэдактавання, або клікніце правай кнопкай мышы для іншых дзеянняў. Каб убачыць апісанне налады, націсніце на «+».';
$_lang['settings_furls'] = 'Дружалюбныя URL';
$_lang['settings_misc'] = 'Рознае';
$_lang['settings_site'] = 'Сайт';
$_lang['settings_ui'] = 'Інтэрфэйс і асаблівасці';
$_lang['settings_users'] = 'Карыстальнік';
$_lang['system_settings'] = 'Сістэмныя налады';
$_lang['usergroup'] = 'Група карыстальнiкаў';

// user settings
$_lang['setting_access_category_enabled'] = 'Правяраць доступ да катэгорыі';
$_lang['setting_access_category_enabled_desc'] = 'Уключае ці адключае праверку правоў доступу да катэгорый (для кожнага кантэксту). <strong>ВАЖНА: Калі гэтая налада ўстаноўлена ў «Не», то ўсе палітыкі доступу да катэгорый будуць ігнаравацца!</strong>';

$_lang['setting_access_context_enabled'] = 'Правяраць доступ да кантэксту';
$_lang['setting_access_context_enabled_desc'] = 'Выкарыстоўвайце гэтую функцыю, каб уключыць або адключыць кантэкстныя праверкі ACL. <strong>Заўвага: Калі гэты параметр устаноўлены як не, то ўсе правы доступу да кантэксту будуць ігнаравацца. НЕ адключайце гэтую наладу ў маштабах усёй сістэмы, інакш вы страціце доступ да сістемы кіравання.</strong>';

$_lang['setting_access_resource_group_enabled'] = 'Правяраць доступ да групы рэсурсаў';
$_lang['setting_access_resource_group_enabled_desc'] = 'Уключае ці адключае праверку правоў доступу да групы рэсурсаў. <strong> ВАЖНА: Калі гэтая налада ўстаноўлена ў «Не», то ўсе палітыкі доступу да групв рэсурсаў будуць ігнаравацца! </strong>';

$_lang['setting_allow_mgr_access'] = 'Доступ да панэлі кіравання';
$_lang['setting_allow_mgr_access_desc'] = 'Актывуйце дадзеную опцыю для доступу або забароны доступу да панэлі кіравання. <strong> ВАЖНА: Калі гэтая налада ўстаноўлена ў «Не», то карыстальнікі будуць перанакіраваныя на старонку аўтарызацыі або на галоўную старонку! </strong>';

$_lang['setting_failed_login'] = 'Няўдалыя спробы ўваходу';
$_lang['setting_failed_login_desc'] = 'Тут вы можаце ўвесці дазволеную колькасць няўдалых спробаў ўваходу ў сістэму, перш чым карыстальнік будзе заблакаваны.';

$_lang['setting_login_allowed_days'] = 'Дазволеныя дні';
$_lang['setting_login_allowed_days_desc'] = 'Выберыце дні, у якія карыстальніку дазволена ўваходзіць у сістэму.';

$_lang['setting_login_allowed_ip'] = 'Дазволены IP-адрас';
$_lang['setting_login_allowed_ip_desc'] = 'Калі ласка, увядзіце IP-адрасы, з якіх карыстальнік можа ўвайсці ў сістэму. <strong> Заўвага: калі некалькі адрасоў, запішыце іх праз коску (,)</strong>';

$_lang['setting_login_homepage'] = 'Увайсці ў галоўную старонку';
$_lang['setting_login_homepage_desc'] = 'Калі ласка, увядзіце ідэнтыфікатар дакумента, на які вы хочаце адправіць карыстальніка пасля таго, як ён/яна зойдзе ў сістэму.<strong>УВАГА: Пераканайцеся, што ідэнтыфікатар належыць да існуючага дакумента і што ён быў апублікаваны і даступны для гэтага карыстальніка!</strong>';

// system settings
$_lang['setting_access_policies_version'] = 'Версія сістэмы кіравання палітыкамі доступу';
$_lang['setting_access_policies_version_desc'] = 'Версія сістэмы кіравання палітыкамі доступу. Не змяняйце!';

$_lang['setting_allow_forward_across_contexts'] = 'Дазволіць перанакіраванне скрозь кантэксты';
$_lang['setting_allow_forward_across_contexts_desc'] = 'Калі дазволена, сімвалічныя спасылкі і метад API modX::sendForward() змогуць перанакіроўваць запыты на рэсурсы з іншых кантэкстаў.';

$_lang['setting_allow_manager_login_forgot_password'] = 'Адлюстроўваць «Забыўся пароль» на старонцы ўваходу ў панэль кіравання';
$_lang['setting_allow_manager_login_forgot_password_desc'] = 'Калі выбрана «Не», «Забыўся пароль» на старонцы ўваходу ў панэль кіравання не будзе адлюстроўвацца.';

$_lang['setting_allow_tags_in_post'] = 'Дазволіць тэгі ў POST';
$_lang['setting_allow_tags_in_post_desc'] = 'Калі не, з усіх зменных POST будуць выдалены тэгі HTML, лічбавыя сутнасці і тэгі MODX. MODX рэкамендуе пакінуць значэнне Не для ўсіх кантэкстаў, акрамя mgr, дзе яно ўстаноўлена ў Так па змаўчанні.';

$_lang['setting_allow_tv_eval'] = 'Адключыць выканане кода ў зменных шаблону';
$_lang['setting_allow_tv_eval_desc'] = 'Выберыце гэты параметр, каб уключыць або адключыць выкананне кода ў зменнай шаблону. Калі гэты параметр мае значэнне «Не», код ці значэнне будзе апрацавана як звычайны тэкст.';

$_lang['setting_anonymous_sessions'] = 'Ананімныя сесіі';
$_lang['setting_anonymous_sessions_desc'] = 'Калі параметр адключаны, доступ да PHP-сесіі будуць мець толькі карыстальнікі, якія прайшлі праверку. Гэта дазволіць паменшыць накладныя выдаткі для ананімных карыстальнікаў, калі ім не патрэбен доступ да унікальнай сесіі. Гэтая налада не будзе працаваць, калі параметр <i> session_enabled </ i> мае значэнне <b> false </ b> (выключаны), таму што сесіі і так не будуць стварацца.';

$_lang['setting_archive_with'] = 'Выкарыстоўваць PCLZip';
$_lang['setting_archive_with_desc'] = 'Калі выбрана «Так», праца з zip архівамі будзе выкарыстоўвацца PCLZip замест ZipArchive. Выберыце «Так», калі вы атрымліваеце "extractTo" памылкі ці ўзнікаюць праблемы з распакаваннем пакетаў.';

$_lang['setting_auto_menuindex'] = 'Нумарацыя меню па змаўчанні';
$_lang['setting_auto_menuindex_desc'] = 'Выберыце «Так» для аўтаматычнай нумарацыі меню па змаўчанні.';

$_lang['setting_auto_check_pkg_updates'] = 'Аўтаматычна правяраць абнаўленні пакетаў';
$_lang['setting_auto_check_pkg_updates_desc'] = 'Калі выбрана «Так», MODX будзе аўтаматычна правяраць наяўнасць абнаўленняў для пакетаў у кіраўніку пакетамі. Гэта можа запаволіць загрузку табліцы з пакетамі.';

$_lang['setting_auto_check_pkg_updates_cache_expire'] = 'Час жыцця кэша вынікаў аўтаматычнай праверкі наяўнасці абнаўленняў пакетаў';
$_lang['setting_auto_check_pkg_updates_cache_expire_desc'] = 'Працягласць часу у хвілінах, на які кіраўнік пакетамі будзе кэшаваць вынікі праверкі наяўнасці абнаўленняў пакетаў.';

$_lang['setting_allow_multiple_emails'] = 'Дазволіць дубляванне email для карыстальнікаў';
$_lang['setting_allow_multiple_emails_desc'] = 'Калі дазволена, некалькі карыстыльнікаў змогуць выкарыстоўваць аднолькавы email.';

$_lang['setting_automatic_alias'] = 'Аўтаматычна генераваць псеўданім';
$_lang['setting_automatic_alias_desc'] = 'Выберыце «Так» для аўтаматычнай генерацыі псеўданімаў на аснове загалоўка рэсурсу падчас яго захавання.';

$_lang['setting_base_help_url'] = 'Базавы URL дапамогі';
$_lang['setting_base_help_url_desc'] = 'Базавы URL для спасылак дапамогі ў верхнім правым куце старонак панэлі кіравання.';

$_lang['setting_blocked_minutes'] = 'Працягласць блакавання';
$_lang['setting_blocked_minutes_desc'] = 'Тут вы можаце ўвесці колькасць хвілін, на працягу якіх карыстальнік будзе заблакаваны, калі ён дасягне максімальнай колькасці дазволеных няўдалых спробаў уваходу ў сістэму. Калі ласка, увядзіце гэтае значэнне толькі лічбамі (без косак, прабелаў і г. д.)';

$_lang['setting_cache_action_map'] = 'Дазволіць кэшаванне мапы дзеянняў';
$_lang['setting_cache_action_map_desc'] = 'Калі дазволена, мапа дзеянняў (або пама кантролераў) будзе кэшавацца для паскарэння загрузкі старонак сістэмы кіравання.';

$_lang['setting_cache_alias_map'] = 'Дазволіць кэшаванне карты псеўданімаў кантэксту';
$_lang['setting_cache_alias_map_desc'] = 'Калі выбрана «Так», усе URI рэсурсаў кэшуюцца ў кантэкст. Ўключайце для невялікіх сайтаў і адключайце для вялікіх сайтаў для павелічэння прадукцыйнасці.';

$_lang['setting_use_context_resource_table'] = 'Выкарыстоўваць табліцу context_resource';
$_lang['setting_use_context_resource_table_desc'] = 'Калі ўключана, падчас абнаўлення кантэксту будзе выкарыстоўвацца табліца context_resource. Гэта дазваляе праграмна мець адзін рэсурс у некалькіх кантэкстах адначасова. Калі вы не выкарыстоўваеце гэтыя рэсурсы ў мностве кантэкстаў праз API, можна задаць гэтае значэнне роўным false. На буйных сайтах вы можаце атрымаць патэнцыйны прырост прадукцыйнасці адмінкі.';

$_lang['setting_cache_context_settings'] = 'Дазволіць кэшаванне налад кантэкстаў';
$_lang['setting_cache_context_settings_desc'] = 'Калі дазволена, налады кантэкстаў будуць кэшавацца для паскарэння загрузкі старонак.';

$_lang['setting_cache_db'] = 'Дазволіць кэшаванне базы дадзеных';
$_lang['setting_cache_db_desc'] = 'Калі выбрана «Так», аб\'екты і наборы вынікаў выбаркі па SQL-запытах кэшуюцца, значна зніжаючы нагрузку на базу.';

$_lang['setting_cache_db_expires'] = 'Час жыцця кэша базы дадзеных';
$_lang['setting_cache_db_expires_desc'] = 'Гэтае значэнне (у секундах) ўсталёўвае перыяд жыцця кэша для вынікаў звароту да базы дадзеных.';

$_lang['setting_cache_db_session'] = 'Ўключыць кэшаванне сесій, якія апрацоўвае база даных';
$_lang['setting_cache_db_session_desc'] = 'Калі выбрана «Так», і налада "cache_db" ўключана, сесіі, якія захоўваюцца ў базе даных, будуць таксама кэшавацца.';

$_lang['setting_cache_db_session_lifetime'] = 'Час жыцця кэша сесій базы даных';
$_lang['setting_cache_db_session_lifetime_desc'] = 'Гэта значэнне (у секундах) ўсталёўвае перыяд жыцця кэша сесій базы даных.';

$_lang['setting_cache_default'] = 'Кэшаваць па змаўчанні';
$_lang['setting_cache_default_desc'] = 'Выберыце \'Так\', каб зрабіць усё новыя рэсурсы кэшаванымі па змаўчанні.';
$_lang['setting_cache_default_err'] = 'Кэшаваць рэсурсы па змаўчанні?';

$_lang['setting_cache_disabled'] = 'Адключыць глабальнае кэшаванне';
$_lang['setting_cache_disabled_desc'] = 'Выберыце «Так» для адключэння ўсяго механізму кэшавання MODX.';
$_lang['setting_cache_disabled_err'] = 'Калі ласка, увядзіце уключана ці не кэшаванне.';

$_lang['setting_cache_expires'] = 'Час жыцця звычайнага кэша';
$_lang['setting_cache_expires_desc'] = 'Гэтае значэнне (у секундах) усталёўвае час жыцця звычайнага кэша.';

$_lang['setting_cache_format'] = 'Фармат кэша для выкарыстання';
$_lang['setting_cache_format_desc'] = '0 = PHP, 1 = JSON, 2 = serialize. Адзін з фарматаў';

$_lang['setting_cache_handler'] = 'Клас-апрацоўшчык сістэмы кэшавання';
$_lang['setting_cache_handler_desc'] = 'Імя класа-апрацоўшчыка, які выкарыстоўваецца для кэшавання.';

$_lang['setting_cache_lang_js'] = 'Кэшаваць javascript-файлы з запісамі слоўніка';
$_lang['setting_cache_lang_js_desc'] = 'Калі выбрана «Так», будуць дададзеныя кэшуючыя загалоўкі да javascript-файлаў з запісамі слоўнікаў для панэлі кіравання.';

$_lang['setting_cache_lexicon_topics'] = 'Кэшаваць тэмы слоўнікаў';
$_lang['setting_cache_lexicon_topics_desc'] = 'Калі выбрана «Так», усе тэмы слоўнікаў будуць кэшавацца - гэта павялічвае хуткасць загрузкі старонак панэлі кіравання. MODX рэкамендуе пакінуць гэты параметр уключаным («Так»).';

$_lang['setting_cache_noncore_lexicon_topics'] = 'Кэшаваць тэмы слоўнікаў па-за ядром';
$_lang['setting_cache_noncore_lexicon_topics_desc'] = 'Калі выбрана «Не», тэмы слоўнікаў, якія не ўваходзяць у ядро, не будуць кэшавацца. Гэта можа быць зручна пры распрацоўцы кампанентаў.';

$_lang['setting_cache_resource'] = 'Дазволіць частковае кэшаванне рэсурсаў';
$_lang['setting_cache_resource_desc'] = 'Калі выбрана «Так», частковае кэшаванне вызначаецца самімі рэсурсамі. Адключэнне опцыі адключыць яго на ўсім сайце.';

$_lang['setting_cache_resource_expires'] = 'Час жыцця частковага кэшу рэсурсаў';
$_lang['setting_cache_resource_expires_desc'] = 'Гэта значэнне (у секундах) ўсталёўвае перыяд жыцця частковага кэшу рэсурсаў.';

$_lang['setting_cache_scripts'] = 'Уключыць кэшаванне скрыптоў';
$_lang['setting_cache_scripts_desc'] = 'Калі дазволена, MODX будзе кэшаваць усе скрыпты (сніпеты і плагіны) у файлы для павелічэння хуткасці загрузкі. MODX рэкамендуе пакінуць гэтую наладу дазволенай (значэнне «Так»).';

$_lang['setting_cache_system_settings'] = 'Дазволіць кэшаванне наладаў сістэмы';
$_lang['setting_cache_system_settings_desc'] = 'Калі дазволена, налады сістэмы будуць кэшавацца для паскарэння загрузкі старонак. MODX рэкамендуе пакінуць гэтую наладу дазволенай.';

$_lang['setting_clear_cache_refresh_trees'] = 'Абнаўляць дрэвападобныя меню пры ачыстцы кэша сайта';
$_lang['setting_clear_cache_refresh_trees_desc'] = 'Калі дазволена, пасля абнаўлення кэша сайта будуць абнаўляцца ўсе дрэвападобныя меню.';

$_lang['setting_compress_css'] = 'Выкарыстоўваць сціснуты CSS';
$_lang['setting_compress_css_desc'] = 'Калі гэта опцыя ўключаная, MODX будзе выкарыстоўваць сціснутую версію CSS стыляў у інтэрфэйсе адмінкі.';

$_lang['setting_compress_js'] = 'Выкарыстоўваць сціснутыя JavaScript файлы';
$_lang['setting_compress_js_desc'] = 'Калі гэта опцыя ўключаная, MODX будзе выкарыстоўваць сціснутую версію скрыптоў ядра.';

$_lang['setting_compress_js_groups'] = 'Выкарыстоўваць групоўку падчас сціску JavaScript';
$_lang['setting_compress_js_groups_desc'] = 'Групаваць javascript-файлы панэлі кіравання MODX, выкарыстоўваючы канфігурацыю "groupsConfig" для Google кампрэсара. Выберыце «Так», калі вы карыстаецеся пашырэнне "suhosin" ці ў іншых праблемных выпадках.';

$_lang['setting_compress_js_max_files'] = 'Максімальная колькасць сцісканых javascript-файлаў';
$_lang['setting_compress_js_max_files_desc'] = 'Максімальная колькасць javascript-файлаў, сціскаючых MODX за раз, калі ўключаны сціск javascript-бібліятэк. Паменьшыце значэнне, калі ўзнікаюць праблемы з Google кампрэсарам ў панэлі кіравання.';

$_lang['setting_concat_js'] = 'Выкарыстоўваць аб\'яднаныя Javascript-бібліятэкі';
$_lang['setting_concat_js_desc'] = 'Калі выбрана «Так», MODX будзе выкарыстоўваць аб\'яднаныя версіі javascript-бібліятэк у панэлі кіравання. Гэта істотна павялічвае хуткасць загрузкі старонак панэлі кіравання.';

$_lang['setting_confirm_navigation'] = 'Пацвярджаць пераходы паміж старонкамі з незахаванымі зменамі';
$_lang['setting_confirm_navigation_desc'] = 'Калі выбрана «Так», карыстальніку патрэбна будзе пацвердзіць свой намер перайсці, калі ёсць незахаваныя змены на старонцы.';

$_lang['setting_container_suffix'] = 'Суфікс кантэйнера';
$_lang['setting_container_suffix_desc'] = 'Суфікс, які будзе дадавацца да псеўданіма рэсурсу-кантэйнера (пры дазволеных дружалюбных URL).';

$_lang['setting_context_tree_sort'] = 'Дазволіць сартаванне кантэкстаў у дрэве рэсурсаў';
$_lang['setting_context_tree_sort_desc'] = 'Калі выбрана «Так», кантэксты будуць сартавацца па алфавіце ў дрэве рэсурсаў.';
$_lang['setting_context_tree_sortby'] = 'Поле для сартавання кантэкстаў у дрэве рэсурсаў';
$_lang['setting_context_tree_sortby_desc'] = 'Поле, па якім будуць сартавацца кантэксты ў дрэве рэсурсаў, калі сартаванне дазволена.';
$_lang['setting_context_tree_sortdir'] = 'Напрамак сартавання кантэкстаў у дрэве рэсурсаў';
$_lang['setting_context_tree_sortdir_desc'] = 'Напрамак сартавання кантэкстаў у дрэве рэсурсаў, калі сартаванне дазволена.';

$_lang['setting_cultureKey'] = 'Мова';
$_lang['setting_cultureKey_desc'] = 'Абярыце мову для ўсіх кантэкстаў, за выключэннем сістэмы кіравання.';

$_lang['setting_date_timezone'] = 'Часавы пояс па змаўчанні';
$_lang['setting_date_timezone_desc'] = 'Калі паказана, вызначае часовую зону па змаўчанні для PHP-функцый, якія працуюць з датамі. Спіс падтрымоўваных значэнняў глядзіце <a href="http://php.net/timezones" target="_blank"> тут</a>. Калі не пазначана, і PHP ini-параметр "date.timezone" не зададзены ў вашым асяроддзі, будзе выкарыстоўвацца Сусветны каардынаваны час.';

$_lang['setting_debug'] = 'Адладка';
$_lang['setting_debug_desc'] = 'Уключае / выключае рэжым адладкі ў MODX і / або ўсталёўвае ўзровень адлюстравання памылак для PHP. "" - выкарыстоўваць гэты error_reporting, "0" - адключыць (error_reporting = 0), "1" - уключыць (error_reporting = -1), або любое іншае значэнне error_reporting (як лік).';

$_lang['setting_default_content_type'] = 'Тып змесціва па змаўчанні';
$_lang['setting_default_content_type_desc'] = 'Выберыце тып змесціва, які будзе выкарыстоўвацца па змаўчанні падчас стварэння новага рэсурсу. Вы заўсёды зможаце змяніць тып змесціва пры рэдагаванні рэсурсу. Гэтая налада толькі папярэдне пазначае адзін с тыпаў змесціва для зручнасці.';

$_lang['setting_default_duplicate_publish_option'] = 'Налады публікацыі пры капіраванні рэсурсаў';
$_lang['setting_default_duplicate_publish_option_desc'] = 'Абярыце налады публікацыі пры капіраванні рэсурсу. Можа быць "unpublish" - усё копіі будуць зняты з публікацыі, "publish" - усё копіі будуць апублікаваныя, або "preserve" - у копіі будзе захавана стан публікацыі капіруемага рэсурсу.';

$_lang['setting_default_media_source'] = 'Крыніца файлаў па змаўчанні';
$_lang['setting_default_media_source_desc'] = 'Крыніца файлаў, загружаемая па змаўчанні.';

$_lang['setting_default_template'] = 'Шаблон па змаўчанні';
$_lang['setting_default_template_desc'] = 'Выберыце шаблон па змаўчанні, які вы жадаеце выкарыстоўваць для новых рэсурсаў. Вы таксама можаце выбраць іншы шаблон ў рэдактары рэсурсаў, гэтая налада толькі папярэдне выбірае адзін з вашых шаблонаў.';

$_lang['setting_default_per_page'] = 'Колькасць на старонцы па змаўчанні';
$_lang['setting_default_per_page_desc'] = 'Колькасць радкоў, якія адлюстроўваюцца ў табліцах сістэмы кіравання, па змаўчанні.';

$_lang['setting_editor_css_path'] = 'Шлях да CSS-файлу';
$_lang['setting_editor_css_path_desc'] = 'Пакажыце шлях да CSS-файлу, які павінен выкарыстоўвацца тэкставым рэдактарам. Лепш за ўсё паказаць шлях ад каранёвага каталога вашага сервера, напрыклад: "/assets/site/style.css". Пакіньце гэта поле пустым, калі не жадаеце выкарыстоўваць стылі ў рэдактары.';

$_lang['setting_editor_css_selectors'] = 'CSS-селектары для тэкставага рэдактара';
$_lang['setting_editor_css_selectors_desc'] = 'Падзелены коскамі спіс CSS-селектараў для тэкставага рэдактара.';

$_lang['setting_emailsender'] = 'Адрас электроннай пошты';
$_lang['setting_emailsender_desc'] = 'Пазначце адрас электроннай пошты, ад імя якога будзе вырабляцца адпраўка пошты карыстальнікам з імёнамі рахункаў і паролямі.';
$_lang['setting_emailsender_err'] = 'Калі ласка, пазначце адрас электроннай пошты адміністратара.';

$_lang['setting_emailsubject'] = 'Тэма ліста падчас рэгістрацыі';
$_lang['setting_emailsubject_desc'] = 'Пазначце тэкст, які будзе адлюстраваны ў пісьме пацверджання рэгістрацыі, у полі «Тэма».';
$_lang['setting_emailsubject_err'] = 'Калі ласка, усталюйце поле «Тэма» пісьма аб пацверджанні рэгістрацыі.';

$_lang['setting_enable_dragdrop'] = 'Дазволіць перасоўванне ў дрэвах рэсурсаў і элементаў';
$_lang['setting_enable_dragdrop_desc'] = 'Калі выключана, перасоўванне вузлоў у дрэвах рэсурсаў і элементаў будзе забаронена.';

$_lang['setting_error_page'] = 'Старонка памылкі';
$_lang['setting_error_page_desc'] = 'Калі ласка, пазначце ідэнтыфікатар дакумента, на які вы жадаеце адправіць карыстальнікаў, калі яны просяць дакумент, які на самой справе не існуе (404, старонка не знойдзена).
<strong>Заўвага: пераканайцеся, што пазначаны вамі ID належыць да існуючага дакумента і гэты дакумент апублікаваны!</strong>';
$_lang['setting_error_page_err'] = 'Калі ласка, пазначце ідэнтыфікатар дакумента, які з\'яўляецца старонкай паведамлення аб памылцы.';

$_lang['setting_ext_debug'] = 'Адладка ExtJS';
$_lang['setting_ext_debug_desc'] = 'Загружаць ці не файл ext-all-debug.js для дапамогі з адладкай вашага кода на ExtJS.';

$_lang['setting_extension_packages'] = 'Пакеты пашырэнняў';
$_lang['setting_extension_packages_desc'] = 'JSON масіў з пакетамі пашырэнняў, якія неабходна загрузіць пры стварэнні асобніка класа MODX. У фармаце: [{"packagename":{"path":"path/to/package"}},{"anotherpackagename":{"path":"path/to/otherpackage"}}]';

$_lang['setting_enable_gravatar'] = 'Дазволіць Gravatar';
$_lang['setting_enable_gravatar_desc'] = 'Калі гэты параметр уключаны, у якасці выявы профілю будзе выкарыстоўвацца фота з сервісу Gravatar (калі карыстальнік не мае ўласнага загружанага фота).';

$_lang['setting_failed_login_attempts'] = 'Няўдалыя спробы ўваходу';
$_lang['setting_failed_login_attempts_desc'] = 'Колькасць няўдалых спробаў ўваходу ў сістэму, дазволеных карыстальніку, перад тым, як стаць "заблакаваным".';

$_lang['setting_fe_editor_lang'] = 'Мова тэкставага рэдактара на фронтенде сайта';
$_lang['setting_fe_editor_lang_desc'] = 'Абярыце мову, якая будзе выкарыстоўвацца ў тэкставым рэдактары на фронтенде сайта.';

$_lang['setting_feed_modx_news'] = 'URL стужкі навiн MODX';
$_lang['setting_feed_modx_news_desc'] = 'Пазначце спасылку на канал RSS для віджэту «Навіны MODX».';

$_lang['setting_feed_modx_news_enabled'] = 'Паказваць віджэт «Навіны MODX»';
$_lang['setting_feed_modx_news_enabled_desc'] = 'Калі «Не», MODX схавае стужку навін на галоўным экране сістэмы кіравання.';

$_lang['setting_feed_modx_security'] = 'URL канала «Апавяшчэнні бяспекі MODX»';
$_lang['setting_feed_modx_security_desc'] = 'Пазначце URL RSS-канала для віджэту «Апавяшчэнні бяспекі MODX».';

$_lang['setting_feed_modx_security_enabled'] = 'Адлюстраванне RSS-канала «Апавяшчэнні бяспекі MODX»';
$_lang['setting_feed_modx_security_enabled_desc'] = 'Калі выбрана «Не», MODX будзе хаваць стужку «Апавяшчэнні бяспекі MODX» на экране прывітання панэлі кіравання.';

$_lang['setting_filemanager_path'] = 'Шлях для дыспетчара файлаў (састарэла)';
$_lang['setting_filemanager_path_desc'] = 'Гэты параметр састарэў - выкарыстоўвайце крыніцы файлаў. Сервер IIS часцяком не вызначае ўласцівасць "document_root", якое выкарыстоўваецца дыспетчарам файлаў для вызначэння месцаў, якія вам даступныя. Калі ў вас узніклі праблемы з выкарыстаннем дыспетчара файлаў, пераканайцеся што гэты шлях паказвае ў каранёвую папку ўстаноўкі MODX.';

$_lang['setting_filemanager_path_relative'] = 'Ці адносны шлях аглядніка файлаў? (Састарэла)';
$_lang['setting_filemanager_path_relative_desc'] = 'Гэты параметр састарэў - выкарыстоўвайце крыніцы файлаў. Калі шлях для дыспетчара файлаў ("filemanager_path") з\'яўляецца адносным да MODX "base_path", то ўсталюйце для гэтага параметру значэнне «Так». Калі "filemanager_path" за межамі "docroot", усталюеце значэнне «Не».';

$_lang['setting_filemanager_url'] = 'Url аглядніка файлаў (састарэла)';
$_lang['setting_filemanager_url_desc'] = 'Гэты параметр састарэў - выкарыстоўвайце крыніцы файлаў. Не абавязкова. Задайце, калі хочаце ўсталяваць відавочны URL-адрас для доступу да файлаў ў дыспетчару файлаў MODX (карысна, калі вы паказалі "filemanager_path" звонку каранёвай дырэкторыі MODX). Пераканайцеся, што гэта URL-адрас "filemanager_path" даступны. Калі пакінуць поле пустым, MODX паспрабуе аўтаматычна вылічыць яго.';

$_lang['setting_filemanager_url_relative'] = 'Ці адносны URL аглядніка файлаў? (Састарэла)';
$_lang['setting_filemanager_url_relative_desc'] = 'Гэты параметр састарэў - выкарыстоўвайце крыніцы файлаў. Калі шлях для дыспетчара файлаў ("filemanager_url") з\'яўляецца адносным да MODX "base_url", то ўсталюеце для гэтага параметру значэнне «Так».';

$_lang['setting_forgot_login_email'] = 'Пісьмо аднаўлення пароля';
$_lang['setting_forgot_login_email_desc'] = 'Шаблон электроннага пісьма, адсыланага пры запыце карыстальнікам аднаўлення імя і / або пароля.';

$_lang['setting_form_customization_use_all_groups'] = 'Ўлічваць знаходжанне ва ўсіх групах карыстальніка для налады формаў';
$_lang['setting_form_customization_use_all_groups_desc'] = 'Калі выбрана «Так», для налады формаў будуць выкарыстоўвацца ўсе наборы правілаў для ўсіх груп, у якія ўваходзіць карыстальнік. У адваротным выпадку, будуць выкарыстоўвацца наборы правілаў толькі для першаснай групы. Важна: пры ўключэнні гэтай налады магчымыя памылкі з-за канфліктаў набораў правіл налады формаў.';

$_lang['setting_forward_merge_excludes'] = 'sendForward выключаныя палі';
$_lang['setting_forward_merge_excludes_desc'] = 'Пры выкарыстанні сімвалічнай ссылкі яе непустыя паля перавызначаць значэння адпаведных палёў мэтавага рэсурсу; выкарыстоўвайце гэты, падзелены коскамі спіс палёў для таго, каб адключыць пераазначэнне палёў рэсурсу палямі сімвалічнай спасылкі.';

$_lang['setting_friendly_alias_lowercase_only'] = 'Толькі малыя сімвалы ў псеўданімах';
$_lang['setting_friendly_alias_lowercase_only_desc'] = 'Дазволіць выкарыстоўваць толькі малыя сімвалы ў псеўданімах рэсурсаў.';

$_lang['setting_friendly_alias_max_length'] = 'Максімальная даўжыня псеўданіма';
$_lang['setting_friendly_alias_max_length_desc'] = 'Калі паказана больш за нуль, зададзенае значэнне будзе выкарыстоўвацца як максімальны лік сімвалаў, дапушчальнае ў псеўданіме рэсурсаў. Нуль азначае адсутнасць абмежавання.';

$_lang['setting_friendly_alias_realtime'] = 'Ствараць ЧПУ-псеўданім (так званыя «дружалюбныя URL») "на ляту"';
$_lang['setting_friendly_alias_realtime_desc'] = 'Вызначае, ці павінен псеўданім рэсурсу стварацца "на ляту" пры ўводзе загалоўка ці гэта павінна здарацца калі рэсурс захаваны (налада "automatic_alias" павінна быць уключана, каб гэта працавала).';

$_lang['setting_friendly_alias_restrict_chars'] = 'Метад фільтрацыі знакаў у псеўданімах';
$_lang['setting_friendly_alias_restrict_chars_desc'] = 'Метад фільтрацыі знакаў у псеўданімах рэсурсу. "Pattern" - псеўданім можа складацца толькі з сімвалаў адпаведных рэгулярнаму выразу, "legal" - псеўданім можа складацца з любых дапушчальных ў URL сімвалаў, "alpha" - псеўданім можа складацца толькі з літар, і "alphanumeric" - псеўданім можа складацца толькі з літар і лічбаў.';

$_lang['setting_friendly_alias_restrict_chars_pattern'] = 'Шаблон для фільтрацыі знакаў у псеўданімах';
$_lang['setting_friendly_alias_restrict_chars_pattern_desc'] = 'Рэгулярны выраз для абмежавання сімвалаў, якія выкарыстоўваюцца ў псеўданімах рэсурсаў.';

$_lang['setting_friendly_alias_strip_element_tags'] = 'Выразаць тэгі элементаў з псеўданіма';
$_lang['setting_friendly_alias_strip_element_tags_desc'] = 'Вызначае, ці варта выразаць тэгі элементаў з псеўданімаў рэсурсаў.';

$_lang['setting_friendly_alias_translit'] = 'Транслітарацыя псеўданімаў';
$_lang['setting_friendly_alias_translit_desc'] = 'Метад транслітарацыі, які выкарыстоўваецца для псеўданімаў рэсурсаў. Пуста ці "none" - не выкарыстоўваць транслітарацыю. Іншыя магчымыя значэнні: "iconv" (калі даступна Php пашырэнне "iconv") або назва табліцы транслітарацыі, якая выкарыстоўваецца карыстацкім класам транслітарацыі. Для ўключэння транслітарацыі з рускай мовы трэба ўсталяваць пашырэнне ядра "translit", і ў настойцы «Транслітарацыя псеўданімаў» напісаць "russian".';

$_lang['setting_friendly_alias_translit_class'] = 'Клас, які кіруе транслітарацыяй псеўданімаў';
$_lang['setting_friendly_alias_translit_class_desc'] = 'Клас, які вырабляе транслітарацыю падчас генерацыі і фільтрацыі псеўданімаў рэсурсаў.';

$_lang['setting_friendly_alias_translit_class_path'] = 'Шлях да класа, які ажыццяўляе транслітарацыю псеўданімаў';
$_lang['setting_friendly_alias_translit_class_path_desc'] = 'Месцазнаходжанне пакета мадэлі, якая адказвае за транслітарацыю псеўданімаў.';

$_lang['setting_friendly_alias_trim_chars'] = 'Сімвалы, выразаныя з псеўданіма';
$_lang['setting_friendly_alias_trim_chars_desc'] = 'Сімвалы, якія трэба выразаць з заканчэння псеўданіма.';

$_lang['setting_friendly_alias_word_delimiter'] = 'Раздзяляльнік слоў у псеўданімах';
$_lang['setting_friendly_alias_word_delimiter_desc'] = 'Сімвал, які будзе замяняць прабелы паміж словамі.';

$_lang['setting_friendly_alias_word_delimiters'] = 'Раздзяляльнікі слоў у псеўданімах';
$_lang['setting_friendly_alias_word_delimiters_desc'] = 'Сімвалы, якія ўяўляюць сабой раздзяляльнікі слоў пры апрацоўцы псеўданімаў. Гэтыя сімвалы будуць ператвораныя ў упадабаны знак-раздзяляльнік, выбраны ў наладзе "friendly_alias_word_delimiter".';

$_lang['setting_friendly_urls'] = 'Выкарыстоўваць дружалюбныя URL';
$_lang['setting_friendly_urls_desc'] = 'Гэта дазваляе выкарыстоўваць дружалюбныя URL-адрасы ў MODX. Звярніце ўвагу, што гэта магчыма толькі для сайтаў, якія выкарыстоўваюць Apache, і вам патрэбна дадаць файл .htaccess, каб гэтая налада працавала. Глядзіце файл .htaccess, які пастаўляецца разам з архівам MODX для дадатковай інфармацыі.';
$_lang['setting_friendly_urls_err'] = 'Калі ласка, пазначце, хочаце вы выкарыстоўваць ці не дружалюбныя URL.';

$_lang['setting_friendly_urls_strict'] = 'Строгі рэжым дружалюбных URL';
$_lang['setting_friendly_urls_strict_desc'] = 'Калі выбрана «Так», некананічныя запыты, адпаведныя рэсурсу, будуць перанакіраваныя з кодам 301 на кананічны URI для гэтага рэсурсу. ПАПЯРЭДЖАНЬНЕ. Не ўключайце, калі вы выкарыстоўваеце карыстацкія правілы перазапісу, якія не супадаюць, па меншай меры, з пачаткам кананічнага URI. Напрыклад, кананічны URI "foo/" з карыстацкімі перазапісу для "foo/bar.html" будзе працаваць, але спробы перапісаць "bar/foo.html" як "foo/" прывядуць да Перанакіраванне да "foo/", калі гэтая опцыя ўключана.';

$_lang['setting_global_duplicate_uri_check'] = 'Правяраць на дубляванне URI ва ўсіх кантэкстах';
$_lang['setting_global_duplicate_uri_check_desc'] = 'Выберыце «Так», для таго каб правяраць на дубляванне URI ва ўсіх кантэкстах. Калі выбрана «Не», будзе правярацца толькі кантэкст, у якім рэсурс захоўваецца.';

$_lang['setting_hidemenu_default'] = 'Схаваць у меню па змаўчанні';
$_lang['setting_hidemenu_default_desc'] = 'Выберыце «Так», для таго каб параметр «паказваць з меню» быў абраны па змаўчанні, пры стварэнні новых рэсурсаў.';

$_lang['setting_inline_help'] = 'Паказваць тэкст падказкі побач з полем';
$_lang['setting_inline_help_desc'] = 'Калі выбрана «Так», побач з полем будзе выводзіцца тэкст падказкі. Калі выбрана «Не», падказка будзе «ўсплывальнай».';

$_lang['setting_link_tag_scheme'] = 'Схема генерацыі URL';
$_lang['setting_link_tag_scheme_desc'] = 'Схема генерацыі URL для тэга [[~id]]. Даступныя опцыі глядзіце <a href="http://api.modx.com/revolution/2.2/db_core_model_modx_modx.class.html#\\modX::makeUrl()">тут</a>.';

$_lang['setting_locale'] = 'Лакаль';
$_lang['setting_locale_desc'] = 'Ўсталёўвае лакаль для сістэмы. Пакіньце пустым каб выкарыстоўваць лакаль па змаўчанні. <a href="http://php.net/setlocale" target="_blank">Дакументацыя па наладзе лакаляў у PHP</a>.';

$_lang['setting_lock_ttl'] = 'Працягласць блакавання';
$_lang['setting_lock_ttl_desc'] = 'Колькасць секунд, на якое будзе заставацца блакаванне рэсурсу, калі карыстальнік неактыўны.';

$_lang['setting_log_level'] = 'Узровень лагавання';
$_lang['setting_log_level_desc'] = 'Узровень лагавання па змаўчанні; чым ніжэй узровень, тым менш паведамленняў, якія рэгіструюцца. Даступныя опцыі: 0 (фатальны), 1 (памылка), 2 (папярэджанне), 3 (інфармацыя) і 4 (адладка).';

$_lang['setting_log_target'] = 'Метад вываду часопіса памылак';
$_lang['setting_log_target_desc'] = 'Метад высновы паведамленняў часопіса. Магчымыя значэння: "FILE", "HTML", ці "ECHO". Па змаўчанні выкарыстоўваецца "FILE".';

$_lang['setting_mail_charset'] = 'Кадыроўка';
$_lang['setting_mail_charset_desc'] = 'Кадыроўка (па змаўчанні) для электронных пісем, такая як "iso-8859-1" ці "utf-8"';

$_lang['setting_mail_encoding'] = 'Фармат кадзіравання';
$_lang['setting_mail_encoding_desc'] = 'Усталюйце фармат кадзіравання для электронных пісем. Гэта можа быць "8bit", "7bit", "binary", "base64" і "quoted-printable".';

$_lang['setting_mail_use_smtp'] = 'Выкарыстоўваць SMTP';
$_lang['setting_mail_use_smtp_desc'] = 'Выберыце «Так», для выкарыстання SMTP пры адпраўкі электроннай пошты.';

$_lang['setting_mail_smtp_auth'] = 'SMTP аўтэнтыфікацыя';
$_lang['setting_mail_smtp_auth_desc'] = 'Выберыце «Так» для SMTP аўтэнтыфікацыі. Будуць выкарыстоўвацца налады "mail_smtp_user" і "mail_smtp_pass".';

$_lang['setting_mail_smtp_helo'] = 'SMTP Helo паведамленне';
$_lang['setting_mail_smtp_helo_desc'] = 'Вызначае паведамленне SMTP HELO (па змаўчанні імя хаста).';

$_lang['setting_mail_smtp_hosts'] = 'SMTP хасты';
$_lang['setting_mail_smtp_hosts_desc'] = 'Ўсталёўвае SMTP хасты. Усе хасты павінны быць аддзеленыя адзін ад аднаго кропкай з коскай. Акрамя таго, можна паказаць іншы порт для кожнага хаста, выкарыстоўваючы наступны фармат: [імя_хаста:порт] (напрыклад, "smtp1.example.com:25;smtp2.example.com"). Хасты будуць апрацаваны адпаведна парадку.';

$_lang['setting_mail_smtp_keepalive'] = 'SMTP ўтрыманне злучэння';
$_lang['setting_mail_smtp_keepalive_desc'] = 'Папярэджваць закрыццё SMTP злучэння пасля кожнай адпраўкі паведамлення. Не рэкамендуецца.';

$_lang['setting_mail_smtp_pass'] = 'SMTP Пароль';
$_lang['setting_mail_smtp_pass_desc'] = 'Пароль для аўтэнтыфікацыі па SMTP.';

$_lang['setting_mail_smtp_port'] = 'SMTP Порт';
$_lang['setting_mail_smtp_port_desc'] = 'Порт SMTP сервера па змаўчанні.';

$_lang['setting_mail_smtp_prefix'] = 'SMTP прэфікс для злучэнняў';
$_lang['setting_mail_smtp_prefix_desc'] = 'Прэфікс злучэнняў. Даступныя варыянты: "", "ssl", "tls"';

$_lang['setting_mail_smtp_single_to'] = 'SMTP пасылаць па адным';
$_lang['setting_mail_smtp_single_to_desc'] = 'Прадастаўляе магчымасць адпраўляць паведамленні адрасатам з поля "to" па адным, замест разавай адпраўкі на ўсе адрасы.';

$_lang['setting_mail_smtp_timeout'] = 'SMTP час чакання';
$_lang['setting_mail_smtp_timeout_desc'] = 'Вызначае час чакання (timeout) SMTP сервера. Не працуе на win32 серверах.';

$_lang['setting_mail_smtp_user'] = 'SMTP Карыстальнік';
$_lang['setting_mail_smtp_user_desc'] = 'Карыстальнік, які выкарыстоўваецца пры SMTP аўтарызацыі.';

$_lang['setting_main_nav_parent'] = 'Асноўнае меню';
$_lang['setting_main_nav_parent_desc'] = 'Кантэйнер, які змяшчае ўсе запісы асноўнага меню.';

$_lang['setting_manager_direction'] = 'Напрамак тэксту ў панэлі кіравання';
$_lang['setting_manager_direction_desc'] = 'Выберыце напрамак у якім будзе генеравацца тэкст у панэлі кіравання (злева-направа ці справа-налева).';

$_lang['setting_manager_date_format'] = 'Фармат даты ў панэлі кіравання';
$_lang['setting_manager_date_format_desc'] = 'Радок у фармаце PHP date (), які вызначае фармат даты ў панэлі кіравання.';

$_lang['setting_manager_favicon_url'] = 'URL фавіконкі панэлі кіравання';
$_lang['setting_manager_favicon_url_desc'] = 'Калі паказана, усталяванае значэнне будзе выкарыстоўвацца ў якасці URL фавіконкі панэлі кіравання MODX. Неабходна ўказаць альбо URL адносна дырэкторыі /manager/, альбо абсалютны URL.';

$_lang['setting_manager_js_cache_file_locking'] = 'Ўключыць блакаванне файлаў JS / CSS кэша';
$_lang['setting_manager_js_cache_file_locking_desc'] = 'Блакаванне файлаў кэша. Выберыце «Не» калі выкарыстоўваецца файлавая сістэма NFS.';
$_lang['setting_manager_js_cache_max_age'] = 'Час жыцця кэша JS / CSS файлаў панэлі кіравання';
$_lang['setting_manager_js_cache_max_age_desc'] = 'Максімальны час жыцця (у секундах) кэша браўзэра для сціснутых JS / CSS файлаў панэлі кіравання. Выкарыстоўвайце большае значэнне для змяншэння расходу трафіку.';
$_lang['setting_manager_js_document_root'] = 'Каранёвая дырэкторыя для сціску JS/CSS';
$_lang['setting_manager_js_document_root_desc'] = 'Калі ваш сервер не вызначае зменную "DOCUMENT_ROOT", пакажыце яе відавочна тут для ўключэння сціску CSS / JS файлаў панэлі кіравання. Не змяняйце калі вы не разумееце, што азначае гэтая налада.';
$_lang['setting_manager_js_zlib_output_compression'] = 'Ўключыць zlib сціск для JS / CSS файлаў панэлі кіравання';
$_lang['setting_manager_js_zlib_output_compression_desc'] = 'Выкарыстоўваць ці не zlib сціск для JS / CSS файлаў панэлі кіравання. Не ўключайце, калі не ўпэўнены што PHP-опцыя "zlib.output_compression" ўстаноўлена ў 1. MODX рэкамендуе выключыць гэтую наладу («Не»).';

$_lang['setting_manager_lang_attribute'] = 'Моўныя атрыбуты HTML і XML панэлі кіравання';
$_lang['setting_manager_lang_attribute_desc'] = 'Увядзіце моўны код, які найбольш падыходзіць для абранага мовы панэлі кіравання. Гэта дазволіць браўзэрам адлюстроўваць змест у найлепшым для вас фармаце.';

$_lang['setting_manager_language'] = 'Мова сістэмы кіравання';
$_lang['setting_manager_language_desc'] = 'Выберыце мову, якая будзе выкарыстоўвацца ў сістэме кіравання.';

$_lang['setting_manager_login_url_alternate'] = 'URL альтэрнатыўнай старонкі для ўваходу ў сістэму кіравання';
$_lang['setting_manager_login_url_alternate_desc'] = 'Альтэрнатыўны URL, на які будзе накіраваны несанкцыянаванага карыстальніка пры неабходнасці аўтарызацыі ў панэлі кіравання. Форма ўваходу павінна аўтарызавацца карыстальніка ў кантэксце "mgr".';

$_lang['setting_manager_login_start'] = 'Старонка ўвахода ў панэль кіравання';
$_lang['setting_manager_login_start_desc'] = 'Калі ласка, увядзіце ідэнтыфікатар дакумента, на які вы хочаце адправіць карыстальніка пасля таго, як ён/яна зойдзе ў сістэму.<strong>УВАГА: Пераканайцеся, што ідэнтыфікатар належыць да існуючага дакумента і што ён быў апублікаваны і даступны для гэтага карыстальніка!</strong>';

$_lang['setting_manager_theme'] = 'Шаблон сістэмы кіравання';
$_lang['setting_manager_theme_desc'] = 'Выберыце шаблон, які будзе выкарыстоўвацца ў сістэме кіравання.';

$_lang['setting_manager_time_format'] = 'Фармат часу ў сістэме кіравання';
$_lang['setting_manager_time_format_desc'] = 'Радок у фармаце функцыі PHP - date(), які вызначае фармат адлюстравання часу ў сістэме кіравання.';

$_lang['setting_manager_use_tabs'] = 'Выкарыстоўваць ўкладкі для вываду панэляў';
$_lang['setting_manager_use_tabs_desc'] = 'Калі выбрана «Так», то для вываду панэляў будуць выкарыстоўвацца ўкладкі. Інакш будуць выкарыстоўвацца асобныя панэлі.';

$_lang['setting_manager_week_start'] = 'Першы дзень тыдня';
$_lang['setting_manager_week_start_desc'] = 'Пазначце дзень, з якога пачынаецца тыдзень. Выкарыстоўвайце 0 (ці пакіньце поле пустым) для нядзелі, 1 для панядзелка і г. д.';

$_lang['setting_mgr_tree_icon_context'] = 'Іконка кантэксту';
$_lang['setting_mgr_tree_icon_context_desc'] = 'CSS-клас, які выкарыстоўваецца для адлюстравання іконкі кантэксту ў дрэве. Вы можаце выкарыстоўваць гэты параметр для ўстаноўкі унікальнай іконкі кожнаму кантэксту.';

$_lang['setting_mgr_source_icon'] = 'Іконка крыніцы файлаў';
$_lang['setting_mgr_source_icon_desc'] = 'CSS-клас іконкі, які паказвае медыя-файлы ў дрэве. Па змаўчанні выкарыстоўваецца клас <b> icon-folder-open-o </b>, які паказвае адкрытую папку';

$_lang['setting_modRequest.class'] = 'Клас-апрацоўшчык запытаў';
$_lang['setting_modRequest.class_desc'] = '';

$_lang['setting_modx_browser_tree_hide_files'] = 'Схаваць файлы ў дыспетчару файлаў';
$_lang['setting_modx_browser_tree_hide_files_desc'] = 'Калі ўсталяваны гэты параметр, файлы, якія размяшчаюцца ў папцы не будуць адлюстроўвацца ў дрэве дыспетчара файлаў. Па змаўчанні выключана.';

$_lang['setting_modx_browser_tree_hide_tooltips'] = 'Адключыць хуткі прадпрагляд малюнкаў';
$_lang['setting_modx_browser_tree_hide_tooltips_desc'] = 'Калі выбрана «Так», пры навядзенні курсора на файл малюнка ўсплывальнае акно прадпрагляду адлюстроўвацца не будзе.';

$_lang['setting_modx_browser_default_sort'] = 'Сартаванне па змаўчанні ў дыспетчару файлаў';
$_lang['setting_modx_browser_default_sort_desc'] = 'Метад сартавання па змаўчанні для дыспетчара файлаў. Магчымыя значэння: "name" (імя), "size" (памер), "lastmod" (зменены).';

$_lang['setting_modx_browser_default_viewmode'] = 'Рэжым прагляду па змаўчанні ў файлавым мэнэджару';
$_lang['setting_modx_browser_default_viewmode_desc'] = 'Рэжым прагляду па змаўчанні пры выкарыстанні кантэкстнага меню файлавага мэнэджара ў адмінцы. Даступныя значэння: табліца, спіс.';

$_lang['setting_modx_charset'] = 'Кадыроўка сімвалаў';
$_lang['setting_modx_charset_desc'] = 'Калі ласка, пазначце якую кадыроўку вы хочаце выкарыстоўваць для панэлі кіравання. Звярніце ўвагу, што MODX быў пратэставаны з некаторымі кадыроўкамі, але не з усімі. Для большасці моў пераважнай з\'яўляецца кадыроўка UTF-8.';

$_lang['setting_new_file_permissions'] = 'Правы на новыя файлы';
$_lang['setting_new_file_permissions_desc'] = 'Падчас запампоўкі новага файла праз файлавы агляднік будзе праведзена спроба ўсталяваць правы доступу да гэтага файла ў адпаведнасці з гэтай наладай. Можа не працаваць на некаторых серверах, напрыклад IIS. У гэтым выпадку вам варта самастойна ўсталяваць правы.';

$_lang['setting_new_folder_permissions'] = 'Правы на новыя каталогі';
$_lang['setting_new_folder_permissions_desc'] = 'Падчас стварэння новага каталога праз файлавы агляднік будзе праведзена спроба ўсталяваць правы доступу да гэтага каталога ў адпаведнасці з гэтай наладай. Можа не працаваць на некаторых серверах, напрыклад IIS. У гэтым выпадку вам варта самастойна ўсталяваць правы.';

$_lang['setting_parser_recurse_uncacheable'] = 'Адкладзены некэшыруемы парсінг';
$_lang['setting_parser_recurse_uncacheable_desc'] = 'Калі адключана, некэшыруемыя элементы могуць паказваць кэшаваная змесціва ўнутры кэшируемых элементаў. Адключайце ТОЛЬКІ калі ў вас ёсць праблемы са складаным укладзеным парсінгам, які перастаў працаваць як чакалася.';

$_lang['setting_password_generated_length'] = 'Даўжыня аўтаматычна згенераванага пароля';
$_lang['setting_password_generated_length_desc'] = 'Даўжыня пароля, аўтаматычна згенераванага для карыстальніка.';

$_lang['setting_password_min_length'] = 'Мінімальная даўжыня пароля';
$_lang['setting_password_min_length_desc'] = 'Мінімальная даўжыня пароля для карыстальніка.';

$_lang['setting_preserve_menuindex'] = 'Захоўваць індэкс меню падчас дублявання рэсурсаў';
$_lang['setting_preserve_menuindex_desc'] = 'Падчас дублявання рэсурсаў парадак адпаведны да індэкса меню таксама будзе захаваны.';

$_lang['setting_principal_targets'] = 'Мэтавыя класы для загрузкі спісаў кантролю доступу';
$_lang['setting_principal_targets_desc'] = 'Наладзьце мэтавыя класы, для якіх неабходна загрузіць спісы кантролю доступу карыстальнікаў.';

$_lang['setting_proxy_auth_type'] = 'Проксі тып аўтарызацыі';
$_lang['setting_proxy_auth_type_desc'] = 'Можна паказаць "BASIC" альбо "NTLM".';

$_lang['setting_proxy_host'] = 'Проксі-хост';
$_lang['setting_proxy_host_desc'] = 'Калі ваш сервер выкарыстоўвае проксі, пакажыце імя проксі-хаста для таго, каб зрабіць даступнымі некаторыя функцыі MODX, такія як кіраванне пакетамі.';

$_lang['setting_proxy_password'] = 'Проксі-пароль';
$_lang['setting_proxy_password_desc'] = 'Пароль для аўтарызацыі на проксі-сэрвэры.';

$_lang['setting_proxy_port'] = 'Проксі-порт';
$_lang['setting_proxy_port_desc'] = 'Порт проксі-сервера.';

$_lang['setting_proxy_username'] = 'Карыстальнік проксі-сервера';
$_lang['setting_proxy_username_desc'] = 'Імя карыстальніка для аўтарызацыі на проксі-сэрвэры.';

$_lang['setting_photo_profile_source'] = 'Крыніца файлаў для аватарак';
$_lang['setting_photo_profile_source_desc'] = 'Крыніца файлаў для захоўвання карыстацкіх аватарок. Па змаўчанні выкарыстоўваецца стандартная крыніца.';

$_lang['setting_phpthumb_allow_src_above_docroot'] = 'phpThumb Дазволіць крыніцы вышэй за каранёвую дырэкторыю';
$_lang['setting_phpthumb_allow_src_above_docroot_desc'] = 'Дазваляе або забараняе выкарыстанне файлаў, размешчаных па-за каранёвай дырэкторыі, у якасці крыніц. Можа быць выкарыстана для сістэм з мноствам кантэкстаў, размешчаных на розных віртуальных хастах.';

$_lang['setting_phpthumb_cache_maxage'] = 'phpThumb Максімальны час жыцця кэша';
$_lang['setting_phpthumb_cache_maxage_desc'] = 'Выдаляць кэш выяў, якія не запытваліся больш паказанай колькасці дзён.';

$_lang['setting_phpthumb_cache_maxsize'] = 'phpThumb Максімальны памер кэша';
$_lang['setting_phpthumb_cache_maxsize_desc'] = 'Калі памер кэша перавысіць названае значэнне (у мегабайтах), то будзе выдалены кэш малюнкаў, якія запытваліся найбольш даўно.';

$_lang['setting_phpthumb_cache_maxfiles'] = 'phpThumb Максімальная колькасць кэшаваных файлаў';
$_lang['setting_phpthumb_cache_maxfiles_desc'] = 'Калі кэш перавысіць паказаны лік файлаў, то будзе выдалены кэш выяў, якія запытваліся найбольш даўно.';

$_lang['setting_phpthumb_cache_source_enabled'] = 'phpThumb Кэшаваць файлы-крыніцы';
$_lang['setting_phpthumb_cache_source_enabled_desc'] = 'Кэшаваць або не файлы-крыніц пры загрузцы. Рэкамендуем выключыць.';

$_lang['setting_phpthumb_document_root'] = 'PHPThumb Каранёвая дырэкторыя';
$_lang['setting_phpthumb_document_root_desc'] = 'Усталюйце гэтую наладу, калі маюцца праблемы, звязаныя з зменнай "DOCUMENT_ROOT" ці ўзнікаюць памылкі з "OutputThumbnail" ці "!Is_resource". Усталюйце неабходны абсалютны шлях да каранёвай дырэкторыі сервера. Пры пустым значэнні MODX будзе выкарыстоўваць зменную "DOCUMENT_ROOT" сервера.';

$_lang['setting_phpthumb_error_bgcolor'] = 'phpThumb Колер фону паведамленні пра памылку';
$_lang['setting_phpthumb_error_bgcolor_desc'] = 'Шаснаццатковы лік, без сімвала #, вызначае фон паведамленні пра памылку.';

$_lang['setting_phpthumb_error_fontsize'] = 'phpThumb Памер шрыфта паведамленні пра памылку';
$_lang['setting_phpthumb_error_fontsize_desc'] = 'Памер шрыфта, зададзены ў em.';

$_lang['setting_phpthumb_error_textcolor'] = 'phpThumb Колер тэксту памылкі';
$_lang['setting_phpthumb_error_textcolor_desc'] = 'Шаснаццатковы лік, без сімвала #, вызначае колер паведамлення пра памылку.';

$_lang['setting_phpthumb_far'] = 'phpThumb Прымусовае суадносіны бакоў';
$_lang['setting_phpthumb_far_desc'] = 'Значэнне па змаўчанні для параметру far калі ён выкарыстоўваецца ў MODX. Па змаўчанні значэнне C, якое прымушае захаваць прапорцыі адносна цэнтра.';

$_lang['setting_phpthumb_imagemagick_path'] = 'phpThumb Шлях да ImageMagick';
$_lang['setting_phpthumb_imagemagick_path_desc'] = 'Не абавязкова. Усталёўвае альтэрнатыўны шлях да ImageMagick для генерацыі выяў з дапамогай phpThumb, калі не зададзена па змаўчанні ў PHP.';

$_lang['setting_phpthumb_nohotlink_enabled'] = 'phpThumb Адключыць хотлінкінг';
$_lang['setting_phpthumb_nohotlink_enabled_desc'] = 'Выдаленыя серверы дазволеныя ў параметры src пакуль адключаны hotlinking в phpThumb.';

$_lang['setting_phpthumb_nohotlink_erase_image'] = 'phpThumb Выдаляць малюнак пры ўключаным Hotlinking';
$_lang['setting_phpthumb_nohotlink_erase_image_desc'] = 'Паведамляе, калі нельга выдаліць выяву, згенераванаю на выдаленым серверы.';

$_lang['setting_phpthumb_nohotlink_text_message'] = 'phpThumb Паведамленне аб забароне Hotlinking';
$_lang['setting_phpthumb_nohotlink_text_message_desc'] = 'Паведамленне, якое адлюстроўваецца замест выяў, калі hotlinking забаронены.';

$_lang['setting_phpthumb_nohotlink_valid_domains'] = 'phpThumb Дапушчальныя дамены для Hotlinking';
$_lang['setting_phpthumb_nohotlink_valid_domains_desc'] = 'Падзелены коскамі спіс імёнаў хастоў, якія можна выкарыстоўваць ў спасылках у src.';

$_lang['setting_phpthumb_nooffsitelink_enabled'] = 'phpThumb Забараняць знешнія спасылкі';
$_lang['setting_phpthumb_nooffsitelink_enabled_desc'] = 'Забараняе іншым выкарыстоўваць phpThumb для генерацыі выяў на іх уласных сайтах.';

$_lang['setting_phpthumb_nooffsitelink_erase_image'] = 'phpThumb Выдаляць выявы па знешніх спасылках';
$_lang['setting_phpthumb_nooffsitelink_erase_image_desc'] = 'Паведамляе, калі нельга выдаліць выяву, звязаны з выдаленым серверам.';

$_lang['setting_phpthumb_nooffsitelink_require_refer'] = 'phpThumb Патрабаваць ўказанне referrer для знешніх падключэнняў';
$_lang['setting_phpthumb_nooffsitelink_require_refer_desc'] = 'Калі выбрана «Так», любыя знешнія запыты без дазволенага загалоўка referrer будуць адхіленыя.';

$_lang['setting_phpthumb_nooffsitelink_text_message'] = 'phpThumb Паведамленне аб недаступнасці знешніх спасылак';
$_lang['setting_phpthumb_nooffsitelink_text_message_desc'] = 'Паведамленне, якое адлюстроўваецца замест выяў, калі знешняе падлучэнне адхілена.';

$_lang['setting_phpthumb_nooffsitelink_valid_domains'] = 'phpThumb Дапушчальныя дамены для знешніх спасылак';
$_lang['setting_phpthumb_nooffsitelink_valid_domains_desc'] = 'Падзелены коскамі спіс імёнаў хастоў, якім дазволена знешняе падлучэнне.';

$_lang['setting_phpthumb_nooffsitelink_watermark_src'] = 'phpThumb Адрас вадзянога знака для знешніх запытаў';
$_lang['setting_phpthumb_nooffsitelink_watermark_src_desc'] = 'Не абавязкова. Дапушчальны шлях да файла, які будзе выкарыстоўвацца ў якасці вадзянога знака, калі вашыя выявы адлюстроўваюцца па-за сайтам для phpThumb.';

$_lang['setting_phpthumb_zoomcrop'] = 'phpThumb Кадраванне';
$_lang['setting_phpthumb_zoomcrop_desc'] = 'Значэнне zc па змаўчанні для выкарыстання ў MODX. Па змаўчанні 0, што прадухіляе абразанне з павелічэннем (zoom cropping).';

$_lang['setting_publish_default'] = 'Апублікавана па змаўчанні';
$_lang['setting_publish_default_desc'] = 'Выберыце «Так», калі жадаеце, каб усе новыя рэсурсы адразу станавіліся апублікаванымі.';
$_lang['setting_publish_default_err'] = 'Калі ласка, пазначце ці вы хочаце каб новыя рэсурсы па змаўчанні публікаваліся.';

$_lang['setting_rb_base_dir'] = 'Шлях да рэсурсаў';
$_lang['setting_rb_base_dir_desc'] = 'Увядзіце фізічны шлях да каталога рэсурсаў. Калі вы выкарыстоўваеце IIS, MODX можа некарэктна апрацаваць шлях, прымушаючы дыспетчар файлаў выдаваць памылкі. У гэтым выпадку, шлях да каталога з рэсурсамі трэба ўвесці тут (так, якім вы яго бачыце ў Windows Explorer). <strong> ВАЖНА: </strong> У каталогу павінны ўтрымлівацца падкаталогі "images", "files", "flash" і "media" для карэктнага функцыянавання дыспетчара файлаў.';
$_lang['setting_rb_base_dir_err'] = 'Каранёвай каталог дыспетчара файлаў (састарэў).';
$_lang['setting_rb_base_dir_err_invalid'] = 'Каранёвай каталог дыспетчара файлаў не існуе або да яго няма доступу. Увядзіце правільны каталог або наладзьце правы доступу.';

$_lang['setting_rb_base_url'] = 'URL рэсурсаў (састарэла)';
$_lang['setting_rb_base_url_desc'] = 'Калі ласка, увядзіце адносны шлях да каталога рэсурсаў. Звычайна, гэтая налада усталёўваецца аўтаматычна. Аднак, калі вы карыстаецеся IIS, MODX можа быць не здольны гэтага зрабіць, што прывядзе да памылкі ў працы дыспетчара файлаў. У гэтым выпадку, вы можаце ўвесці URL тут (URL, як ён бы адлюстроўваўся ў Internet Explorer).';
$_lang['setting_rb_base_url_err'] = 'Калі ласка, пазначце базавы URL дыспетчара файлаў.';

$_lang['setting_request_controller'] = 'Назвы файлаў кантролера запыту';
$_lang['setting_request_controller_desc'] = 'Назвы файлаў асноўнага кантролера запыту, з якога MODX загружаецца. Большасць карыстальнікаў можа пакінуць значэнне "index.php".';

$_lang['setting_request_method_strict'] = 'Строгі метад запыту';
$_lang['setting_request_method_strict_desc'] = 'Калі выбрана «Так», запыты праз параметр ID будуць ігнаравацца пры ўключаных дружалюбных URL. Калі дружалюбныя URL адключаныя, то запыты з выкарыстаннем псеўданіма будуць ігнаравацца.';

$_lang['setting_request_param_alias'] = 'Назва параметра запыту для псеўданіма';
$_lang['setting_request_param_alias_desc'] = 'Назва GET-параметру, які перадае псеўданім рэсурсу, пры выкарыстанні дружалюбных URL.';

$_lang['setting_request_param_id'] = 'Назва параметра запыту для ID';
$_lang['setting_request_param_id_desc'] = 'Назва GET параметру, які перадаецца ID рэсурсу, калі дружалюбныя URL адключаныя.';

$_lang['setting_resolve_hostnames'] = 'Вызначаць імёны хастоў';
$_lang['setting_resolve_hostnames_desc'] = 'Хочаце, каб MODX спрабаваў вызначыць імёны хастоў вашых карыстальнікаў падчас кожнага наведвання? Вызначэнне імёнаў хастоў можа выклікаць некаторую дадатковую нагрузку на сервер, хоць вашыя карыстальнікі, у любым выпадку, гэтага не заўважаць.';

$_lang['setting_resource_tree_node_name'] = 'Поле для назвы вузла ў дрэве рэсурсаў';
$_lang['setting_resource_tree_node_name_desc'] = 'Пакажыце поле рэсурсу, якое будзе выкарыстоўвацца ў якасці назвы вузла ў дрэве рэсурсаў. Па змаўчанні поле "pagetitle", любое поле рэсурсу можа быць выкарыстана: "menutitle", "alias", "longtitle" і г. д.';

$_lang['setting_resource_tree_node_name_fallback'] = 'Запасное поле для вузла ў дрэве рэсурсаў';
$_lang['setting_resource_tree_node_name_fallback_desc'] = 'Пазначце поле рэсурсу для выкарыстання ў якасці запаснога назвы вузла ў дрэве рэсурсаў. Гэта значэнне будзе выкарыстоўвацца, калі рэсурс мае пустое значэнне для зададзенага поля рэсурсу ў дрэве.';

$_lang['setting_resource_tree_node_tooltip'] = 'Поле для падказкі для вузла ў дрэве рэсурсаў';
$_lang['setting_resource_tree_node_tooltip_desc'] = 'Пазначце поле рэсурсу для выкарыстання ў якасці ўсплывальнай падказкі ў дрэве рэсурсаў. Любое поле рэсурсу можа быць выкарыстана: "menutitle", "alias", "longtitle" і г. д. Калі не пазначана, будзе выкарыстана "longtitle" з "description" пад ім.';

$_lang['setting_richtext_default'] = 'Выкарыстоўваць візуальны рэдактар';
$_lang['setting_richtext_default_desc'] = 'Выберыце «Так», каб усе новыя рэсурсы выкарыстоўвалі візуальны тэкставы рэдактар па змаўчанні.';

$_lang['setting_search_default'] = '«Даступны для пошуку» па змаўчанні';
$_lang['setting_search_default_desc'] = 'Выберыце «Так» для таго, каб зрабіць усё новыя рэсурсы даступнымі для пошуку па змаўчанні.';
$_lang['setting_search_default_err'] = 'Калі ласка, пакажыце, ці вы хочаце каб рэсурсы былі даступныя для пошуку па змаўчанні.';

$_lang['setting_server_offset_time'] = 'Розніца ў часе';
$_lang['setting_server_offset_time_desc'] = 'Пакажыце розніцу ў гадзінах паміж вашым лакальным часам і часам сервера.';

$_lang['setting_server_protocol'] = 'Тып сервера';
$_lang['setting_server_protocol_desc'] = 'Калі ваш сайт выкарыстоўвае пратакол https, калі ласка, пазначце гэта тут.';
$_lang['setting_server_protocol_err'] = 'Калі ласка, пазначце ці ваш сайт бяспечны ці не.';
$_lang['setting_server_protocol_http'] = 'http';
$_lang['setting_server_protocol_https'] = 'https';

$_lang['setting_session_cookie_domain'] = 'Дамен для сесійных кукаў';
$_lang['setting_session_cookie_domain_desc'] = 'Выкарыстоўвайце гэтую наладу для ўказання даменнага імя для сесійных кукаў. Пры пустым значэнні, у якасці даменнага імя будзе выкарыстоўвацца гэты дамен.';

$_lang['setting_session_cookie_lifetime'] = 'Працягласць захоўвання кукаў сесій';
$_lang['setting_session_cookie_lifetime_desc'] = 'Выкарыстоўвайце гэтую наладу для выбару працягласці захоўвання сесійных кукаў у секундах. Гэтая настройка выкарыстоўваецца для вызначэння працягласці захоўвання кліенцкіх сесійных кукаў пры выбары опцыі «запомніць мяне» падчас аўтэнтыфікацыі.';

$_lang['setting_session_cookie_path'] = 'Шлях для сесійных кукаў';
$_lang['setting_session_cookie_path_desc'] = 'Выкарыстоўвайце гэтую наладу для задання шляху для сесійных кукаў. Пакіньце значэнне пустым для выкарыстання "MODX_BASE_URL" ў якасці шляху.';

$_lang['setting_session_cookie_secure'] = 'Шыфраванне сесійных кукаў';
$_lang['setting_session_cookie_secure_desc'] = 'Уключыце гэтую наладу для выкарыстання шыфравання сесійных кукаў.';

$_lang['setting_session_cookie_httponly'] = 'Сесійныя кукі ў рэжыме HttpOnly';
$_lang['setting_session_cookie_httponly_desc'] = 'Уключыце гэтую наладу для ўстаноўкі сцяга HttpOnly для сесійных кукаў.';

$_lang['setting_session_gc_maxlifetime'] = 'Максімальны час жыцця сесіі';
$_lang['setting_session_gc_maxlifetime_desc'] = 'Дазваляе наладзіць PHP-параметр "session.gc_maxlifetime" зборшчыка смецця пры выкарыстанні апрацоўшчыка "modSessionHandler".';

$_lang['setting_session_handler_class'] = 'Імя класа-апрацоўшчыка сесій';
$_lang['setting_session_handler_class_desc'] = 'Для кіравання сесіямі ў базе даных, выкарыстоўвайце "modSessionHandler". Пакіньце гэта поле пустым для выкарыстання стандартнай апрацоўкай сесій у PHP.';

$_lang['setting_session_name'] = 'Назва сеансу';
$_lang['setting_session_name_desc'] = 'Выкарыстоўвайце гэтую наладу, каб пазначыць назву сеансу, якая выкарыстоўваецца для сеансаў у MODX. Пакіньце пустым, каб выкарыстоўваць назву сеансу па змаўчанні ў PHP.';

$_lang['setting_settings_version'] = 'Версія наладаў';
$_lang['setting_settings_version_desc'] = 'Версія MODX, якая зараз усталявана.';

$_lang['setting_settings_distro'] = 'Дыстрыбутыў';
$_lang['setting_settings_distro_desc'] = 'Версія устаноўленага дыстрыбутыва MODX.';

$_lang['setting_set_header'] = 'Пасылаць HTTP загалоўкі';
$_lang['setting_set_header_desc'] = 'Калі выбрана «Так», MODX будзе спрабаваць усталяваць HTTP-загалоўкі для рэсурсаў.';

$_lang['setting_send_poweredby_header'] = 'Дасылаць загаловак X-Powered-By';
$_lang['setting_send_poweredby_header_desc'] = 'Калі гэта опцыя ўключаная, MODX будзе дасылаць загаловак "X-Powered-By" каб пазначыць, што гэты сайт пабудаваны на MODX. Гэта дапамагае адсочваць глабальнае выкарыстоўванне MODX з дапамогай іншых трэкераў, якія іспектуюць ваш сайт. Але таксама гэта дазваляе лягчэй ідэнтыфікаваць на чым ваш сайт створаны і гэта можа крыху павялічыць рызыку для бяспекі калі будуць знойдзены ўразлівасці ў MODX.';

$_lang['setting_show_tv_categories_header'] = 'Паказваць загаловак «Катэгорыі» над укладкамі з катэгорыямі пры вывадзе TV';
$_lang['setting_show_tv_categories_header_desc'] = 'Калі паказана «Так», над укладкамі катэгорый дадатковых палёў будзе адлюстраваны загаловак «Катэгорыі».';

$_lang['setting_signupemail_message'] = 'Пісьмо рэгістрацыі';
$_lang['setting_signupemail_message_desc'] = 'Тут вы можаце ўсталяваць паведамленне, якое адпраўляецца вашым карыстальнікам пасля рэгістрацыі ўліковага запісу, з данымі аб іх назве ўліковага запісу і паролі. <br /> <strong> ВАЖНА: </strong> Наступныя плейсхолдеры замяняюцца MODX перад адпраўкай пісьма: <br /> <br /> [[+sname]] - назва вашага сайта, <br /> [[+saddr]] - адрас электроннай пошты вашага сайта, <br /> [[+surl]] - url вашага сайта, <br /> [[+uid]] - імя ўліковага запісу карыстальніка (лагін) або ID, <br /> [[+pwd ]] - пароль карыстальніка, <br /> [[+ufn]] - поўнае імя карыстальніка. <br /> <br /> <strong> Абавязкова ўкажыце тэгі [[+uid]] і [[+pwd]] ў лісце, інакш вашыя карыстальнікі не змогуць даведацца свае імя ўліковага запісу і пароль! </ strong>';
$_lang['setting_signupemail_message_default'] = 'Добры дзень, [[+uid]] \n\n Вашы даныя рэгістрацыі на сайце [[+sname]]: \n\n Імя карыстальніка: [[+uid]] \n Пароль: [[+pwd]] \n\n Як толькі вы аўтарызуецеся на сайце ([[+surl]]), вы зможаце памяняць свой пароль. \n\n З павагай, \n\n Адміністрацыя сайта';

$_lang['setting_site_name'] = 'Назва сайта';
$_lang['setting_site_name_desc'] = 'Калі ласка, увядзіце назву вашага сайта.';
$_lang['setting_site_name_err']  = 'Калі ласка, увядзіце назву сайта.';

$_lang['setting_site_start'] = 'Галоўная старонка сайта';
$_lang['setting_site_start_desc'] = 'Калі ласка, увядзіце ID рэсурсу, які вы хочаце выкарыстоўваць у якасці «Галоўнай старонкі сайта». <strong> ВАЖНА: пераканайцеся, што гэты ID належыць існуючаve рэсурсу і што гэты рэсурс апублікаваны! </strong>';
$_lang['setting_site_start_err'] = 'Калі ласка, пазначце ID рэсурсу, які будзе «Галоўнай старонкай сайта».';

$_lang['setting_site_status'] = 'Статус сайта';
$_lang['setting_site_status_desc'] = 'Выберыце «Так» для публікацыі вашага сайта ў сетцы. Калі вы выберыце «Не», вашы наведвальнікі ўбачаць «Паведамленне аб недаступнасці сайта», і не змогуць праглядаць змесціва сайта.';
$_lang['setting_site_status_err'] = 'Калі ласка, выберыце «Так», калі сайт працуе ці «Не», калі сайт не працуе.';

$_lang['setting_site_unavailable_message'] = 'Паведамленне аб недаступнасці сайта';
$_lang['setting_site_unavailable_message_desc'] = 'Паведамленне, якое будзе паказана ў выпадку, калі сайт недаступны або паўстала памылка. <strong> Важна: Гэта паведамленне выводзіцца толькі ў выпадку, калі не пазначана старонка «Сайт недаступны». </strong>';

$_lang['setting_site_unavailable_page'] = 'Старонка «Сайт недаступны»';
$_lang['setting_site_unavailable_page_desc'] = 'Калі ласка, увядзіце ID рэсурсу, які вы хочаце выкарыстоўваць у якасці старонкі «Сайт недаступны». <strong> ВАЖНА: пераканайцеся, што гэты ID належыць існуючаму рэсурсу і гэты рэсурс апублікаваны! </strong>';
$_lang['setting_site_unavailable_page_err'] = 'Калі ласка, пазначце ID рэсурсу для старонкі «Сайт недаступны».';

$_lang['setting_strip_image_paths'] = 'Перапісваць шляху для браўзэра?';
$_lang['setting_strip_image_paths_desc'] = 'Калі ўсталявана значэнне «Не», MODX будзе выкарыстоўваць абсалютныя спасылкі на выяваў, файлаў, flash і таму падобнага. Адносныя спасылкі зручней, калі вы ў будучыні збіраецеся перамясціць свой сайт, напрыклад, з тэставага сервера на канчатковы. Калі вы не разумееце пра што ідзе гаворка, пакіньце значэнне «Так».';

$_lang['setting_symlink_merge_fields'] = 'Аб\'ядноўваць палі рэсурсу з палямі сімвалічнай спасылкі';
$_lang['setting_symlink_merge_fields_desc'] = 'Калі ўсталявана значэнне «Так», то не пустыя палі сімвалічнай спасылкі заменяць палі
мэтавага рэсурсу пры пераадрасацыі з выкарыстаннем сімвалічнай спасылкі.';

$_lang['setting_syncsite_default'] = 'Чысціць кэш па змаўчанні';
$_lang['setting_syncsite_default_desc'] = 'Калі выбрана «Так», пры захаванні рэсурсу кэш будзе ачышчацца па змаўчанні.';
$_lang['setting_syncsite_default_err'] = 'Калі ласка, пакажыце, ці вы хочаце ці не, каб кэш ачышчаўся па змаўчанні пры захаванні рэсурсу.';

$_lang['setting_topmenu_show_descriptions'] = 'Паказваць апісання пунктаў у верхнім меню';
$_lang['setting_topmenu_show_descriptions_desc'] = 'Калі ўсталявана значэнне «Не», MODX будзе хаваць дадатковае апісанне для пунктаў верхняга меню.';

$_lang['setting_tree_default_sort'] = 'Поле сартавання дрэва рэсурсаў';
$_lang['setting_tree_default_sort_desc'] = 'Поле, па якім сартуецца дрэва рэсурсаў пры загрузцы.';

$_lang['setting_tree_root_id'] = 'ID кораня дрэва рэсурсаў';
$_lang['setting_tree_root_id_desc'] = 'Увядзіце ID рэсурсу, які будзе карэннем дрэва рэсурсаў. Карыстальнік будзе мець магчымасць бачыць толькі даччыныя рэсурсы гэтага рэсурсу.';

$_lang['setting_tvs_below_content'] = 'Размясціць TV ніжэй кантэнту';
$_lang['setting_tvs_below_content_desc'] = 'Калі выбрана «Так», дадатковыя палі будуць размешчаны ніжэй палі рэдагавання рэсурсу.';

$_lang['setting_ui_debug_mode'] = 'Рэжым адладкі для інтэрфейсу мэнэджэра';
$_lang['setting_ui_debug_mode_desc'] = 'Калі выбрана «Так», у кансоль браўзэра будуць выводзіцца адладкавыя паведамленні інтэрфейсу панэлі кіравання. Вы павінны выкарыстоўваць браўзэр, які падтрымлівае console.log.';

$_lang['setting_udperms_allowroot'] = 'Дазволіць доступ да каранёвай папцы';
$_lang['setting_udperms_allowroot_desc'] = 'Дазваляе або забараняе карыстальнікам ствараць рэсурсы ў каранёвай папцы сайта';

$_lang['setting_unauthorized_page'] = 'Старонка памылкі 403 «Доступ забаронены»';
$_lang['setting_unauthorized_page_desc'] = 'Калі ласка, увядзіце ID рэсурсу, які вы хочаце выводзіць карыстальнікам пры запыце забароненых або неабходных да аўтарызацыі рэсурсаў. <strong> ВАЖНА: пераканайцеся, што уведзены ID належыць існуючаму рэсурсу і гэты рэсурс апублікаваны і публічна даступны! </strong>';
$_lang['setting_unauthorized_page_err'] = 'Калі ласка пазначце ID рэсурсу, які будзе з\'яўляцца старонкай памылкі 403 «Доступ забаронены».';

$_lang['setting_upload_files'] = 'Дазволеныя да загрузцы файлы';
$_lang['setting_upload_files_desc'] = 'Тут вы можаце выбраць спіс тыпаў файлаў, якія можна загружаць у каталог "assets/files/", выкарыстоўваючы дыспетчар файлаў. Калі ласка, увядзіце пашырэння файлаў, падзяляючы іх коскамі.';

$_lang['setting_upload_flash'] = 'Дазволеныя да загрузцы flash-файлы';
$_lang['setting_upload_flash_desc'] = 'Тут вы можаце ўвесці спіс тыпаў файлаў, якія можна загружаць у каталог "assets/flash/", выкарыстоўваючы дыспетчар файлаў. Калі ласка, увядзіце пашырэння файлаў, падзяляючы іх коскамі.';

$_lang['setting_upload_images'] = 'Дазволеныя да загрузцы выявы';
$_lang['setting_upload_images_desc'] = 'Тут вы можаце ўвесці спіс тыпаў файлаў, якія можна загружаць у каталог "assets/images/", выкарыстоўваючы дыспетчар файлаў. Калі ласка, увядзіце пашырэння файлаў-выяў, падзяляючы іх коскамі.';

$_lang['setting_upload_maxsize'] = 'Максімальны памер загрузкі';
$_lang['setting_upload_maxsize_desc'] = 'Увядзіце максімальны памер файла, магчымы для загрузкі праз дыспетчар файлаў. Памер файла павінен быць уведзены ў байтах';

$_lang['setting_upload_media'] = 'Дазволеныя да загрузцы медыя-файлы';
$_lang['setting_upload_media_desc'] = 'Тут вы можаце ўвесці спіс тыпаў файлаў, якія можна загружаць у каталог "assets/media/", выкарыстоўваючы дыспетчар файлаў. Калі ласка, увядзіце пашырэння файлаў-выяў, падзяляючы іх коскамі.';

$_lang['setting_use_alias_path'] = 'Выкарыстоўваць укладзеныя URL';
$_lang['setting_use_alias_path_desc'] = 'Ўстаноўка значэння «Так» для гэтай опцыі утворыць выснову поўнага шляху да рэсурсу, калі ў рэсурсу ёсць псеўданім. Напрыклад, калі рэсурс з псеўданімам "child" размешчаны ўнутры рэсурсу-кантэйнера з псеўданімам "parent", то поўны шлях да рэсурсу будзе выведзены так: "/parent/child.html". <br /> <strong> ВАЖНА: Усталёўваючы значэнне «Так» для гэтай опцыі, выкарыстоўвайце поўны шлях для ўказання шляху да такіх файлаў, як малюнкі, css, javascript, і г.д.: напрыклад,"/assets/images ", а не "assets/images". Ці выкарыстоўвайце тэг &lt;base/&gt; для яўнага ўказання базавага URL. </strong>';

$_lang['setting_use_browser'] = 'Дазволіць дыспетчар файлаў';
$_lang['setting_use_browser_desc'] = 'Выберыце «Так» каб уключыць дыспетчар файлаў. Гэта дазволіць карыстальнікам праглядаць і загружаць медыя-файлы на сервер.';
$_lang['setting_use_browser_err'] = 'Калі ласка, пакажыце, вы хочаце ці не выкарыстоўваць дыспетчар файлаў.';

$_lang['setting_use_editor'] = 'Выкарыстоўваць тэкставы рэдактар';
$_lang['setting_use_editor_desc'] = 'Ці вы хочаце выкарыстоўваць тэкставы рэдактар? Калі вам зручней выкарыстоўваць HTML, можаце адключыць тэкставы рэдактар з дапамогай гэтай опцыі. Майце на ўвазе, што гэтая опцыя прымяняецца да ўсіх дакументаў і карыстальнікам!';
$_lang['setting_use_editor_err'] = 'Калі ласка, пакажыце, хочаце вы ці не выкарыстоўваць RTE рэдактар.';

$_lang['setting_use_frozen_parent_uris'] = 'Выкарыстоўваць «замарожаныя» URI бацькоў';
$_lang['setting_use_frozen_parent_uris_desc'] = 'Калі выбрана «Так», URI для даччыных рэсурсаў будзе генеравацца з улікам "замарожанага" URI бацькоў, ігнаруючы псеўданімы рэсурсаў вышэй па дрэве.';

$_lang['setting_use_multibyte'] = 'Выкарыстоўваць бібліятэку "mbstring"';
$_lang['setting_use_multibyte_desc'] = 'Уключыце, калі вы хочаце выкарыстоўваць бібліятэку "mbstring" для працы з многобайтавымі кадыроўкамі. Уключайце толькі, калі бібліятэка "mbstring" устаноўлена на вашым серверы.';

$_lang['setting_use_weblink_target'] = 'Выкарыстоўваць мэтавую вэб-спасылку';
$_lang['setting_use_weblink_target_desc'] = 'Калі выбрана «Так», MODX тэгі спасылак і makeUrl() API выклік будуць генераваць канчатковыя спасылкі, названыя як мэтавыя URL для рэсурсаў тыпу «спасылка». У адваротным выпадку, будзе згенеравана ўнутраная спасылка, перанакіроўваючая на мэтавы URL.';

$_lang['setting_user_nav_parent'] = 'Меню карыстальніка';
$_lang['setting_user_nav_parent_desc'] = 'Кантэйнер, які змяшчае ўсе запісы меню карыстальніка.';

$_lang['setting_webpwdreminder_message'] = 'Нагаданне пра пароль';
$_lang['setting_webpwdreminder_message_desc'] = 'Тут вы можаце ўсталяваць паведамленне, якое адпраўляецца вашым карыстальнікам калі яны запытваюць напамін пароля. <br /> <strong> ВАЖНА: </strong> Наступныя плейсхолдеры замяняюцца MODX перад адпраўкай пісьма: <br /> <br /> [[+sname]] - назва вашага сайта, <br /> [[+saddr]] - адрас электроннай пошты вашага сайта, <br /> [[+surl]] - url вашага сайта, <br /> [[+uid]] - імя ўліковага запісу карыстальніка (лагін) або ID, <br /> [[+pwd]] - пароль карыстальніка, <br /> [[+ufn]] - поўнае імя карыстальніка. <br /> <br /> <strong> Абавязкова ўкажыце тэгі [[+uid]] і [[+pwd]] ў лісце, інакш вашыя карыстальнікі не змогуць даведацца свае імя ўліковага запісу і пароль! </ strong>';
$_lang['setting_webpwdreminder_message_default'] = 'Добры дзень [[+uid]]\n\n Для актывацыі новага пароля перайдзіце па спасылцы:
\n\n[[+surl]]\n\n пасля паспяховага пераходу па спасылцы Вы можаце выкарыстоўваць наступны пароль для ўваходу ў сістэму:\n\nПароль: [[+pwd]]\n\nКалі Вы не запытвалі напамін пароля, то праігнаруйце гэты ліст.\n\nЗ павагай,\n адміністратар сайта';

$_lang['setting_websignupemail_message'] = 'Рэгістрацыя вэб-карыстальніка';
$_lang['setting_websignupemail_message_desc'] = 'Тут вы можаце стварыць паведамленне, якое будзе адсылацца вэб-карыстальнікам, калі ствараецца уліковы запіс новага вэб-карыстальніка. Ліст павінны ўтрымліваць лагін і пароль. <br /> <strong> ВАЖНА: </strong> Наступныя плейсхолдеры замяняюцца MODX перад адпраўкай пісьма: <br /> <br /> [[+sname]] - назва вашага сайта, <br /> [[+saddr]] - адрас электроннай пошты вашага сайта, <br /> [[+surl]] - url вашага сайта, <br /> [[+uid]] - імя ўліковага запісу карыстальніка (лагін) або ID, <br /> [[+pwd]] - пароль карыстальніка, <br /> [[+ufn]] - поўнае імя карыстальніка. <br /> <br /> <strong> Абавязкова ўкажыце тэгі [[+uid]] і [[+pwd]] ў лісце, інакш вашыя карыстальнікі не змогуць даведацца свае імя ўліковага запісу і пароль! </ strong>';
$_lang['setting_websignupemail_message_default'] = 'Добры дзень, [[+uid]] \n\n Гэта Вашы даныя рэгістрацыі на сайце [[+sname]]: \n\n Ваш логін: [[+uid]] \n Пароль: [[+pwd]] \n\n Як толькі вы зойдзеце на сайт ([[+surl]]), вы зможаце памяняць свой пароль. \n\n З павагай, \n\n Адміністрацыя сайта';

$_lang['setting_welcome_screen'] = 'Паказваць экран прывітання';
$_lang['setting_welcome_screen_desc'] = 'Калі выбрана «Так», экран прывітання будзе аднаразова адлюстраваны пры наступнай загрузцы старонкі прывітання.';

$_lang['setting_welcome_screen_url'] = 'URL экрана прывітання';
$_lang['setting_welcome_screen_url_desc'] = 'URL экрана прывітання, якое адлюстроўваецца пры першай загрузцы MODX Revolution.';

$_lang['setting_welcome_action'] = 'Дзеянне экрана прывітання';
$_lang['setting_welcome_action_desc'] = 'Кантролер па змаўчанні пры ўваходзе ў панэль кіравання ў выпадку, калі кантролер не зададзены ў URL.';

$_lang['setting_welcome_namespace'] = 'Прастора імёнаў экрана прывітання';
$_lang['setting_welcome_namespace_desc'] = 'Прастора імёнаў, якой належыць дзеянне экрана прывітання.';

$_lang['setting_which_editor'] = 'Рэдактар';
$_lang['setting_which_editor_desc'] = 'Тут вы можаце выбраць, які рэдактар выкарыстоўваць. Вы можаце спампаваць і ўсталяваць дадатковыя рэдактары ў раздзеле кіравання пакетамі.';

$_lang['setting_which_element_editor'] = 'Рэдактар кода';
$_lang['setting_which_element_editor_desc'] = 'Тут вы можаце выбраць які рэдактар выкарыстоўваць пры рэдагаванні кода. Вы можаце спампаваць і ўсталяваць дадатковыя рэдактары ў раздзеле кіравання пакетамі.';

$_lang['setting_xhtml_urls'] = 'XHTML-сумяшчальныя URL';
$_lang['setting_xhtml_urls_desc'] = 'Калі выбрана «Так», усе спасылкі, якія генерыруюцца MODX, будуць XHTML-сумяшчальнымі (сімвал &amp; будзе заменены на адпаведную сутнасць &amp;amp;).';

$_lang['setting_default_context'] = 'Кантэкст па змаўчанні';
$_lang['setting_default_context_desc'] = 'Выберыце кантэкст, які выкарыстоўваецца па змаўчанні пры стварэнні новага рэсурсу.';

$_lang['setting_auto_isfolder'] = 'Аўтаматычна пазначаць як «кантэйнер»';
$_lang['setting_auto_isfolder_desc'] = 'Калі параметр уключаны, рэсурс будзе пазначаны як «кантэйнер» аўтаматычна.';

$_lang['setting_default_username'] = 'Імя карыстальніка па змаўчанні';
$_lang['setting_default_username_desc'] = 'Імя карыстальніка па змаўчанні для неаўтарызаваных карыстальнікаў.';

$_lang['setting_manager_use_fullname'] = 'Адлюстроўваць поўнае імя ў панэлі кіравання ';
$_lang['setting_manager_use_fullname_desc'] = 'Калі ўключана, у панэлі кіравання замест поля "loginname" будзе адлюстроўвацца поле "fullname"';

$_lang['log_snippet_not_found'] = 'Запісваць памылкі калі сніпет не знойдены';
$_lang['log_snippet_not_found_desc'] = 'Калі параметр уключаны, выклік снипетаў, якія не былі знойдзеныя, пакіне запіс у «Журнале памылак».';
