<?php
/**
 * Export English lexicon topic
 *
 * @language en
 * @package modx
 * @subpackage lexicon
 */
$_lang['export_site_cacheable'] = 'non-cacheable फ़ाइलों में शामिल हैं:';
$_lang['export_site_exporting_document'] = 'Exporting file <strong>%s</strong> of <strong>%s</strong><br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<small><i>%s</i>, id %s</small><br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;';
$_lang['export_site_failed'] = '<span style="color:#990000">Failed!</span>';
$_lang['export_site_html'] = 'साइट HTML को निर्यात करें';
$_lang['export_site_maxtime'] = 'अधिकतम समय निर्यात करें:';
$_lang['export_site_maxtime_message'] = 'यहाँ आप MODX साइट (PHP सेटिंग को ओवरराइड करने) निर्यात करने के लिए ले जा सकते हैं सेकंड की संख्या निर्दिष्ट कर सकते हैं। 0 के लिए असीमित समय दर्ज करें। कृपया ध्यान दें, 0 सेट करने या एक सच में उच्च संख्या अजीब चीजें आपके सर्वर करने के लिए कर सकते हैं और नहीं की सिफारिश की है।';
$_lang['export_site_message'] = '<p>इस समारोह का उपयोग कर आप पूरे स्थल निर्यात कर सकते हैं HTML फ़ाइलें करने के लिए। कृपया, तथापि, कि तुम क्या करना चाहिए आप ऐसा MODX कार्यशीलता का एक बहुत कुछ खो देंगे नोट:</p> <ul><li>पेज पढ़ता है निर्यात की गई फ़ाइलों पर दर्ज नहीं हो जाएगा।</li><li>इंटरैक्टिव snippets निर्यात की गई फ़ाइलों में काम नहीं करेगा</li><li>केवल नियमित रूप से दस्तावेज़ निर्यात किए जाएँगे, Weblinks निर्यात नहीं किया जाएगा।</li><li>निर्यात प्रक्रिया विफल हो सकता है यदि आपके दस्तावेज़ों में स्निपेट्स जो पुर्ननिर्देशन हेडर भेजने होते हैं।</li><li>Depending कैसे आप अपने दस्तावेज़ों, लिखा है पर शैली पत्रकों और छवियों, आपकी साइट के डिजाइन भंग हो सकती हैं। इसे ठीक करने के लिए, आप सहेजें/आपकी निर्यात की गई फ़ाइलों को एक ही निर्देशिका जहाँ मुख्य MODX index. php फ़ाइल स्थित है कदम कर सकते हैं।</li></ul><p>कृपया बाहर फार्म भरें और \'निर्यात प्रक्रिया प्रारंभ करने के लिए निर्यात करें\' दबाएँ। आप निर्दिष्ट करें, का उपयोग कर, जहां संभव हो, फ़ाइल नामों के रूप में दस्तावेज़ का फर्जी नाम स्थान में बनाई गई फ़ाइलें सहेजा जाएगा। आपकी साइट निर्यात करते समय, यह MODX \'\' हाँ \' पर सेट कॉन्फ़िगरेशन आइटम दोस्ताना उपनाम\' है सबसे अच्छा है। आपकी साइट के आकार के आधार पर, निर्यात थोड़ी देर लग सकते हैं।</p><p><em>किसी भी मौजूदा फ़ाइलें नई फ़ाइलों द्वारा अधिलेखित हो जाएगी, यदि उनका नाम समान हैं!</em></p>';
$_lang['export_site_numberdocs'] = '<p><strong>मिला %s दस्तावेज़ों को निर्यात करें...</strong></p>';
$_lang['export_site_prefix'] = 'फ़ाइल उपसर्ग:';
$_lang['export_site_start'] = 'निर्यात शुरू';
$_lang['export_site_success'] = '<span style="color:#009900"> सफलता!</span>';
$_lang['export_site_suffix'] = 'File suffix:';
$_lang['export_site_target_unwritable'] = 'Target directory writable नहीं है। कृपया सुनिश्चित करें directory लिखने योग्य है और पुन: प्रयास करें।';
$_lang['export_site_time'] = 'निर्यात समाप्त हो गया। निर्यात को पूरा करने के लिए %s सेकंड लिया।';