<?php
/**
 * TV English lexicon topic
 *
 * @language en
 * @package modx
 * @subpackage lexicon
 */
$_lang['has_access'] = 'तक पहुँच गया है?';
$_lang['filter_by_category'] = 'Category द्वारा फ़िल्टर करें...';
$_lang['rank'] = 'पद';
$_lang['rendering_options'] = 'प्रतिपादन विकल्प';
$_lang['tv'] = 'पोस्टर चर';
$_lang['tv_access_msg'] = 'इस टेम्पलेट Variable के अंतर्गत आता है कि Resource Groups का चयन करें। चयनित समूहों के लिए उपयोग के साथ ही users को इस टीवी को संशोधित करने में सक्षम हो जाएगा। कोई समूह का चयन कर रहे हैं, तो Manager के उपयोग के साथ सभी users टीवी को संशोधित करने में सक्षम हो जाएगा।';
$_lang['tv_binding_msg'] = 'इस फ़ील्ड का उपयोग कर डेटा स्रोत बाइंडिंग का समर्थन करता है @ आदेशों';
$_lang['tv_caption'] = 'कैप्शन';
$_lang['tv_change_template_msg'] = 'सहेजे नहीं गए परिवर्तनों को खोने, इस टेम्पलेट टेम्पलेट वेरिएबल को फिर से लोड करने के लिए पृष्ठ का कारण होगा बदल रहा है। <br /> <br /> क्या आप वाकई इस टेम्पलेट बदलने के लिए चाहते हैं?';
$_lang['tv_delete_confirm'] = 'क्या आप बकाई इस टीवी को हटाना चाहते हैं';
$_lang['tv_desc_caption'] = 'पाठ के पास टीवी जब इसे संपादन के रूप में एक Resource उपयोग किया जाएगा।';
$_lang['tv_desc_category'] = 'Category इस टीवी में है।';
$_lang['tv_desc_description'] = 'इस टीवी का एक छोटा वर्णन।';
$_lang['tv_desc_name'] = 'इस टीवी का नाम है। यह [[* NameOfTV]] टैग का उपयोग कर उपलब्ध हो जाएगा।';
$_lang['tv_description'] = 'Description:';
$_lang['tv_err_delete'] = 'पोस्टर वेरिएबल को हटाते समय एक त्रुटि उत्पन्न हुईं|';
$_lang['tv_err_duplicate'] = 'पोस्टर वैरिएबल को डुप्लीकेट करने का प्रयास करते समय एक त्रुटि उत्पन्न हुईं|';
$_lang['tv_err_duplicate_templates'] = 'टीवी टेम्पलेट्स duplicating करते समय एक त्रुटि उत्पन्न हुई।';
$_lang['tv_err_duplicate_documents'] = 'टीवी संसाधनों  को डुप्लीकेट करते समय एक त्रुटि हुईं |';
$_lang['tv_err_duplicate_documentgroups'] = 'टीवी संसधन समूह को डुप्लीकेट करते समय कोई त्रुटि उत्पन्न हुईं |';
$_lang['tv_err_ae'] = 'एक टेम्पलेट Variable पहले से "[[+name]]" नाम के साथ मौजूद है।';
$_lang['tv_err_invalid_name'] = 'आप अपने टेम्पलेट Variable नाम में अमान्य वर्ण हैं।';
$_lang['tv_err_locked'] = 'Template Variable अवरोधित!';
$_lang['tv_err_nf'] = 'Template variable नहीं पाया।';
$_lang['tv_err_nfs'] = 'Template variable के साथ key नहीं मिला: [[+id]]';
$_lang['tv_err_ns'] = 'Template variable निर्दिष्ट नहीं किया गया।';
$_lang['tv_err_reserved_name'] = 'एक टेम्पलेट वेरिएबल का नाम संसाधन फील्ड के समान नही हो सकता है |';
$_lang['tv_err_save_access_permissions'] = 'टेम्पलेट वेरिएबल एक्सेस अनुमतियो को सहजने का प्रयास करते समय एक त्रुटि हुईं |';
$_lang['tv_err_save'] = 'टेम्पलेट वेरियेबल को सहजते समय एक त्रुटि हुईं |';
$_lang['tv_inuse'] = 'निम्नलिखित संसाधन वर्तमान में इस टेम्पलेट चर का उपयोग कर रहे हैं। डिलीट ऑपरेशन जारी रखने के लिए डिलीट बटन पर क्लिक करें अन्यथा रद्द करें बटन पर क्लिक करें.';
$_lang['tv_inuse_template'] = 'निम्न टेम्पलेट वर्तमान मे इस TV का उपयोग कर रहे हैं: [[+टेम्पलेट्स]].<br /><br />कृपया इसे हटाने से पहले TV को टेम्प्लेट(s) से अलग करें.';
$_lang['tv_input_options'] = 'इनपुट विकल्प';
$_lang['tv_input_options_msg'] = '<p>यहाँ आप इनपुट के लिए Template Variable, इनपुट रैंडर कि आप का चयन करें का प्रकार के लिए विशिष्ट विकल्प संपादित कर सकते हैं।</p>';
$_lang['tv_lock'] = 'संपादन के लिए Lock variable';
$_lang['tv_lock_msg'] = 'Users को edit_locked विशेषता इस Template Variable संपादित करें आदेश के लिए होना आवश्यक है।';
$_lang['tv_management_msg'] = 'अपने संसाधनों के लिए अतिरिक्त कस्टम सामग्री फील्ड (टेम्प्लेट चर) प्रबंधित करें.';
$_lang['tv_msg'] = 'यहां वेरिएबल टेम्प्लेट जोड़ें या संपादित करें। टेम्प्लेट वैरिएबल को स्निपेट और संसाधनों से एक्सेस करने के लिए टेम्प्लेट को असाइन किया जाना चाहिए.';
$_lang['tv_name'] = 'चर का नाम';
$_lang['tv_new'] = 'नए Template Variable';
$_lang['tv_novars'] = 'कोई टेम्पलेट स्लाइडर नही मिला';
$_lang['tv_output_options'] = 'आउटपुट विकल्प';
$_lang['tv_output_options_msg'] = '<p>यहाँ आप Template Variables, आउटपुट का प्रकार के लिए विशिष्ट के लिए विकल्प प्रस्तुत करना कि आप का चयन करें आउटपुट संपादित कर सकते हैं।</p>';
$_lang['tv_properties'] = 'डिफ़ॉल्ट गुण';
$_lang['tv_rank'] = 'सॉर्ट क्रम';
$_lang['tv_reset_params'] = 'पैरामीटर्स को रीसेट';
$_lang['tv_sources.intro_msg'] = 'यहाँ आप मीडिया स्रोतों कि प्रत्येक निर्दिष्ट Context में इस टीवी के लिए इस्तेमाल किया जा करने के लिए कर रहे हैं असाइन कर सकते हैं। इसे परिवर्तित करने के लिए ग्रिड में स्रोत के नाम पर डबल क्लिक करें।';
$_lang['tv_tmpl_access'] = 'टेम्पलेट का उपयोग';
$_lang['tv_tmpl_access_msg'] = 'वें टेम्प्लेट चुनें जिन्हें इस टेम्प्लेट वेरिएबल तक पहुंचने की अनुमति हैं.';
$_lang['tv_widget'] = 'विजेट';
$_lang['tv_widget_prop'] = 'विजेट गुण';
$_lang['tvd_err_remove'] = 'टेम्पलेट चर को संसाधन से निकालने का प्रयास करते समय कोई त्रुटि हुईं';
$_lang['tvdg_err_remove'] = 'टेम्पलेट चर राशि को संसाधन समूह से निकालने का प्रयास करते समय कोई त्रुटि उत्पन्न हुईं और';
$_lang['tvdg_err_save'] = 'टेम्पलेट चर को संसाधन समूह में अनुलग्न करने का प्रयास। करते समय कोई त्रुटि उत्पन्न हुईं';
$_lang['tvs'] = 'पोस्टर चर';
$_lang['tvt_err_nf'] = 'टेम्पलेट वेरिएबल की निर्दिष्ट टेम्पलेट तक पहुंच नहीं हैं';
$_lang['tvt_err_remove'] = 'टेम्पलेट से वेरिएबल टेम्पलेट को निकालने का प्रयास करते समय एक त्रुटि उत्पन्न हुईं';
$_lang['tvt_err_save'] = 'टेम्पलेट वेरिएबल को टेम्पलेट में संल्लग्न करने का प्रयास करते समय समय एक त्रुटि हुईं उत्पन्न हुईं';
