<?php
/**
 * English language files for Revolution 2.0.0 setup
 *
 * @package setup
 */
$_lang['additional_css'] = '';
$_lang['addons'] = 'Дапаўненні';
$_lang['advanced_options'] = 'Дадатковыя параметры';
$_lang['all'] = 'Усе';
$_lang['app_description'] = 'CMS і фрэймворк';
$_lang['app_motto'] = 'MODX. Стварай і рабі шмат, працуй менш!';
$_lang['back'] = 'Назад';
$_lang['base_template'] = 'Пачатковы шаблон';
$_lang['cache_manager_err'] = 'Кіравальнік кэшам MODX не можа быць загружаны.';
$_lang['choose_language'] = 'Выберыце мову';
$_lang['cleanup_errors_title'] = 'Важная заўвага:';
$_lang['cli_install_failed'] = 'Не атрымалася выканаць усталёўку! Памылкі: [[+errors]]';
$_lang['cli_no_config_file'] = 'MODX не змог знайсці канфігурацыйны файл (такі як config.xml) для вашай CLI ўсталёўкі. Для запуску ўсталёўкі MODX з каманднага радка вы павінны мець файл канфігурацыі ў фармаце XML. Глядзіце афіцыйную дакументацыю для атрымання дадатковай інфармацыі.';
$_lang['cli_tests_failed'] = 'Папярэднія тэсты не прайшлі! Памылкі: [[+errors]]';
$_lang['close'] = 'зачыніць';
$_lang['config_file_err_w'] = 'Памылка запісу файла канфігурацыі.';
$_lang['config_file_perms_notset'] = 'Правы доступу да файла канфігурацыі не былі абноўлены. Вы можаце змяніць правы доступу да файла канфігурацыі, каб абараніць файл ад несанкцыянаванага доступу.';
$_lang['config_file_perms_set'] = 'Правы доступу да файла канфігурацыі паспяхова абноўлены.';
$_lang['config_file_written'] = 'Канфігурацыйны файл паспяхова запісаны.';
$_lang['config_key'] = 'Канфігурацыйны ключ MODX';
$_lang['config_key_change'] = 'Калі вы жадаеце змяніць канфігурацыйны ключ MODX, <a id="cck-href" href="javascript:void(0);">калі ласка, націсніце сюды.</a>';
$_lang['config_key_override'] = 'Калі вы жадаеце запусціць ўсталёўку сайта з ключом канфігурацыі, адрозным ад зададзенага па змаўчанні ў файле setup/includes/config.core.php, калі ласка, пазначце яго тут.';
$_lang['config_not_writable_err'] = 'Вы паспрабавалі змяніць налады ў файле setup/includes/config.core.php, але файл не даступны для запісу. Зрабіце гэты файл даступным для запісу або самастойна змяніце файл, перш чым працягнуць.';
$_lang['connection_character_set'] = 'Набор сімвалаў падлучэння:';
$_lang['connection_collation'] = 'Параўноўванне:';
$_lang['connection_connection_and_login_information'] = 'Падлучэнне да базы дадзеных і інфармацыя аб карыстальніку';
$_lang['connection_connection_note'] = 'Калі ласка, увядзіце наступную інфармацыю для падлучэння да базы дадзеных MODX. Калі базы дадзеных пакуль што няма, праграма ўсталёўкі паспрабуе стварыць яе для вас. (Можа адбыцца збой, калі дазволы вашай канфігурацыі або карыстальніка базы дадзеных не дазваляюць зрабіць гэта.)';
$_lang['connection_database_host'] = 'Сервер базы дадзеных:';
$_lang['connection_database_info'] = 'Зараз, калі ласка, увядзіце рэгістрацыйныя дадзеныя для вашай базы дадзеных.';
$_lang['connection_database_login'] = 'Імя карыстальніка базы дадзеных:';
$_lang['connection_database_name'] = 'Імя базы дадзеных:';
$_lang['connection_database_pass'] = 'Пароль карыстальніка базы дадзеных:';
$_lang['connection_database_type'] = 'Тып базы дадзеных:';
$_lang['connection_default_admin_email'] = 'Email адміністратара:';
$_lang['connection_default_admin_login'] = 'Імя адміністратара:';
$_lang['connection_default_admin_note'] = 'Зараз вам патрэбна ўвесці некаторыя дэталі для профілю галоўнага адміністратара. Вы можаце ўвесці сваё імя і пароль, якія вы, верагодна, не забудзеце. Яны вам спатрэбяцца, каб увайсці ў сістэму пасля сканчэння ўсталёўкі.';
$_lang['connection_default_admin_password'] = 'Пароль адміністратара:';
$_lang['connection_default_admin_password_confirm'] = 'Пацверджанне паролю:';
$_lang['connection_default_admin_user'] = 'Адміністратар па змаўчанні';
$_lang['connection_table_prefix'] = 'Прэфікс табліц:';
$_lang['connection_test_connection'] = 'Праверыць злучэнне';
$_lang['connection_title'] = 'Інфармацыя аб злучэнні';
$_lang['context_connector_options'] = '<strong>Налады злучальнікаў</strong> (службы AJAX злучальнікаў)';
$_lang['context_connector_path'] = 'Шлях файлавай сістэмы для злучальнікаў';
$_lang['context_connector_url'] = 'URL для злучальнікаў';
$_lang['context_installation'] = 'Усталёўка кантэксту';
$_lang['context_manager_options'] = '<strong>Параметры кантэксту сістэмы кіравання</strong> (інтэрфэйс адміністратара сайта)';
$_lang['context_manager_path'] = 'Шлях файлавай сістэмы для кантэксту mgr';
$_lang['context_manager_url'] = 'URL для кантэксту mgr';
$_lang['context_override'] = 'Пакіньце адключаным, каб дазволіць сістэме самастойна вызначаць гэтую інфармацыю. Пазначаючы канкрэтнае значэнне, незалежна ад таго, ці самастойна вы яго пазначылі, вы пацвярджаеце, што вы жадаеце, каб шлях быў усталяваны менавіта да гэтага значэння ў канфігурацыі.';
$_lang['context_web_options'] = '<strong>Параметры кантэксту web</strong> (частка сайта, даступная знешнім карыстальнікам)';
$_lang['context_web_path'] = 'Шлях файлавай сістэмы для кантэксту web';
$_lang['context_web_url'] = 'URL для кантэксту web';
$_lang['continue'] = 'Працягнуць';
$_lang['dau_err_save'] = 'Памылка падчас захавання адміністратара па змаўчанні.';
$_lang['dau_saved'] = 'Створаны адміністратар па змаўчанні.';
$_lang['db_check_db'] = 'Праверка базы дадзеных:';
$_lang['db_connecting'] = 'Злучэнне з серверам базы дадзеных:';
$_lang['db_connected'] = 'Падлучэнне да базы дадзеных адбылося паспяхова!';
$_lang['db_created'] = 'Паспяхова створана база дадзеных.';
$_lang['db_err_connect'] = 'Не атрымалася падлучыцца да базы дадзеных.';
$_lang['db_err_connect_upgrade'] = 'Не атрымалася падлучыцца да існуючай базы дадзеных для абнаўлення. Праверце параметры злучэння і паспрабуйце ізноў.';
$_lang['db_err_connect_server'] = 'Не атрымалася падлучыцца да сервера базы дадзеных. Праверце параметры злучэння і паспрабуйце ізноў.';
$_lang['db_err_create'] = 'Адбылася памылка падчас спробы стварыць базу дадзеных.';
$_lang['db_err_create_database'] = 'MODX не можа стварыць базу дадзеных. Самастойна стварыце базу дадзеных, а затым паўтарыце спробу.';
$_lang['db_err_show_charsets'] = 'MODX не ўдалося атрымаць даступныя наборы сімвалаў ад вашага сервера MySQL.';
$_lang['db_err_show_collations'] = 'MODX не ўдалося атрымаць спіс даступных супастаўленняў ад вашага сервера MySQL.';
$_lang['db_success'] = 'Паспяхова!';
$_lang['db_test_coll_msg'] = 'Спроба стварэння або выбаркі з базы дадзеных.';
$_lang['db_test_conn_msg'] = 'Праверыць злучэнне з серверам базы дадзеных і адлюстраваць спіс даступных супастаўленняў.';
$_lang['default_admin_user'] = 'Адміністратар па змаўчанні';
$_lang['delete_setup_dir'] = 'Адзначце гэта, каб выдаліць каталог ўсталёўкі з файлавай сістэмы.';
$_lang['dir'] = 'Злева направа';
$_lang['email_err_ns'] = 'Адрас электроннай пошты няправільны';
$_lang['err_occ'] = 'Адбыліся памылкі!';
$_lang['err_update_table'] = 'Памылка падчас абнаўлення табліцы для класа [[+class]]';
$_lang['errors_occurred'] = 'Падчас ўсталёўкі ядра здарыліся памылкі. Калі ласка, азнаёмцеся з вынікамі ўсталёўкі ніжэй, выпраўце праблемы і працягвайце як напісана.';
$_lang['failed'] = 'Памылка!';
$_lang['fatal_error'] = 'FATAL ERROR: Немагчыма пряцягнуць усталёўку MODX.';
$_lang['home'] = 'Галоўная';
$_lang['congratulations'] = 'Віншуем!';
$_lang['img_banner'] = 'assets/images/img_banner.gif';
$_lang['img_box'] = 'assets/images/img_box.png';
$_lang['img_splash'] = 'assets/images/img_splash.gif';
$_lang['install'] = 'Усталяваць';
$_lang['install_packages'] = 'Усталяваць пакеты';
$_lang['install_packages_desc'] = 'Вы можаце выбраць дадатковыя пакеты для ўсталёўкі. Пасля выбару ўсіх неабходных вам пакетаў націсніце «Гатова» для сканчэння ўсталёўкі.';
$_lang['install_packages_options'] = 'Варыянты ўсталёўкі пакетаў';
$_lang['install_success'] = 'Асноўная ўсталёўка прайшла паспяхова. Націсніце далей, каб завяршыць працэс ўсталёўкі.';
$_lang['install_summary'] = 'Зводка ўсталёўкі';
$_lang['install_update'] = 'Усталяваць/Абнавіць';
$_lang['installation_finished'] = 'Усталёўка завершана за [[+time]]';
$_lang['license'] = '<p class="title">Вы павінны пагадзіцца з ліцэнзіяй, перш чым працягнуць усталёўку.</p>
<p>Выкарыстанне гэтага праграмнага забеспячэння рэгулюецца ліцэнзіяй GPL. Каб дапамагчы вам зразумець, што такое ліцэнзія GPL і як гэта ўплывае на вашу здольнасць выкарыстоўваць праграмнае забеспячэнне, мы прадугледзелі наступныя моманты:</p>
<h4>Ліцэнзія The GNU General Public з\'яўляецца вольнай ліцэнзіяй.</h4>
<p>Як і любая вольная ліцэнзія праграмнага забеспячэння, яна дазваляе вам чатыры наступныя вольнасці:</p>
<ul>
<li>Вольнасць запускаць праграму з любымі мэтамі.</li>
<li>Вольнасць вывучаць, як праграма працуе, і адаптаваць яе да вашых патрэбаў.</li>
<li>Вольнасць распаўсюджваць копіі, што дазволіць дапамагчы сваім калегам.</li>
<li>Вольнасць паляпшаць праграму і публікаваць вашыя паляпшэнні для грамадскасці, каб гэта было выгадна ўсёй супольнасці.</li>
</ul>
<p>Вы можаце карыстацца вольнасцямі, названымі вышэй, пры ўмове, што вы выконваеце
пазначаныя ўмовы дадзенай ліцэнзіі. Асноўнымі ўмовамі з\'яўляюцца: </p>
<ul>
<li>Вы павінны прыкметна і адпаведна публікаваць на кожнай копіі ПЗ
адпаведнае паведамленне аб аўтарскіх правах і адмову ад гарантый і захоўваць некранутымі ўсё
паведамленні, якія адносяцца да дадзенай ліцэнзіі і да адсутнасці якіх-небудзь гарантый; і даваць
любым іншым атрымальнікам Праграмы копію ліцэнзіі GNU General Public
разам з Праграмай. Любы пераклад ліцэнзіі GNU General Public павінны
суправаджацца ліцэнзіяй GNU General Public.</li>

<li>Калі вы змяняеце сваю копію або копіі праграмы або любую яе частку, або
распрацоўваеце праграму, заснаваную на ёй, вы можаце распаўсюджваць вынікы працы пры ўмове,
што вы робіце гэта пад ліцэнзіяй GNU General Public. Любы пераклад ліцэнзіі GNU General Public 
павінен суправаджацца ліцэнзіяй GNU General Public.</li>

<li>Калі вы капіруеце або распаўсюджваеце праграму, вы павінны суправаджаць яе 
поўным адпаведным зыходным кодам у машыначытальным выглядзе або з пісьмовай прапановай,
сапраўднай на працягу не менш трох гадоў, адпаведна якой поўны зыходны код 
у машыначытальным выглядзе будзе прадастаўлены.</li>

<li>Любая з гэтых умоў можа быць адменена, калі вы атрымаеце дазвол ад
уладальніка аўтарскіх правоў.</li>

<li>Ваша правамернае выкарыстанне і іншыя правы ніякім чынам не ўплываюць на ўмовы вышэй.</li>
</ul>
<p>Вышэй прыведзена кароткае апісанне ліцэнзіі GNU General Public. Працягваючы, вы
згаджаецеся з ліцэнзіяй GNU General Public. Вышэй прыведзены
проста кароткі пераказ ліцэнзіі GNU General Public і яго дакладнасць не
гарантавана. Настойліва рэкамендуецца прачытаць тэкст ліцэнзіі <a href="http://www.gnu.org/copyleft/gpl.html" onclick="window.open(this.href); return false;" onkeypress="window.open(this.href); return false;">GNU General Public</a> 
у поўным аб\'ёме, перш чым працягваць. Тэкст ліцэнзіі таксама можа быць знойдзены ў 
файле ліцэнзіі, які распаўсюджваецца разам з гэтым пакетам.</p>
';
$_lang['license_agree'] = 'Я згодны з умовамі, запісанымі ў гэтай ліцэнзіі.';
$_lang['license_agreement'] = 'Ліцэнзійная дамова';
$_lang['license_agreement_error'] = 'Вы павінны пагадзіцца з ліцэнзіяй, перш чым працягнуць усталёўку.';
$_lang['locked'] = 'MODX Setup is locked!';
$_lang['locked_message'] = '<p>You will need to remove the setup/.locked/ directory in order to proceed.</p>';
$_lang['login'] = 'Увайсці';
$_lang['modx_class_err_nf'] = 'Не атрымалася знайсці файл класа MODX.';
$_lang['modx_configuration_file'] = 'Канфігурацыйны файл MODX';
$_lang['modx_err_instantiate'] = 'Не атрымалася стварыць асобнік класа MODX.';
$_lang['modx_err_instantiate_mgr'] = 'Не атрымалася ініцыялізаваць кантэкст сістемы кіравання MODX.';
$_lang['modx_footer1'] = '&copy; 2005-[[+current_year]] <a href="http://www.modx.com/" onclick="window.open(this.href); return false;" onkeypress="window.open(this.href); return false;">MODX</a> Content Mangement Framework (CMF). Усе правы абаронены. MODX ліцэнзаваны GNU GPL.';
$_lang['modx_footer2'] = 'MODX – свабоднае праграмнае забеспячэнне. Мы заахвочваем вас быць творчым і выкарыстоўваць MODX ў любым выпадку, які вы палічыце патрэбным. Проста пераканайцеся, што калі вы робіце змены і вырашылі распаўсюджваць зменены MODX, зыходны код застаецца бясплатным!';
$_lang['modx_install'] = 'Усталёўка MODX';
$_lang['modx_install_complete'] = 'Усталёўка MODX завершана';
$_lang['modx_object_err'] = 'Аб\'ект MODX не можа быць загружаны.';
$_lang['next'] = 'Далей';
$_lang['none'] = 'Не пазначана';
$_lang['ok'] = 'Добра!';
$_lang['options_core_inplace'] = 'Файлы ўжо на месцы<br /><small>(Рэкамендуецца для ўсталёўкі на звычайных хостынгах.)</small>';
$_lang['options_core_inplace_note'] = 'Адзначце гэты пункт да пачатку ўсталёўкі, калі вы выкарыстоўваеце MODX з Git або разархівіравалі на сервер ядро з поўнага пакета MODX.';
$_lang['options_core_unpacked'] = 'Пакет ядра сістэмы быў уручную разархівіраваны<br /><small>(Рэкамендуецца для ўсталёўкі на звычайных хостынгах.)</small>';
$_lang['options_core_unpacked_note'] = 'Адзначце гэты пункт, калі вы ўручную разархівіравалі пакет ядра сістэмы з файла core/packages/core.transport.zip. Гэта скароціць час усталёўкі на сістэмах, дзе забаронена змяняць час выканання скрыптоў (налада PHP time_limit і налады Apache па выкананні скрыптоў).';
$_lang['options_install_new_copy'] = 'Усталяваць новую копію ';
$_lang['options_install_new_note'] = 'Звярніце ўвагу, гэты параметр можа перазапісаць любыя дадзеныя ў вашай базе дадзеных.';
$_lang['options_important_upgrade'] = 'Важная заўвага абнаўлення';
$_lang['options_important_upgrade_note'] = 'Каб пазбегнуць праблем (напрыклад, адсутнасць доступу да рэсурсаў), перад пачаткам абнаўлення пераканайцеся, што усе карыстальнікі <strong>выйшлі з сістэмы кіравання сайтам</strong>. Калі пасля абнаўлення праблемы ўсё ж з\'явіліся, то завяршыце ўсе сеансы карыстальнікаў сайта, ачысціце кэш браўзэра і пасля гэтага ўвайдзіце ў сістэму ізноў.';
$_lang['options_new_file_permissions'] = 'Дазволы для новых файлаў';
$_lang['options_new_file_permissions_note'] = 'Вы можаце змяніць правы доступу для новых файлаў, створаных з дапамогай MODX, напрыклад, 0664 ці 0666.';
$_lang['options_new_folder_permissions'] = 'Дазволы для новых каталогаў';
$_lang['options_new_folder_permissions_note'] = 'Вы можаце змяніць правы доступу для новых каталогаў, створаных з дапамогай MODX, напрыклад, 0775 ці 0777.';
$_lang['options_new_installation'] = 'Новая ўсталёўка';
$_lang['options_nocompress'] = 'Адключыць сціск CSS/JS';
$_lang['options_nocompress_note'] = 'Адзначце гэта, калі сістэма кіравання не працуе са сціснутымі CSS/JS.';
$_lang['options_send_poweredby_header'] = 'Дасылаць загаловак X-Powered-By';
$_lang['options_send_poweredby_header_note'] = 'Калі гэта опцыя ўключаная, MODX будзе дасылаць загаловак "X-Powered-By" каб пазначыць, што гэты сайт пабудаваны на MODX. Гэта дапамагае адсочваць глабальнае выкарыстоўванне MODX з дапамогай іншых трэкераў, якія іспектуюць ваш сайт. Але таксама гэта дазваляе лягчэй ідэнтыфікаваць на чым ваш сайт створаны і гэта можа крыху павялічыць рызыку для бяспекі калі будуць знойдзены ўразлівасці ў MODX.';
$_lang['options_title'] = 'Параметры ўсталёўкі';
$_lang['options_upgrade_advanced'] = 'Прасунутае абнаўленне<br /><small>(рэдагаванне канфігурацыі базы дадзеных)</small>';
$_lang['options_upgrade_advanced_note'] = 'Для дасведчаных адміністратараў баз дадзеных або пераезду на серверы з іншым наборам сімвалаў злучэння да базы дадзеных. <strong>Вы павінны будзеце ведаць поўную назву вашай базы дадзеных, імя карыстальніка, пароль і дэталі злучэння/параўноўвання.</strong>';
$_lang['options_upgrade_existing'] = 'Абнавіць існуючую ўсталёўку';
$_lang['options_upgrade_existing_note'] = 'Абнавіць вашыя існуючыя файлы і базу дадзеных.';
$_lang['package_execute_err_retrieve'] = 'Усталёўка не атрымалася, таму што MODX не змог разпакаваць пакет [[+path]]packages/core.transport.zip. Праверце, што файл [[+path]]packages/core.transport.zip існуе і даступны для запісу, а каталог [[+path]]packages/ мае магчымасць запісу ў яго.';
$_lang['package_err_install'] = 'Не атрымалася ўсталяваць пакет [[+package]].';
$_lang['package_err_nf'] = 'Не атрымалася пачаць усталёўку пакета [[+package]].';
$_lang['package_installed'] = 'Паспяхова ўсталяваны пакет [[+package]].';
$_lang['password_err_invchars'] = 'Ваш пароль не можа ўтрымліваць недапушчальныя сімвалы, такія як /, \\, &apos;, &quot;, (, ) або {}.';
$_lang['password_err_nomatch'] = 'Пароль не супадае';
$_lang['password_err_ns'] = 'Пароль пусты';
$_lang['password_err_short'] = 'Ваш пароль павінен змяшчаць не менш за [[+length]] знакаў.';
$_lang['please_select_login'] = 'Калі ласка націсніце на кнопку «Увайсці», каб патрапіць у сістэму кіравання сайтам.';
$_lang['preinstall_failure'] = 'Былі выяўлены праблемы. Калі ласка, азнаёмцеся з вынікамі выпрабаванняў ўсталёўкі, выправіце праблемы, як паказана, а затым зноў націсніце кнопку Праверыць.';
$_lang['preinstall_success'] = 'Выпрабаванні ўсталёўкі прайшлі паспяхова. Націсніце кнопку Усталяваць, каб працягнуць.';
$_lang['refresh'] = 'Аднавіць';
$_lang['request_handler_err_nf'] = 'Немагчыма загрузіць апрацоўшчык запытаў па шляху [[+path]]. Пераканайцеся, што вы запампавалі ўсе неабходныя файлы.';
$_lang['restarted_msg'] = 'MODX прыйшлося пачаць працэс ўсталёўкі нанова ў якасці меры засцярогі, таму што ўсталёўка была неактыўная больш за 15 хвілін. Калі ласка, пачніце ўсталёўку з пачатку.';
$_lang['retry'] = 'Паўтарыць';
$_lang['security_notice'] = 'Заўвага па бяспецы';
$_lang['select'] = 'Выбраць';
$_lang['settings_handler_err_nf'] = 'MODX не можа знайсці клас modInstallSettings у: [[ path]]. Калі ласка, праверце, што ўсе неабходныя файлы былі загружаны.';
$_lang['setup_err_lock'] = 'An error occurred while trying lock setup. Could not create the .locked subdirectory inside the setup directory.';
$_lang['setup_err_remove'] = 'Адбылася памылка пры спробе выдаліць каталог з файламі ўсталёўкі.';
$_lang['setup_err_assets'] = 'Ваш каталог assets/ не быў створаны па адрасе: [[+path]] <br />Вам патрэбна стварыць гэты каталог і дазволіць запіс у яго, калі вы жадаеце выкарыстоўваць кіраванне пакетамі і дадатковыя кампаненты.';
$_lang['setup_err_assets_comp'] = 'Ваш каталог assets/components/ не быў створаны па адрасе: [[+path]] <br />Вам патрэбна стварыць гэты каталог і дазволіць запіс у яго, калі вы жадаеце выкарыстоўваць кіраванне пакетамі і дадатковыя кампаненты.';
$_lang['setup_err_core_comp'] = 'Ваш каталог core/components/ не быў створаны па адрасе: [[+path]] <br />Вам патрэбна стварыць гэты каталог і дазволіць запіс у яго, калі вы жадаеце выкарыстоўваць кіраванне пакетамі і дадатковыя кампаненты.';
$_lang['skip_to_bottom'] = 'пракруціць уніз';
$_lang['success'] = 'Паспяхова';
$_lang['table_created'] = 'Паспяхова створана табліца для класа [[+class]]';
$_lang['table_err_create'] = 'Памылка падчас стварэння табліцы для класа [[+class]]';
$_lang['table_updated'] = 'Паспяхова абноўлена табліца для класа [[+class]]';
$_lang['test_class_nf'] = 'Не атрымалася знайсці клас Install Test у: [[+path]] <br />Калі ласка, пераканайцеся, што вы запампавалі ўсе неабходныя файлы.';
$_lang['test_version_class_nf'] = 'Не атрымалася знайсці клас Test Versioner у: [[+path]] <br />Калі ласка, пераканайцеся, што вы запампавалі ўсе неабходныя файлы.';
$_lang['thank_installing'] = 'Дзякуем вам за ўсталёўку ';
$_lang['transport_class_err_load'] = 'Памылка пры загрузцы транспартнага класа.';
$_lang['toggle'] = 'Пераключыць';
$_lang['toggle_success'] = 'Пераключыць паспяховыя паведамленні';
$_lang['toggle_warnings'] = 'Пераключыць папярэджанні';
$_lang['username_err_invchars'] = 'Вашае імя карыстальніка не можа ўтрымліваць недапушчальныя сімвалы, такія як
 /, \\, &apos;, &quot;, ці {}.';
$_lang['username_err_ns'] = 'Няправільнае імя карыстальніка';
$_lang['version'] = 'версія';
$_lang['warning'] = 'Папярэджанне';
$_lang['welcome'] = 'Сардэчна запрашаем у праграму ўсталёўкі MODX.';
$_lang['welcome_message'] = '<p>Гэтая праграма правядзе вас праз увесь працэс усталёўкі.</p>
<p>Калі ласка, націсніце кнопку «Далей» для працягу:</p>
';
$_lang['workspace_err_nf'] = 'Не атрымалася знайсці актыўнай працоўнай прасторы.';
$_lang['workspace_err_path'] = 'Памылка запісу шляху актыўнай працоўнай прасторы.';
$_lang['workspace_path_updated'] = 'Шлях да актыўнай працоўнай прасторы абноўлены.';
$_lang['versioner_err_nf'] = 'Не атрымалася знайсці клас Install Versioner у: [[+path]] <br />Калі ласка, пераканайцеся, што вы запампавалі ўсе неабходныя файлы.';
$_lang['xpdo_err_ins'] = 'Не атрымалася стварыць асобнік xPDO.';
$_lang['xpdo_err_nf'] = 'MODX не ўдалося знайсці клас xPDO у [[+path]]. Калі ласка, праверце, што ўсе неабходныя файлы былі загружаны.';

$_lang['preload_err_cache'] = 'Пераканайцеся, што каталог [[+path]]cache існуе і даступны для запісу працэсам PHP.';
$_lang['preload_err_core_path'] = 'Пераканайцеся, што ў файле setup/includes/config.core.php правільна вызначана зменная MODX_CORE_PATH. Яна павінна паказваць на ядро MODX.';
$_lang['preload_err_mysql'] = 'MODX патрабуе пашырэнне mysql у той час, калі выкарыстоўваецца PHP без роднага PDO, але здаецца, што пашырэнне не загружана.';
$_lang['preload_err_pdo'] = 'MODX патрабуе пашырэнне PDO у той час, калі выкарыстоўваецца роднае PDO, але здаецца, што пашырэнне не загружана.';
$_lang['preload_err_pdo_mysql'] = 'MODX патрабуе драйвер pdo_mysql у той час, калі выкарыстоўваецца роднае PDO, але здаецца, што драйвер не загружаны.';

$_lang['test_config_file'] = 'Праверка існавання і магчымасці запісу ў файл <span class="mono">[[+file]]</span>: ';
$_lang['test_config_file_nw'] = 'Для новых Linux/Unix ўсталёвак, калі ласка, стварыце ў каталозе <span class="mono"> config</span> ядра MODX пусты файл з імем <span class="mono">[[+file]].inc.php</span> з правамі, дазваляючымі запіс з PHP.';
$_lang['test_db_check'] = 'Стварэнне падлучэння да базы дадзеных: ';
$_lang['test_db_check_conn'] = 'Праверце параметры злучэння і паспрабуйце ізноў.';
$_lang['test_db_failed'] = 'Падлучэнне да базы дадзеных не атрымалася!';
$_lang['test_db_setup_create'] = 'Будзе зроблена спроба стварыць базу дадзеных.';
$_lang['test_dependencies'] = 'Праверка PHP пашырэння zlib: ';
$_lang['test_dependencies_fail_zlib'] = 'Ваша канфігурацыя PHP не мае ўсталяванага пашырэння zlib. Гэта пашырэнне неабходна для правільнай працы MODX. Калі ласка, усталюйце яго, каб працягнуць.';
$_lang['test_directory_exists'] = 'Праверка існавання каталога <span class="mono">[[+dir]]</span>: ';
$_lang['test_directory_writable'] = 'Праверка магчымасці запісу ў каталог <span class="mono">[[+dir]]</span>: ';
$_lang['test_memory_limit'] = 'Праверка, ці ўсталявана абмежаванне памяці па меншай меры ў 24 Мб: ';
$_lang['test_memory_limit_fail'] = 'MODX выявіў, што налада memory_limit менш рэкамендуемых 24 Мб. MODX не змог самастойна павысіць аб\'ём памяці да 24 Mб. Калі ласка, ўсталюйце ў файле php.ini наладу memory_limit роўнай 24 Mб або больш, каб працягнуць.';
$_lang['test_php_version_fail'] = 'Вы працуеце на PHP [[+version]], але MODX Revolution патрабуе PHP 4.3.0 або больш позняй версіі';
$_lang['test_php_version_sn'] = 'Нягледзячы на тое, што MODX будзе працаваць на вашай версіі PHP ([[+version]]), выкарыстоўваць яго c гэтай версіяй PHP вельмі не рэкамендуецца. Ваша версія PHP уразлівая з-за шматлікіх праломаў у абароне. Абнавіце PHP да версіі 4.3.11 або больш позняй для забеспячэння бяспекі вашага сайта.';
$_lang['test_php_version_start'] = 'Праверка версіі PHP:';
$_lang['test_sessions_start'] = 'Праверка, ці правільна настроены сеансы:';
$_lang['test_table_prefix'] = 'Праверка прэфікса табліц `[[+prefix]]`: ';
$_lang['test_table_prefix_inuse'] = 'Прэфікс табліц ўжо выкарыстоўваецца ў гэтай базе дадзеных!';
$_lang['test_table_prefix_inuse_desc'] = 'Працяг усталёўкі ў выбранную базу дадзеных немагчымы, таму што там ужо існуюць табліцы з пазначаным вамі прэфіксам. Калі ласка, выберыце новы прэфікс табліц і запусціце ўсталёўку ізноў.';
$_lang['test_table_prefix_nf'] = 'Прэфікс табліц не існуе ў гэтай базе дадзеных!';
$_lang['test_table_prefix_nf_desc'] = 'Праграма ўсталявання не можа ўсталяваць MODX у выбраную базу дадзеных, таму што яна не ўтрымлівае табліц з прэфіксам, пазначанным пры абнаўленні. Калі ласка, пазначце існуючы table_prefix і зноў запусціце праграму ўсталёўкі.';
$_lang['test_zip_memory_limit'] = 'Праверка даступнай памяці (для zip-пашырэння павінна быць вылучана не менш за 24 Мб): ';
$_lang['test_zip_memory_limit_fail'] = 'Для выканання скрыптоў выдзелена менш 24 Мб памяці (параметр memory_limit). MODX не змог самастойна павысіць аб\'ём памяці да 24 Mб. Для працягу ўсталюйце ў файле php.ini параметр memory_limit роўным 24 Mб або больш, тады zip-пашырэнні змогуць працаваць карэктна.';
