<?php
/**
 * Manager Log English lexicon topic
 *
 * @language en
 * @package modx
 * @subpackage lexicon
 */
$_lang['action'] = 'Действие';
$_lang['date_end'] = 'Дата окончания';
$_lang['date_start'] = 'Дата начала';
$_lang['filter_clear'] = 'Сбросить фильтр';
$_lang['manager_log'] = 'Журнал системы управления';
$_lang['mgrlog_clear'] = 'Очистить журнал системы управления';
$_lang['mgrlog_clear_confirm'] = 'Вы уверены, что хотите полностью очистить журнал системы управления? Это действие не может быть отменено.';
$_lang['mgrlog_query_msg'] = 'Задайте критерии просмотра журнала. Можно отфильтровать их за определённый период времени, но следует учитывать, что границы не включаются в результирующий период. Для выбора всех записей журнала за 01.01.2013, установите значение &laquo;Дата начала&raquo; в 01.01.2013 и &laquo;Дата окончания&raquo; в 02.01.2013.';
$_lang['mgrlog_query'] = 'Выбор критериев просмотра журнала';
$_lang['mgrlog_view'] = 'Просмотр журнала системы управления';
$_lang['object'] = 'Объект';
$_lang['occurred'] = 'Событие';
$_lang['user'] = 'Пользователь';