<?php
$_lang['action'] = 'Действие';
$_lang['date_end'] = 'Дата окончания';
$_lang['date_start'] = 'Дата начала';
$_lang['filter_clear'] = 'Очистить фильтр';
$_lang['manager_log'] = 'Протокол системы управления';
$_lang['mgrlog_clear'] = 'Очистить протокол системы управления';
$_lang['mgrlog_clear_confirm'] = 'Вы уверены, что хотите полностью очистить протокол системы управления? Это действие не может быть отменено.';
$_lang['mgrlog_query_msg'] = 'Задайте критерии просмотра протокола. Можно отфильтровать их за определённый период времени, но следует учитывать, что границы не включаются в результирующий период. Для выбора всех записей протокола за 01.01.2013, установите значение &laquo;Дата начала&raquo; в 01.01.2013 и &laquo;Дата окончания&raquo; в 02.01.2013.';
$_lang['mgrlog_query'] = 'Выбор критериев просмотра протокола';
$_lang['mgrlog_view'] = 'Просмотр протокола системы управления';
$_lang['occurred'] = 'Время';
$_lang['user'] = 'Пользователь';
