<?php
/**
 * Menu English lexicon topic
 *
 * @language en
 * @package modx
 * @subpackage lexicon
 */
$_lang['action'] = 'Действие';
$_lang['action_desc'] = 'Путь к контроллеру, который будет использоваться этим пунктом меню. Путь к контроллеру строится с префиксом в виде путей пространства имен, контроллеров и темы панели управления + значение пути. (Прим.: user/update для пространства имен core будет вида [core_namespace_path]controllers/[mgr_theme]/user/update.class.php)';
$_lang['description_desc'] = 'Текст или ключ словаря, который будет использован при генерации описания этой страницы в меню.';
$_lang['handler'] = 'Обработчик';
$_lang['handler_desc'] = 'Необязательно. Если установлено, не будет учитывать поле действия, но вместо этого запустит javasript в момент нажатия на элемент меню.';
$_lang['icon'] = 'Значок';
$_lang['icon_desc'] = 'Дополнительная иконка/разметка.';
$_lang['lexicon_key'] = 'Ключ словаря';
$_lang['lexicon_key_desc'] = 'Текст или ключ словаря, которые будет использованы при генерации заголовка этой страницы в меню.';
$_lang['menu_create'] = 'Добавить пункт';
$_lang['menu_confirm_remove'] = 'Вы уверены, что хотите удалить этот пункт из меню?';
$_lang['menu_err_ae'] = 'Пункт меню с таким именем уже существует. Пожалуйста укажите другое имя.';
$_lang['menu_err_nf'] = 'Пункт меню не найден!';
$_lang['menu_err_ns'] = 'Пункт меню не указан!';
$_lang['menu_err_remove'] = 'Произошла ошибка при попытке удалить пункт из меню.';
$_lang['menu_err_save'] = 'Произошла ошибка при попытке добавить пункт в меню.';
$_lang['menu_parent'] = 'Родительский пункт меню';
$_lang['menu_parent_err_ns'] = 'Родительский пункт меню не указан!';
$_lang['menu_parent_err_nf'] = 'Родительский пункт меню не найден!';
$_lang['menu_remove'] = 'Удалить';
$_lang['menu_top'] = 'Верхнее меню';
$_lang['menu_update'] = 'Редактировать';
$_lang['menus'] = 'Меню';
$_lang['namespace'] = 'Пространство имён';
$_lang['namespace_desc'] = 'Пространство имен, на котором основан этот пункт меню. Это позволит определять путь к загружаемому контроллеру.';
$_lang['parameters'] = 'Параметры';
$_lang['parameters_desc'] = 'Любые параметры запроса, которые вы хотите добавить к ссылке, когда нажимаете по ней в меню. (Прим.: &expire=1)';
$_lang['permissions'] = 'Привилегии';
$_lang['permissions_desc'] = 'Ключ привилегии необходимый для загрузки этого элемента меню.';
$_lang['topmenu'] = 'Верхнее меню';
$_lang['topmenu_desc'] = 'Здесь вы можете связать «действия» с пунктами верхнего меню панели управления. Просто переместите меню на соответствующие позиции.';
