<?php
$_lang['lexicon_key'] = 'Ключ словаря';
$_lang['menu_create'] = 'Создать меню';
$_lang['menu_confirm_remove'] = 'Вы уверенны, что хотите удалить  это действие из меню?';
$_lang['menu_err_ae'] = 'Меню с таким именем уже существует. Пожалуйста укажите другое имя.';
$_lang['menu_err_nf'] = 'Меню не найдено!';
$_lang['menu_err_ns'] = 'Меню не указано!';
$_lang['menu_err_remove'] = 'Произошла ошибка при попытке удалить действие из меню.';
$_lang['menu_err_save'] = 'Произошла ошибка при попытке добавить действие в меню.';
$_lang['menu_parent'] = 'Родительское меню';
$_lang['menu_parent_err_ns'] = 'Родительское меню не указанно!';
$_lang['menu_parent_err_nf'] = 'Родительское меню не найдено!';
$_lang['menu_remove'] = 'Удалить пункт меню';
$_lang['menu_top'] = 'Верхнее меню';
$_lang['menu_update'] = 'Обновить меню';
$_lang['topmenu'] = 'Верхнее меню';
$_lang['topmenu_desc'] = 'Здесь вы можете связать действие с пунктом меню в верхней строке меню менеджера modx. Просто разместите действие в соответствующей позиции меню там, где вы хотели бы его иметь.';
