<?php
$_lang['lexicon_key'] = 'Имя';
$_lang['menu_create'] = 'Создать пункт меню';
$_lang['menu_confirm_remove'] = 'Вы уверены, что хотите удалить этот пункт из меню?';
$_lang['menu_err_ae'] = 'Пункт меню с таким именем уже существует. Пожалуйста укажите другое имя.';
$_lang['menu_err_nf'] = 'Пункт меню не найден!';
$_lang['menu_err_ns'] = 'Пункт меню не указан!';
$_lang['menu_err_remove'] = 'Произошла ошибка при попытке удалить пункт из меню.';
$_lang['menu_err_save'] = 'Произошла ошибка при попытке добавить пункт в меню.';
$_lang['menu_parent'] = 'Родительский пункт меню';
$_lang['menu_parent_err_ns'] = 'Родительский пункт меню не указан!';
$_lang['menu_parent_err_nf'] = 'Родительский пункт меню не найден!';
$_lang['menu_remove'] = 'Удалить пункт меню';
$_lang['menu_top'] = 'Верхнее меню';
$_lang['menu_update'] = 'Редактировать пункт меню';
$_lang['topmenu'] = 'Верхнее меню';
$_lang['topmenu_desc'] = 'Здесь вы можете связать «действие» с пунктом верхнего меню бэкенда MODx. Просто разместите «действие» в соответствующей позиции меню там, где вы хотели бы его видеть.';
