<?php
/**
 * Menu Russian lexicon topic
 *
 * @language ru
 * @package modx
 * @subpackage lexicon
 */
$_lang['action'] = 'Действие';
$_lang['action_desc'] = 'Путь к контроллеру, используемому для этого элемента меню. Путь к контроллеру строится путем добавления в начало пути пространства имен, контроллеров и темы админки к этому значению. (Прим.: user/update для namespace ядра ведет к [core_namespace_path]controllers/[mgr_theme]/user/update.class.php)';
$_lang['description_desc'] = 'Текст или ключ перевода, который будет использован для отрисовки текста описания этой страницы в меню.';
$_lang['handler'] = 'Обработчик';
$_lang['handler_desc'] = '(Опционально) Если задан, не будет использовать поле action, но вместо него запустит этот Javascript, когда элемент меню будет нажат.';
$_lang['lexicon_key'] = 'Имя';
$_lang['lexicon_key_desc'] = 'Текст или ключ перевода, который будет использован для отрисовки текста заголовка этой страницы в меню.';
$_lang['menu_create'] = 'Добавить пункт';
$_lang['menu_confirm_remove'] = 'Вы уверены, что хотите удалить этот пункт из меню?';
$_lang['menu_err_ae'] = 'Пункт меню с таким именем уже существует. Пожалуйста укажите другое имя.';
$_lang['menu_err_nf'] = 'Пункт меню не найден!';
$_lang['menu_err_ns'] = 'Пункт меню не указан!';
$_lang['menu_err_remove'] = 'Произошла ошибка при попытке удалить пункт из меню.';
$_lang['menu_err_save'] = 'Произошла ошибка при попытке добавить пункт в меню.';
$_lang['menu_parent'] = 'Родительский пункт меню';
$_lang['menu_parent_err_ns'] = 'Родительский пункт меню не указан!';
$_lang['menu_parent_err_nf'] = 'Родительский пункт меню не найден!';
$_lang['menu_remove'] = 'Удалить';
$_lang['menu_top'] = 'Верхнее меню';
$_lang['menu_update'] = 'Редактировать';
$_lang['menus'] = 'Меню';
$_lang['namespace'] = 'Пространство имен';
$_lang['namespace_desc'] = 'Пространство имен, на котором основан этот пункт меню. Позволит определить путь для контроллера, который загрузится.';
$_lang['parameters'] = 'Параметры';
$_lang['parameters_desc'] = 'Любые параметры запроса, которые вы хотите добавить к конечному URL вызывая это меню. (Прим.: &expire=1)';
$_lang['permissions'] = 'Права';
$_lang['permissions_desc'] = 'Ключ прав доступа, необходимых для загрузки этого пункта меню.';
$_lang['topmenu'] = 'Верхнее меню';
$_lang['topmenu_desc'] = 'Здесь вы можете связать «действия» с пунктами верхнего меню бэкэнда. ';
