<?php
$_lang['namespace'] = 'Пространство имён';
$_lang['namespace_create'] = 'Создать пространство имён';
$_lang['namespace_err_create'] = 'Произошла ошибка при попытке создания пространства имён.';
$_lang['namespace_err_nf'] = 'Пространство имён не найдено.';
$_lang['namespace_err_nfs'] = 'Не найдено пространство имён: %s';
$_lang['namespace_err_ns'] = 'Пространство имён не указано.';
$_lang['namespace_err_remove'] = 'Произошла ошибка при попытке удалить пространство имён.';
$_lang['namespace_err_save'] = 'Произошла ошибка при попытке сохранения пространства имён.';
$_lang['namespace_path_desc'] = 'Укажите здесь абсолютный путь: (например: MODX_CORE_PATH . "assets/democomponent")';
$_lang['namespace_remove'] = 'Удалить пространство имён';
$_lang['namespace_remove_confirm'] = 'Вы уверены, что хотите удалить это пространство имён и весь относящийся к нему контент?';
$_lang['namespace_update'] = 'Обновить пространство имён';
$_lang['namespaces'] = 'Пространства имён';
$_lang['namespaces_desc'] = 'Пространства имён это общии идентификаторы для пакетов и компонентов,которые обьединяют вместе транспортные средства,записи словарей и ресурсы.';
