<?php
/**
 * Access Policy English lexicon topic
 *
 * @language en
 * @package modx
 * @subpackage lexicon
 */
$_lang['active_of'] = '[[+active]] из [[+total]]';
$_lang['active_permissions'] = 'Активные разрешения';
$_lang['no_policy_option'] = ' (нет политики) ';
$_lang['permission'] = 'Привилегии';
$_lang['permission_add'] = 'Добавить разрешение';
$_lang['permission_add_template'] = 'Добавить разрешение';
$_lang['permission_err_ae'] = 'Для этой политики уже существует разрешение.';
$_lang['permission_err_nf'] = 'Разрешение не найдено.';
$_lang['permission_err_ns'] = 'Разрешение не указано.';
$_lang['permission_err_remove'] = 'При удалении разрешения возникла ошибка.';
$_lang['permission_err_save'] = 'При сохранении разрешения возникла ошибка.';
$_lang['permission_new'] = 'Новое разрешение';
$_lang['permission_remove'] = 'Удалить разрешение';
$_lang['permission_remove_confirm'] = 'Вы уверены, что хотите удалить это разрешение?';
$_lang['permission_update'] = 'Редактировать разрешение';
$_lang['permissions'] = 'Права доступа';
$_lang['permissions_desc'] = 'Здесь вы можете определить разрешения, которые будет входить в политику доступа. Все группы пользователей с этой политикой будут наследовать её разрешения.';
$_lang['policies'] = 'Политики доступа';
$_lang['policy'] = 'Политика доступа';
$_lang['policy_create'] = 'Создать политику доступа';
$_lang['policy_data'] = 'Данные политики доступа';
$_lang['policy_desc'] = 'Политики доступа — это правила, ограничивающие или включающие определённые действия в MODX.';
$_lang['policy_desc_name'] = 'Название политики доступа';
$_lang['policy_desc_description'] = 'Необязательно. Краткое описание политики доступа';
$_lang['policy_desc_template'] = 'Шаблон политики используемый для этой политики. Политики получают список разрешений из своих шаблонов.';
$_lang['policy_desc_lexicon'] = 'Необязательно. Тема словаря которую использует политика для перевода разрешений.';
$_lang['policy_duplicate'] = 'Копировать политику';
$_lang['policy_duplicate_confirm'] = 'Вы уверены, что хотите копировать эту политику доступа вместе со всеми её данными?';
$_lang['policy_err_ae'] = 'Уже существует политика доступа с названием «[[+name]]». Пожалуйста, укажите другое название.';
$_lang['policy_err_nf'] = 'Политика не найдена.';
$_lang['policy_err_ns'] = 'Политика не указана.';
$_lang['policy_err_remove'] = 'Произошла ошибка при попытке удаления Политики.';
$_lang['policy_err_save'] = 'Произошла ошибка при попытке сохранить политику.';
$_lang['policy_export'] = 'Экспортировать политику';
$_lang['policy_import'] = 'Импортировать политику';
$_lang['policy_import_msg'] = 'Укажите XML-файл для импорта политики доступа. Файл должен быть корректным XML файлом формата политики доступа.';
$_lang['policy_management'] = 'Политики доступа';
$_lang['policy_management_msg'] = 'Политики доступа управляют тем, как MODX распределяет разрешения для различных действий.';
$_lang['policy_name'] = 'Название политики доступа';
$_lang['policy_property_create'] = 'Создать свойство политики доступа';
$_lang['policy_property_new'] = 'Новое свойство политики доступа';
$_lang['policy_property_remove'] = 'Удалить Свойство Политики доступа';
$_lang['policy_property_specify_name'] = 'Пожалуйста, укажите название Свойства Политики доступа:';
$_lang['policy_remove'] = 'Удалить политику';
$_lang['policy_remove_confirm'] = 'Вы уверены, что хотите удалить Политику доступа?';
$_lang['policy_remove_multiple'] = 'Удалить Политики';
$_lang['policy_remove_multiple_confirm'] = 'Вы уверены, что хотите удалить эти Политики доступа? Это необратимо.';
$_lang['policy_update'] = 'Редактировать политику';
$_lang['policy_template'] = 'Шаблон политики доступа';
$_lang['policy_template.desc'] = 'Шаблон Политики доступа определяет какие Разрешения будут показаны в таблице разрешений при редактировании Политики доступа, которой назначен этот Шаблон. Вы можете добавлять или удалять Разрешения на основе этого Шаблона. Обратите внимание, что удаление Разрешения из Шаблона будет также удалять его из любой Политики доступа, которая использует этот Шаблон.';
$_lang['policy_template_create'] = 'Создать шаблон политики доступа';
$_lang['policy_template_desc_name'] = 'Название шаблона политики доступа';
$_lang['policy_template_desc_description'] = 'Необязательно. Краткое описание шаблона политики доступа';
$_lang['policy_template_desc_lexicon'] = 'Необязательно. Тема словаря которую использует шаблон политики для перевода разрешений.';
$_lang['policy_template_desc_template_group'] = 'Группа Шаблонов Политик доступа. Используется при выборе Политики из выпадающего меню, как правило, они фильтруются по шаблону группы. Выберите соответствующую группу для Шаблона Политики.';
$_lang['policy_template_duplicate'] = 'Копировать шаблон политики доступа';
$_lang['policy_template_duplicate_confirm'] = 'Вы уверены, что хотите копировать этот Шаблон?';
$_lang['policy_template_err_ae'] = 'Уже существует шаблон политики доступа с названием «[[+name]]». Пожалуйста, укажите другое название.';
$_lang['policy_template_err_nf'] = 'Шаблон политики доступа не найден.';
$_lang['policy_template_err_ns'] = 'Шаблон политики доступа не указан.';
$_lang['policy_template_err_remove'] = 'Произошла ошибка при попытке удалить Шаблон Политики.';
$_lang['policy_template_err_save'] = 'Произошла ошибка при попытке сохранить Шаблон Политики.';
$_lang['policy_template_export'] = 'Экспортировать Шаблон Политики доступа';
$_lang['policy_template_import'] = 'Импортировать Шаблон Политики доступа';
$_lang['policy_template_import_msg'] = 'Укажите XML-файл для импорта Шаблона Политики доступа. Файл должен быть корректным XML-файлом формата Шаблона Политики.';
$_lang['policy_template_remove'] = 'Удалить Шаблон Политики доступа';
$_lang['policy_template_remove_confirm'] = 'Вы уверены, что хотите удалить Шаблон Политики доступа? Это удалит все Политики прикреплённые к настоящему Шаблону, а также — это может нарушить работу MODX, если какая-либо активная Политика прилагается к этому Шаблону.';
$_lang['policy_template_remove_multiple'] = 'Удалить выбранные Шаблоны Политик';
$_lang['policy_template_remove_multiple_confirm'] = 'Вы уверены, что хотите удалить эти Шаблоны Политик доступа? Это удалит все Политики использующие эти Шаблоны, а также — это может нарушить работу MODX, если какие-либо активные Политики используют этот Шаблон.';
$_lang['policy_template_update'] = 'Редактировать Шаблон Политики доступа';
$_lang['policy_templates'] = 'Шаблоны политик доступа';
$_lang['policy_templates.intro_msg'] = 'Это список Шаблонов Политик доступа. Шаблон Политики доступа состоит из списка Разрешений. Эти Разрешения могут быть включены или выключены во время редактирования Политики доступа.';
$_lang['template_group'] = 'Группа шаблонов';