<?php
/**
 * Template Russian lexicon topic
 *
 * @language ru
 * @package modx
 * @subpackage lexicon
 */
$_lang['access'] = 'Доступ';
$_lang['rank'] = 'Класс';
$_lang['template'] = 'Шаблон';
$_lang['template_assignedtv_tab'] = 'Назначенные дополнительные поля(TV)';
$_lang['template_code'] = 'Код шаблона (html)';
$_lang['template_desc'] = 'Описание';
$_lang['template_delete_confirm'] = 'Вы уверены, что хотите удалить этот шаблон?';
$_lang['template_duplicate_confirm'] = 'Вы уверены, что хотите сделать копию этого шаблона?';
$_lang['template_edit_tab'] = 'Редактировать шаблон';
$_lang['template_empty'] = '(пустой)';
$_lang['template_err_default_template'] = 'Этот шаблон установлен как шаблон по умолчанию. Пожалуйста выберите другой шаблон по умолчанию в конфигурации MODx перед удалением этого шаблона.<br />';
$_lang['template_err_delete'] = 'Произошла ошибка при удалении шаблона.';
$_lang['template_err_duplicate'] = 'Произошла ошибка при дублировании шаблона.';
$_lang['template_err_exists_name'] = 'Шаблон с таким именем уже существует.';
$_lang['template_err_in_use'] = 'Этот шаблон используется. Пожалуйста, установите ресурсам использующим этот шаблон другой шаблон. Ресурсы, использующие этот шаблон:<br />';
$_lang['template_err_locked'] = 'Шаблон заблокирован для редактирования.';
$_lang['template_err_nf'] = 'Шаблон не найден!';
$_lang['template_err_ns'] = 'Шаблон не указан.';
$_lang['template_err_ns_name'] = 'Пожалуйста, укажите имя для шаблона.';
$_lang['template_err_remove'] = 'Произошла ошибка при удалении шаблона.';
$_lang['template_err_save'] = 'Произошла ошибка при сохранении шаблона.';
$_lang['template_lock'] = 'Блокировка шаблона для редактирования';
$_lang['template_lock_msg'] = 'Пользователи должны иметь атрибут edit_locked для редактирования этого шаблона.';
$_lang['template_locked_message'] = 'Этот шаблон заблокирован.';
$_lang['template_management_msg'] = 'Здесь вы можете выбрать шаблон, который вы хотели бы редактировать.';
$_lang['template_msg'] = 'Создание и редактирование шаблонов. Измененные или новые шаблоны не будут видны на кэшированных страницах вашего сайта до тех пор, пока кэш не будет очищен, вы можете использовать функцию препросмотра страницы для того что бы просмотреть шаблон  в действии.';
$_lang['template_name'] = 'Имя шаблона';
$_lang['template_new'] = 'Новый шаблон';
$_lang['template_no_tv'] = '	Для этого шаблона ещё не назначены дополнительные поля (TV).';
$_lang['template_properties'] = 'Свойства по умолчанию';
$_lang['template_reset_all'] = 'Сброс шаблона всех страниц, устнановить шаблон по умолчанию';
$_lang['template_reset_specific'] = 'Сбросить только \'%s\' страницы';
$_lang['template_title'] = 'Создать/редактировать шаблон';
$_lang['template_tv_edit'] = 'Редактировать порядок дополнительных полей (TV)';
$_lang['template_tv_msg'] = 'Дополнительные поля назначенные шаблону перечислены ниже';
$_lang['template_untitled'] = 'Безымянный шаблон';
$_lang['templates'] = 'Шаблоны';
$_lang['tvt_err_nf'] = 'Дополнительное поле (TV) не имеет доступа к указанному шаблону.';
$_lang['tvt_err_remove'] = 'Произошла ошибка при попытке удалить дополнительное поле (TV) из шаблона.';
$_lang['tvt_err_save'] = 'Произошла ошибка при попытке назначить дополнительное поле (TV) шаблону.';
