<?php
/**
 * TV English lexicon topic
 *
 * @language en
 * @package modx
 * @subpackage lexicon
 */
$_lang['has_access'] = 'Доступно для редактирования?';
$_lang['filter_by_category'] = 'Фильтр по категории...';
$_lang['rank'] = 'Сортировка';
$_lang['rendering_options'] = 'Настройки отображения';
$_lang['tv'] = 'Дополнительное поле (TV)';
$_lang['tv_access_msg'] = 'Выберите группу ресурсов, к которой принадлежит дополнительное поле (TV). Только пользователи, имеющие доступ к этой группе, смогут изменять значение дополнительного поля (TV). Если группа не будет выбрана, то дополнительное поле (TV) смогут изменять все пользователи, имеющие доступ к панели управления.';
$_lang['tv_binding_msg'] = 'Это поле поддерживает привязку данных с использованием @-команд';
$_lang['tv_caption'] = 'Подпись';
$_lang['tv_change_template_msg'] = 'Изменение этого шаблона приведёт к перезагрузке дополнительных полей (TV) для страницы с потерей всех несохранённых изменений.<br /><br /> Вы уверены, что хотите изменить этот шаблон?';
$_lang['tv_delete_confirm'] = 'Вы уверены, что хотите удалить это дополнительное поле?';
$_lang['tv_desc_caption'] = 'Текст будет показан рядом с TV при редактировании ресурса.';
$_lang['tv_desc_category'] = 'Категория, к которой принадлежит этот TV.';
$_lang['tv_desc_description'] = 'Краткое описание TV.';
$_lang['tv_desc_name'] = 'Название TV. Будет доступно через тег [[*ИмяTV]].';
$_lang['tv_description'] = 'Описание';
$_lang['tv_err_delete'] = 'При удалении дополнительного поля произошла ошибка.';
$_lang['tv_err_duplicate'] = 'Произошла ошибка при попытке сделать копию дополнительного поля.';
$_lang['tv_err_duplicate_templates'] = 'Произошла ошибка при копировании TV шаблона.';
$_lang['tv_err_duplicate_documents'] = 'Произошла ошибка при копировании TV ресурса.';
$_lang['tv_err_duplicate_documentgroups'] = 'Произошла ошибка при копировании TV групп ресурсов.';
$_lang['tv_err_ae'] = 'Дополнительное поле (TV) с именем «[[+name]]» уже существует.';
$_lang['tv_err_invalid_name'] = 'Недопустимые символы в имени дополнительного поля (TV).';
$_lang['tv_err_locked'] = 'Дополнительное поле (TV) заблокировано!';
$_lang['tv_err_nf'] = 'Дополнительное поле (TV) не найдено.';
$_lang['tv_err_nfs'] = 'Не найдено дополнительных полей (TV) по запросу: [[+id]]';
$_lang['tv_err_ns'] = 'Дополнительное поле (TV) не указано.';
$_lang['tv_err_reserved_name'] = 'Дополнительное поле не может иметь такое же имя как у ресурса.';
$_lang['tv_err_save_access_permissions'] = 'Произошла ошибка при попытке сохранить права доступа для редактирования дополнительного поля.';
$_lang['tv_err_save'] = 'Произошла ошибка при сохранении дополнительного поля.';
$_lang['tv_inuse'] = 'Следующие ресурсы используют это дополнительное поле (TV). Для продолжения удаления нажмите кнопку «Удалить». Если вы передумали, то нажмите кнопку «Отмена».';
$_lang['tv_inuse_template'] = 'Следующий шаблон (или шаблоны) использует это дополнительное поле: [[+templates]].<br /><br />Пожалуйста, отвяжите дополнительное поле от шаблона (или шаблонов) перед его удалением.';
$_lang['tv_input_options'] = 'Параметры ввода';
$_lang['tv_input_options_msg'] = '<p>Здесь вы можете изменить параметры ввода для дополнительного поля (TV), характерные для типа ввода.</p>';
$_lang['tv_lock'] = 'Запретить редактирование дополнительного поля (TV)';
$_lang['tv_lock_msg'] = 'Пользователь должен иметь атрибут edit_locked, для того чтобы редактировать это дополнительное поле (TV).';
$_lang['tv_management_msg'] = 'Управление дополнительными полями (TV) содержимого для ваших документов.';
$_lang['tv_msg'] = 'Здесь вы можете создать или отредактировать дополнительное поле. Помните, дополнительное поле должно быть доступно для шаблонов, чтобы его можно было использовать в сниппетах и ресурсах.';
$_lang['tv_name'] = 'Имя дополнительного поля (TV)';
$_lang['tv_new'] = 'Новое дополнительное поле (TV)';
$_lang['tv_novars'] = 'Не найдено дополнительных полей (TV)';
$_lang['tv_output_options'] = 'Параметры вывода';
$_lang['tv_output_options_msg'] = '<p>Здесь вы можете изменить параметры вывода для дополнительного поля (TV), характерные для типа вывода, который вы выбрали.</p>';
$_lang['tv_properties'] = 'Параметры по умолчанию';
$_lang['tv_rank'] = 'Порядок сортировки';
$_lang['tv_reset_params'] = 'Сбросить параметры';
$_lang['tv_sources.intro_msg'] = 'Здесь вы можете назначить источник файлов, который будет использован этим TV в каждом указанном контексте. Для изменения источника дважды нажмите по его названию в таблице.';
$_lang['tv_tmpl_access'] = 'Доступно для шаблонов';
$_lang['tv_tmpl_access_msg'] = 'Выберите шаблоны для которых доступно это дополнительное поле.';
$_lang['tv_widget'] = 'Виджет';
$_lang['tv_widget_prop'] = 'Свойства компонента';
$_lang['tvd_err_remove'] = 'Произошла ошибка при удалении дополнительного поля из документа.';
$_lang['tvdg_err_remove'] = 'Произошла ошибка при удалении дополнительного поля из группы документов.';
$_lang['tvdg_err_save'] = 'Произошла ошибка при попытке прикрепить дополнительное поле к группе документов.';
$_lang['tvs'] = 'Дополнительные поля (TV)';
$_lang['tvt_err_nf'] = 'Дополнительное поле не имеет доступа к указанному шаблону.';
$_lang['tvt_err_remove'] = 'Произошла ошибка при попытке удаления дополнительного поля из шаблона.';
$_lang['tvt_err_save'] = 'Произошла ошибка при попытке прикрепить дополнительное поле к шаблону.';
