<?php
/**
 * English language files for Revolution 2.0.0 setup
 *
 * @package setup
 */
$_lang['additional_css'] = '';
$_lang['addons'] = 'Додатки';
$_lang['advanced_options'] = 'Розширені опції';
$_lang['all'] = 'Усі';
$_lang['app_description'] = 'CMS та PHP Application Framework';
$_lang['app_motto'] = 'MODX створуйте і робіть більше з LESS';
$_lang['back'] = 'Назад';
$_lang['btn_test'] = 'Перевірка';
$_lang['base_template'] = 'Базовий шаблон';
$_lang['cache_manager_err'] = 'Неможливо завантажити Кеш менеджер MODX';
$_lang['choose_language'] = 'Виберіть мову';
$_lang['all_languages'] = 'Всі мови';
$_lang['only_popular'] = 'Тільки популярні';
$_lang['cleanup_errors_title'] = 'Важливе зауваження:';
$_lang['cli_install_failed'] = 'Помилка інсталяції! Помилок: [[+errors]]';
$_lang['cli_no_config_file'] = 'MODX не вдалося знайти файл конфігурації (наприклад, config. XML) для CLI установки. Щоб запустити програму інсталяції MODX з командного рядка, необхідно надати конфігураційний файл xml. Читайте офіційну документацію для отримання додаткової інформації.';
$_lang['cli_tests_failed'] = 'Передустановочні тести не пройдені! Помилок: [[+errors]]';
$_lang['close'] = 'закрити';
$_lang['config_file_err_w'] = 'Помилка запису в конфігураційний файл.';
$_lang['config_file_perms_notset'] = 'Права доступу до файлу конфігурацій не були оновлені. Ви можете змінити дозволи на доступ конфігураційний файл для захисту файлів від несанкціонованого втручання.';
$_lang['config_file_perms_set'] = 'Права доступу до конфігураційного файлу успішно оновлено.';
$_lang['config_file_written'] = 'Конфігураційний файл був успішно записаний.';
$_lang['config_key'] = 'MODX конфігурації ключ';
$_lang['config_key_change'] = 'Якщо Ви бажаєте змінити ключ конфігурації MODX, <a id="cck-href" href="javascript:void(0);">будь ласка, натисніть тут.</a>';
$_lang['config_key_override'] = 'Якщо Ви хочете запустити установку з ключем конфігурації, відмінним від заданого за замовчуванням у вашому <pre>setup/includes/config.core.php</pre>, будь ласка, вкажіть його нижче.';
$_lang['config_not_writable_err'] = 'Здійснено спробу змінити налаштування в setup/includes/config.core.php, але файл не є записуваним. Зробіть файл відкритим для запису або відредагуйте файл вручну перед продовженням.';
$_lang['connection_character_set'] = 'Кодування символів підключення:';
$_lang['connection_collation'] = 'Співставлення:';
$_lang['connection_connection_and_login_information'] = 'Параметри підключення і авторизації для бази даних';
$_lang['connection_connection_note'] = 'Будь ласка, введіть наступні параметри для підключення до бази даних MODX. Якщо база даних ще не створена, програма встановлення спробує створити її для Вас. (Це може не вдатися, якщо конфігурація бази даних це забороняє або користувач не має відповідних прав.)';
$_lang['connection_database_host'] = 'Сервер бази даних:';
$_lang['connection_database_info'] = 'Тепер, будь ласка, введіть Логін дані для вашої бази даних.';
$_lang['connection_database_login'] = 'Ім\'я користувача бази даних:';
$_lang['connection_database_name'] = 'Ім\'я бази даних:';
$_lang['connection_database_pass'] = 'Пароль користувача бази даних:';
$_lang['connection_database_type'] = 'Тип бази даних:';
$_lang['connection_default_admin_email'] = 'Email адміністратора:';
$_lang['connection_default_admin_login'] = 'Ім\'я адміністратора:';
$_lang['connection_default_admin_note'] = 'Тепер Ви маєте вказати деякі дані головного облікового запису адміністратора сайту. Придумайте ім\'я користувача та пароль, які Ви не забудете - вони знадобляться для входу до панелі управління після завершення встановлення. Команда MODX не рекомендує використовувати "admin" в якості імені адміністратора.';
$_lang['connection_default_admin_password'] = 'Пароль адміністратора:';
$_lang['connection_default_admin_password_confirm'] = 'Підтвердження паролю:';
$_lang['connection_default_admin_user'] = 'Адміністратор за замовчуванням';
$_lang['connection_table_prefix'] = 'Префікс таблиць:';
$_lang['connection_test_connection'] = 'Перевірити з\'єднання';
$_lang['connection_title'] = 'Інформація про підключення';
$_lang['context_connector_options'] = '<strong>Налаштування конекторів</strong> (сервіс AJAX-конекторів)';
$_lang['context_connector_path'] = 'Шлях до конекторів контексту';
$_lang['context_connector_url'] = 'URL для конекторів контексту';
$_lang['context_installation'] = 'Встановлення контексту';
$_lang['context_manager_options'] = '<strong>Параметри контексту менеджера</strong> (інтерфейс панелі адміністрування)';
$_lang['context_manager_path'] = 'Шлях до контексту mgr';
$_lang['context_manager_url'] = 'URL для контексту mgr';
$_lang['context_override'] = 'Якщо Ви хочете змінити параметр, відмітьте прапорець навпроти нього і відредагуйте його значення у текстовому полі. Якщо прапорець навпроти параметру не відмічено, система використовуватиме автоматично визначені дані.';
$_lang['context_web_options'] = '<strong>Параметри контексту web</strong> (частина сайту, доступна зовнішнім користувачам)';
$_lang['context_web_path'] = 'Шлях до контексту web';
$_lang['context_web_url'] = 'URL для контексту web';
$_lang['continue'] = 'Далі';
$_lang['dau_err_save'] = 'Помилка при збереженні адміністратора за замовчуванням.';
$_lang['dau_saved'] = 'Створений обліковий запис адміністратора за замовчуванням.';
$_lang['db_check_db'] = 'Перевірка бази даних:';
$_lang['db_connecting'] = 'Підключення до серверу бази даних:';
$_lang['db_connected'] = 'З\'єднання з базою даних успішно встановлено!';
$_lang['db_created'] = 'База даних успішно створена.';
$_lang['db_err_connect'] = 'Не вдалося підключитися до бази даних.';
$_lang['db_err_connect_upgrade'] = 'Не вдалося підключитися до існуючої бази даних для оновлення. Перевірте параметри підключення і повторіть спробу.';
$_lang['db_err_connect_server'] = 'Не вдалося підключитися до серверу бази даних. Перевірте параметри підключення і повторіть спробу.';
$_lang['db_err_create'] = 'Помилка при спробі створення бази даних.';
$_lang['db_err_create_database'] = 'MODX не вдалося створити Вашу базу даних. Будь ласка, створіть базу даних власноруч і повторіть спробу.';
$_lang['db_err_show_charsets'] = 'MODX не вдалося отримати доступні набори символів від Вашого MySQL-серверу.';
$_lang['db_err_show_collations'] = 'MODX не вдалося отримати доступні співставлення Вашого MySQL-серверу.';
$_lang['db_success'] = 'Успішно!';
$_lang['db_test_coll_msg'] = 'Спробувати створити базу даних або зробити тестову вибірку.';
$_lang['db_test_conn_msg'] = 'Перевірити з\'єднання з сервером бази даних і відобразити список усіх доступних співставлень.';
$_lang['default_admin_user'] = 'Адміністратор за замовчуванням';
$_lang['delete_setup_dir'] = 'Виберіть цей пункт для того, щоб видалити каталог установки з Вашого серверу <strong>(рекомендується)</strong>.';
$_lang['dir'] = 'Зліва направо';
$_lang['email_err_ns'] = 'Адреса електронної пошти некоректна';
$_lang['err_occ'] = 'Errors have occurred!';
$_lang['err_update_table'] = 'Помилка оновлення таблиці для класу [[+class]]';
$_lang['errors_occurred'] = 'Сталися помилки під час встановлення ядра. Будь ласка, ознайомтеся з результатами встановлення нижче, усуньте проблеми та продовжіть згідно з вказівками.';
$_lang['failed'] = 'Помилка!';
$_lang['fatal_error'] = 'КРИТИЧНА ПОМИЛКА: Встановлення MODX не може бути продовжено.';
$_lang['home'] = 'Головна';
$_lang['congratulations'] = 'Вітаємо!';
$_lang['img_banner'] = 'assets/images/img_banner.gif';
$_lang['img_box'] = '';
$_lang['img_splash'] = '';
$_lang['install'] = 'Встановити';
$_lang['install_packages'] = 'Встановити пакунки';
$_lang['install_packages_desc'] = 'Ви можете обрати для встановлення окремі додаткові пакунки. Після встановлення усіх потрібних пакунків, натисніть "Готово" для закінчення встановлення.';
$_lang['install_packages_options'] = 'Параметри встановлення пакетів';
$_lang['install_success'] = 'Встановлення ядра пройшло успішно. Натисніть "Далі" для завершення встановлення.';
$_lang['install_summary'] = 'Звіт про встановлення';
$_lang['install_update'] = 'Встановлення/Оновлення';
$_lang['installation_finished'] = 'Встановлення завершено за [[+time]]';
$_lang['license'] = '<p class="title">Ви повинні погодитися з Ліцензією перед продовженням встановлення.</p>
<p>Використання цього програмного забезпечення підпадає під дію ліцензії GPL. Щоб допомогти вам зрозуміти, що таке ліцензія GPL і як вона впливає на ваше право користуватися програмою, ми надали наступне резюме:</p>
<h4>Загальна публічна ліцензія GNU — це ліцензія на вільне програмне забезпечення.</h4>
<p>Як і будь-яка ліцензія на вільне програмне забезпечення, вона надає вам чотири основні свободи:</p>
<ul>
    <li>Свобода запускати програму з будь-якою метою.</li>
    <li>Свобода вивчати, як працює програма, і адаптувати її до своїх потреб.</li>
    <li>Свобода розповсюджувати копії, щоб допомогти своєму ближньому.</li>
    <li>Свобода вдосконалювати програму та публікувати свої вдосконалення, щоб уся спільнота отримала користь.</li>
</ul>
<p>Ви можете користуватися вказаними свободами за умови дотримання вимог цієї ліцензії. Основні умови:</p>
<ul>
    <li>Ви повинні чітко й належним чином опублікувати на кожній копії, що розповсюджується, відповідне повідомлення про авторські права та відмову від гарантій, зберігши всі повідомлення, які стосуються цієї Ліцензії та відсутності будь-яких гарантій; а також надати іншим одержувачам програми копію Загальної публічної ліцензії GNU разом із програмою. Будь-який переклад Загальної публічної ліцензії GNU повинен супроводжуватися оригінальним текстом ліцензії.</li>

    <li>Якщо ви змінюєте свою копію (або копії) програми чи будь-яку її частину, або створюєте програму на її основі, ви можете поширювати отриманий продукт за умови дотримання Загальної публічної ліцензії GNU. Будь-який переклад Загальної публічної ліцензії GNU повинен супроводжуватися оригінальним текстом ліцензії.</li>

    <li>Якщо ви копіюєте або розповсюджуєте програму, ви повинні надати повний машинозчитуваний початковий код або письмову пропозицію (дійсну щонайменше три роки) надати повний машинозчитуваний початковий код.</li>

    <li>Будь-яку з цих умов може бути скасовано, якщо ви отримаєте дозвіл від правовласника.</li>

    <li>Ваше право на добросовісне використання та інші права жодним чином не обмежуються вищевикладеним.</li>
</ul>
<p>Вищенаведене є лише резюме Загальної публічної ліцензії GNU. Продовжуючи, ви погоджуєтесь із Загальною публічною ліцензією GNU, а не лише з її резюме. Вищевикладене є лише стислим оглядом ліцензії, і його точність не гарантується. Ми наполегливо рекомендуємо ознайомитися з повним текстом <a href="https://www.gnu.org/licenses/gpl-3.0.uk.html" onclick="window.open(this.href); return false;" onkeypress="window.open(this.href); return false;">Загальної публічної ліцензії GNU</a> перед продовженням, також її можна знайти у файлі ліцензії, що постачається з цим пакетом.</p>
';
$_lang['license_agree'] = 'Я погоджуюся з умовами ліцензійної угоди.';
$_lang['license_agreement'] = 'Ліцензійна угода';
$_lang['license_agreement_error'] = 'Для продовження встановлення Вам необхідно погодитися з умовами ліцензійної угоди.';
$_lang['locked'] = 'Налаштування MODX заблоковано!';
$_lang['locked_message'] = '<p>Щоб продовжити, вам потрібно видалити директорію setup/.locked/.</p>';
$_lang['login'] = 'Увійти';
$_lang['modx_class_err_nf'] = 'Не вдалося підключити файл класу MODX.';
$_lang['modx_configuration_file'] = 'Конфігураційний файл MODX';
$_lang['modx_err_instantiate'] = 'Не вдалося створити об\'єкт класу MODX.';
$_lang['modx_err_instantiate_mgr'] = 'Не вдалося ініціалізувати контекст менеджера MODX.';
$_lang['modx_footer1'] = '&copy; 2005-[[+current_year]] для <a href="https://modx.com/" onclick="window.open(this.href); return false;" onkeypress="window.open(this.href); return false;">MODX</a> Content Management Framework (CMF). Всі права захищені. MODX розповсюджується за ліцензією GNU GPL.';
$_lang['modx_footer2'] = 'MODX — це вільне програмне забезпечення. Ми заохочуємо вас бути креативними й використовувати MODX так, як вам зручно. Просто переконайтеся, що якщо ви внесете зміни й вирішите розповсюджувати змінену версію MODX, вихідний код залишиться відкритим!';
$_lang['modx_install'] = 'Встановлення MODX';
$_lang['modx_install_complete'] = 'Встановлення MODX завершено';
$_lang['modx_object_err'] = 'Неможливо завантажити об\'єкт MODX.';
$_lang['next'] = 'Далі';
$_lang['none'] = 'Не вказано';
$_lang['ok'] = 'Добре!';
$_lang['options_core_inplace'] = 'Файли вже розміщені<br /><small>(Рекомендовано для встановлення на віртуальних хостингах.)</small>';
$_lang['options_core_inplace_note'] = 'Позначте цей пункт, якщо Ви використовуєте MODX з Git або розархівували його з повного дистрибутиву MODX і розмістили файли на сервері до початку встановлення.';
$_lang['options_core_unpacked'] = 'Основний пакунок ядра системи був розархівований вручну<br /><small>(Рекомендовано для встановлення на віртуальних хостингах.)</small>';
$_lang['options_core_unpacked_note'] = 'Позначте це, якщо ви вручну розпакували основний пакет із файлу core/packages/core.transport.zip. Це скоротить час встановлення на системах, де неможливо змінити параметри PHP time_limit та час виконання скриптів Apache.';
$_lang['options_install_new_copy'] = 'Встановлення нової копії ';
$_lang['options_install_new_note'] = 'Зверніть увагу: ця опція може перезаписати будь-які дані у вашій базі даних.';
$_lang['options_important_upgrade'] = 'Важливе зауваження щодо оновлення';
$_lang['options_important_upgrade_note'] = 'Переконайтеся, що всі користувачі Менеджера <strong>вийшли із системи перед оновленням</strong>, щоб уникнути проблем (наприклад, неможливості доступу до ресурсів). Якщо після оновлення виникли труднощі, вийдіть із усіх сеансів Менеджера, очистьте кеш браузера, а потім увійдіть знову.';
$_lang['options_new_file_permissions'] = 'Права доступу нових файлів';
$_lang['options_new_file_permissions_note'] = 'Ви можете перепризначити права для нових файлів, створених системою MODX, наприклад, 0664 або 0666.';
$_lang['options_new_folder_permissions'] = 'Права доступу нових каталогів';
$_lang['options_new_folder_permissions_note'] = 'Ви можете перепризначити права для нових каталогів, створених системою MODX, наприклад, 0775 або 0777.';
$_lang['options_new_installation'] = 'Нове встановлення';
$_lang['options_nocompress'] = 'Вимкнути стиснення CSS/JS';
$_lang['options_nocompress_note'] = 'Виберіть, якщо менеджер на працює із включеним стисненням CSS/JS.';
$_lang['options_send_poweredby_header'] = 'Надсилати заголовок "X-Powered-By"';
$_lang['options_send_poweredby_header_note'] = 'Якщо увімкнено, MODX надсилатиме заголовок "X-Powered-By", щоб позначити сайт як створений на MODX. Це допомагає відстежувати глобальне використання MODX через сторонні трекери, які сканують ваш сайт. Оскільки це полегшує ідентифікацію технології, на якій побудований сайт, це може дещо підвищити ризик безпеки у разі виявлення вразливості в MODX.';
$_lang['options_title'] = 'Параметри встановлення';
$_lang['options_upgrade_advanced'] = 'Розширене оновлення<br /><small>(налаштування параметрів бази даних)</small>';
$_lang['options_upgrade_advanced_note'] = 'Для детального налаштування параметрів підключення до бази даних або при переході на сервер з іншим кодуванням бази даних. <strong>Вам потрібно знати повне ім\'я Вашої бази даних, ім\'я користувача, пароль та параметри співставлення.</strong>';
$_lang['options_upgrade_existing'] = 'Оновлення існуючої установки';
$_lang['options_upgrade_existing_note'] = 'Оновлення Ваших файлів і бази даних.';
$_lang['package_execute_err_retrieve'] = 'Встановлення не вдалося, оскільки MODX не зміг розпакувати пакет [[+path]]packages/core.transport.zip. Переконайтеся, що файл [[+path]]packages/core.transport.zip існує й доступний для запису, а також що каталог [[+path]]packages/ має права на запис.';
$_lang['package_err_install'] = 'Не вдалося встановити пакунок [[+package]].';
$_lang['package_err_nf'] = 'Не вдалося отримати інсталяцію пакету [[+package]].';
$_lang['package_installed'] = 'Успішно встановлено пакунок [[+package]].';
$_lang['password_err_invchars'] = 'Ваш пароль не повинен містити недопустимі символи, так як /, \\, &apos;, &quot;, (, ) або {}.';
$_lang['password_err_nomatch'] = 'Не відповідає паролю';
$_lang['password_err_ns'] = 'Пароль порожній';
$_lang['password_err_short'] = 'Ваш пароль повинен складатися принаймні з 6 символів.';
$_lang['please_select_login'] = 'Будь ласка, натисніть кнопку "Увійти" для того, щоб потрапити до панелІ управління сайтом.';
$_lang['preinstall_failure'] = 'Виявлено проблеми з попередніми встановленнями. Будь ласка, перегляньте результати попередніх тестів нижче, виправте проблеми, які спрямовані, а потім натисніть "Тест" знову.';
$_lang['preinstall_success'] = 'Передустановочні тести успішно пройдені. Натисніть "Встановити" для продовження.';
$_lang['refresh'] = 'Оновити';
$_lang['request_handler_err_nf'] = 'Не вдалося завантажити обробник запиту в [[+path]] Переконайся, що ви завантажили всі необхідні файли.';
$_lang['restarted_msg'] = 'MODX був змушений перезапустити процес налаштування як запобіжний засіб, оскільки налаштування бездіяльності мали існувати більше 15 хвилин. Будь ласка, повторно спробуйте запустити установку в даний час.';
$_lang['retry'] = 'Повторити';
$_lang['security_notice'] = 'Зауваження щодо безпеки';
$_lang['select'] = 'Вибрати';
$_lang['settings_handler_err_nf'] = 'MODX не може знайти клас modInstallSettings у: [[+path]]. Будь ласка, переконайтеся, що Ви завантажили всі файли.';
$_lang['setup_err_lock'] = 'Сталася помилка при спробі налаштування блокування. Не вдалося створити .locked підкаталог всередині папки налаштувань.';
$_lang['setup_err_remove'] = 'Сталася помилка під час спроби видалити директорію setup.';
$_lang['setup_err_assets'] = 'Каталог assets/ не було створено за адресою: [[+path]] <br />Вам потрібно створити цей каталог і надати йому права на запис, якщо ви хочете використовувати Менеджер пакетів або сторонні компоненти.';
$_lang['setup_err_assets_comp'] = 'Каталог assets/components/ не було створено за адресою: [[+path]] <br />Вам потрібно створити цей каталог і надати йому права на запис, якщо ви хочете використовувати Менеджер пакетів або сторонні компоненти.';
$_lang['setup_err_core_comp'] = 'Каталог core/components/ не був створений у: [[+path]] <br />Вам потрібно створити цей каталог власноруч і зробити його доступним для запису, якщо Ви хочете використовувати керування пакунками та додаткові компоненти.';
$_lang['skip_to_bottom'] = 'прокрутити вниз';
$_lang['step_welcome'] = 'Ласкаво просимо';
$_lang['step_options'] = 'Опції';
$_lang['step_connect'] = 'Підключення';
$_lang['step_test'] = 'Перевірка';
$_lang['step_contexts'] = 'Контексти';
$_lang['step_install'] = 'Встановити';
$_lang['step_complete'] = 'Завершено';
$_lang['modx_installer'] = 'Встановлення MODX';
$_lang['success'] = 'Успішно';
$_lang['table_created'] = 'Успішно створена таблиця для класу [[+class]]';
$_lang['table_err_create'] = 'Помилка при створенні таблиці для класу [[+class]]';
$_lang['table_updated'] = 'Таблиця для класу [[+class]] успішно оновлена';
$_lang['test_class_nf'] = 'Не вдалося знайти клас Install Test у: [[+path]]<br />Будь ласка, переконайтеся, що Ви завантажили усі необхідні файли.';
$_lang['test_version_class_nf'] = 'Не вдалося знайти клас Install Test Versioner у: [[+path]]<br />Будь ласка, переконайтеся, що Ви завантажили усі необхідні файли.';
$_lang['thank_installing'] = 'Дякуємо Вам за встановлення ';
$_lang['transport_class_err_load'] = 'Помилка при завантаженні транспортного класу.';
$_lang['toggle'] = 'Переключити';
$_lang['toggle_success'] = 'Показати повідомлення про успішне виконання';
$_lang['toggle_warnings'] = 'Показати попередження';
$_lang['upgrade_version_unsupported'] = 'Оновлення з MODX [[+version]] не підтримується цим релізом. Вам потрібно оновити до MODX 2.6 або пізніше перед оновленням до цього релізу.';
$_lang['username_err_invchars'] = 'Ваше ім\'я користувача не повинно містити недопустимі символи, такі як /, \\, &apos;, &quot;, або {}.';
$_lang['username_err_ns'] = 'Ім\'я користувача невірне';
$_lang['version'] = 'версія';
$_lang['warning'] = 'Попередження';
$_lang['welcome'] = 'Ласкаво просимо до програми встановлення MODX.';
$_lang['welcome_message'] = '<p>Ця програма проведе Вас через весь процес встановлення.</p>
	<p>Будь ласка, натисніть кнопку "Далі" для продовження:</p>
';
$_lang['workspace_err_nf'] = 'Не вдалося знайти активний робочий простір.';
$_lang['workspace_err_path'] = 'Помилка встановлення шляху активного робочого простору.';
$_lang['workspace_path_updated'] = 'Оновлено шлях активного робочого простору.';
$_lang['versioner_err_nf'] = 'Не вдалося знайти Install Versioner за адресою: [[+path]]<br />Будь ласка, переконайтеся, що ви завантажили всі необхідні файли.';
$_lang['xpdo_err_ins'] = 'Не вдалося створити екземпляр xPDO.';
$_lang['xpdo_err_nf'] = 'MODX не вдалося знайти клас xPDO у: [[+path]]. Будь ласка, переконайтеся, що він був завантажений правильно.';

$_lang['preload_err_cache'] = 'Переконайтеся, що [[+path]] cache каталог існує і доступний для запису процесу PHP. ';
$_lang['preload_err_core_path'] = 'Переконайтеся, що у файлі setup/includes/config.core.php правильно визначен MODX_CORE_PATH. Вон повинен вказувати на ядро MODX.';
$_lang['preload_err_mysql'] = 'Для роботи без використання вбудованого PDO, MODX вимагає розширення mysql для PHP, але воно, схоже, не завантажене.';
$_lang['preload_err_pdo'] = 'MODX вимагає розширення PDO при використанні вбудованого PDO, але, схоже, воно не завантажене.';
$_lang['preload_err_pdo_mysql'] = 'MODX вимагає драйвер pdo_mysql при використанні вбудованого PDO, але, схоже, він не завантажений.';

$_lang['test_config_file'] = 'Перевірка існування і можливості запису до <span class="mono">[[+file]]</span>: ';
$_lang['test_config_file_nw'] = 'Для нових встановлень на Linux/Unix, будь ласка, створіть порожній файл з назвою <span class="mono">[[+file]].inc.php</span> у каталозі <span class="mono">core/config/</span> вашої інсталяції MODX і встановіть для нього права доступу, щоб PHP мав можливість запису.';
$_lang['test_db_check'] = 'Створення підключення до бази даних: ';
$_lang['test_db_check_conn'] = 'Перевірте параметри підключення і повторіть спробу.';
$_lang['test_db_failed'] = 'Не вдалося встановити з\'єднання з базою даних!';
$_lang['test_db_setup_create'] = 'Буде зроблена спроба створити базу даних. ';
$_lang['test_dependencies'] = 'Перевірка PHP-розширення zlib: ';
$_lang['test_dependencies_fail_zlib'] = 'У вашій інсталяції PHP не встановлено розширення "zlib". Це розширення необхідне для роботи MODX. Будь ласка, увімкніть його, щоб продовжити.';
$_lang['test_directory_exists'] = 'Перевірка існування каталогу <span class="mono">[[+dir]]</span>: ';
$_lang['test_directory_writable'] = 'Перевірка можливості запису до каталога <span class="mono">[[+dir]]</span> : ';
$_lang['test_memory_limit'] = 'Перевірка виділеної пам\'яті (повинно бути не менше 24М): ';
$_lang['test_memory_limit_fail'] = 'MODX виявив, що значення параметра memory_limit нижче за рекомендоване — 24M. MODX спробував встановити memory_limit на рівні 24M, але це не вдалося. Будь ласка, встановіть значення memory_limit у файлі php.ini на 24M або більше перед тим, як продовжити.';
$_lang['test_php_version_fail'] = 'Ви використовуєте PHP [[+version]], а MODX Revolution потребує PHP 4.3.0 або вище';
$_lang['test_php_version_sn'] = 'Хоча MODX може працювати на вашій версії PHP ([[+version]]), використання MODX на цій версії не рекомендується. Ваша версія PHP має численні вразливості в системі безпеки. Будь ласка, оновіть PHP до версії 4.3.11 або новішої, у якій ці вразливості виправлено. Рекомендується оновити PHP задля безпеки вашого вебсайту.';
$_lang['test_php_version_start'] = 'Перевірка версії PHP:';
$_lang['test_session_gc'] = 'Checking if <a href="https://www.php.net/manual/en/session.configuration.php#ini.session.gc-probability" onclick="window.open(this.href); return false;" onkeypress="window.open(this.href); return false;">sessions garbage collector</a> are properly configured: ';
$_lang['test_session_gc_fail'] = 'The sessions garbage collector does not start! The current configuration "session.gc_probability" is set to [[+gc_probability]] and "session.gc_divisor" is set to [[+gc_divisor]]. <br>By default, MODX stores sessions in the database, so misconfiguration of these options can cause the session table to grow in size.';
$_lang['test_session_gc_success'] = 'OK! The current configuration "session.gc_probability" is set to [[+gc_probability]] and "session.gc_divisor" is set to [[+gc_divisor]]. <br>By default, MODX stores sessions in the database, so misconfiguration of these options can cause the session table to grow in size.';
$_lang['test_table_prefix'] = 'Перевірка префіксу таблиць `[[+prefix]]`: ';
$_lang['test_table_prefix_inuse'] = 'Префікс таблиць вже використовується в цій базі даних!';
$_lang['test_table_prefix_inuse_desc'] = 'Встановлення не може бути виконане в обрану базу даних, оскільки вона вже містить таблиці з указаним вами префіксом. Будь ласка, виберіть новий префікс таблиць (table_prefix) і запустіть встановлення знову.';
$_lang['test_table_prefix_nf'] = 'У базі даних немає такого префіксу!';
$_lang['test_table_prefix_nf_desc'] = 'Встановлення не може бути виконане в обрану базу даних, оскільки вона не містить існуючих таблиць із указаним вами префіксом для оновлення. Будь ласка, виберіть існуючий префікс таблиць (table_prefix) і запустіть встановлення знову.';
$_lang['test_zip_memory_limit'] = 'Перевірка виділеної пам\'яті для zip-розширень (повинно бути не менше 24М): ';
$_lang['test_zip_memory_limit_fail'] = 'MODX виявив, що значення параметра memory_limit нижче за рекомендоване — 24M. MODX спробував встановити memory_limit на рівні 24M, але це не вдалося. Будь ласка, встановіть значення memory_limit у файлі php.ini на 24M або більше перед продовженням, щоб розширення zip працювали коректно.';
