<?php
/**
 * TV Thai lexicon topic
 *
 * @language th
 * @package modx
 * @subpackage lexicon
  
 * @author Mr.Kittipong Intaboot COE#18,KKU
 * @updated 2010-07-21
 */
$_lang['has_access'] = 'มีการเข้าถึงแม่แบบ?';
$_lang['rank'] = 'อันดับ';
$_lang['rendering_options'] = 'ตัวเลือกการแสดง';
$_lang['tv'] = 'ตัวแปรแม่แบบ';
$_lang['tv_access_msg'] = 'เลือกกลุ่มรีซอร์สที่จะให้ตัวแปรแม่แบบนี้สังกัดอยู่ เฉพาะผู้ใช้ที่สามารถเข้าถึงกลุ่มที่เลือกเท่านั้นถึงจะสามารถแก้ไขตัวแปรแม่แบบนี้ได้ ถ้าไม่ได้เลือกกลุ่มใดเลย ผู้ใช้ทั้งหมดที่เข้าถึงเมเนเจอร์ได้จะสามารถแก้ไขตัวแปรแม่แบบได้';
$_lang['tv_binding_msg'] = 'ฟิลด์นี้รองรับการไบนด์ดิ้งข้อมูลด้วยการใช้คำสั่ง @';
$_lang['tv_caption'] = 'หัวข้อ';
$_lang['tv_change_template_msg'] = 'การเปลี่ยนแม่แบบนี้อาจเป็นสาเหตุให้มีการบรรจุตัวแปรแม่แบบใหม่ ทำให้สูญเสียการปรับเปลี่ยนใดๆ ที่ยังไม่ได้บันทึก<br /><br /> คุณแน่ใจว่าต้องการเปลี่ยนแม่แบบนี้?';
$_lang['tv_description'] = 'คำอธิบาย';
$_lang['tv_err_delete'] = 'เกิดข้อผิดพลาดขณะกำลังลบตัวแปรแม่แบบ';
$_lang['tv_err_duplicate_error'] = 'เกิดข้อผิดพลาดขณะที่พยายามทำสำเนาตัวแปรแม่แบบ';
$_lang['tv_err_duplicate_templates'] = 'เกิดข้อผิดพลาดขณะกำลังทำสำเนาตัวแปรแม่แบบ';
$_lang['tv_err_duplicate_documents'] = 'เกิดข้อผิดพลาดขณะกำลังทำสำเนาเอกสารตัวแปรแม่แบบ';
$_lang['tv_err_duplicate_documentgroups'] = 'เกิดข้อผิดพลาดขณะกำลังทำสำเนากลุ่มเอกสารตัวแปรแม่แบบ';
$_lang['tv_err_exists_name'] = 'ชื่อตัวแปรแม่แบบนี้มีอญุ่แล้ว';
$_lang['tv_err_invalid_name'] = 'คุณมีตัวอักษรที่ไม่ถูกต้องในชื่อของตัวแปรแม่แบบ';
$_lang['tv_err_locked'] = 'ป้องกันตัวแปรแม่แบบ!';
$_lang['tv_err_nf'] = 'ไม่พบตัวแปรแม่แบบ';
$_lang['tv_err_nfs'] = 'ไม่พบตัวแปรแม่แบบที่มีคีย์: [[+id]]';
$_lang['tv_err_ns'] = 'ไม่ระบุตัวแปรแม่แบบ';
$_lang['tv_err_reserved_name'] = 'ตัวแปรแม่แบบไม่สามารถมีชื่อเดียวกันกับรีซอร์สฟิลด์ได้';
$_lang['tv_err_save_access_permissions'] = 'เกิดข้อผิดพลาดขณะที่พยายามบันทึกสิทธิ์การเข้าถึงตัวแปรแม่แบบ';
$_lang['tv_err_save'] = 'เกิดข้อผิดพลาดขณะกำลังบันทึกตัวแปรแม่แบบ';
$_lang['tv_inuse'] = 'เอกสารดังต่อไปนี้กำลังใช้งานตัวแปรแม่แบบนี้ เพื่อทำการลบต่อ คลิ๊กที่ปุ่มลบ หากเปลี่ยนใจคลิ๊กปุ่มยกเลิก';
$_lang['tv_lock'] = 'ป้องกันการแก้ไข';
$_lang['tv_lock_msg'] = 'ผู้ใช้ต้องมีคุณสมบัติ edit_locked เพื่อจะแก้ไขตัวแปรแม่แบบนี้';
$_lang['tv_management_msg'] = 'จัดการเนื้อหาด้านอื่นๆ เพิ่มเติม (ตัวแปรแม่แบบ) สำหรับเอกสารของคุณ';
$_lang['tv_msg'] = 'เพิ่มหรือแก้ไขตัวแปรแม่แบบที่นี่ ตัวแปรแม่แบบต้องถูกกำหนดแม่แบบเพื่อการเข้าถึงพวกมันจากเหล่าสนิปเพตและเอกสาร';
$_lang['tv_name'] = 'ชื่อตัวแปร';
$_lang['tv_new'] = 'สร้างตัวแปรแม่แบบใหม่';
$_lang['tv_novars'] = 'ไม่พบตัวแปรแม่แบบ';
$_lang['tv_properties'] = 'คุณสมบัติปริยาย';
$_lang['tv_rank'] = 'ลำดับการจัดเรียง';
$_lang['tv_reset_params'] = 'ตั้งค่าพารามิเตอร์ใหม่';
$_lang['tv_tmpl_access'] = 'การเข้าถึงแม่แบบ';
$_lang['tv_tmpl_access_msg'] = 'เลือกแม่แบบที่อนุญาตให้สามารถเข้าถึงได้โดยตัวแปรแม่แบบนี้';
$_lang['tv_widget'] = 'วิดเก็ต';
$_lang['tv_widget_prop'] = 'คุณสมบัติวิดเก็ต';
$_lang['tvd_err_remove'] = 'เกิดข้อผิดพลาดขณะที่พยายามลบตัวแปรแม่แบบนี้จากเอกสาร';
$_lang['tvdg_err_remove'] = 'เกิดข้อผิดพลาดขณะที่พยายามลบตัวแปรแม่แบบจากกลุ่มเอกสาร';
$_lang['tvdg_err_save'] = 'เกิดข้อผิดพลาดขณะที่พยายามแนบตัวแปรแม่แบบใส่กลุ่มเอกสาร';
$_lang['tvs'] = 'ตัวแปรแม่แบบ';
$_lang['tvt_err_nf'] = 'ตัวแปรแม่แบบไม่มีการเข้าถึงแม่แบบที่ระบุ';
$_lang['tvt_err_remove'] = 'เกิดข้อผิดพลาดขณะที่พยายามลบตัวแปรแม่แบบจากแม่แบบ';
$_lang['tvt_err_save'] = 'เกิดข้อผิดพลาดขณะที่พยายามแนบตัวแปรแม่แบบในแม่แบบ';