<?php
/**
 * English language files for Revolution 2.0.0 setup
 *
 * @package setup
 */
$_lang['additional_css'] = '';
$_lang['addons'] = 'Добавки';
$_lang['advanced_options'] = 'Разширени настройки';
$_lang['all'] = 'Всички';
$_lang['app_description'] = 'CMS и PHP Application Framework';
$_lang['app_motto'] = 'MODX Създай и направи повече с по-малко';
$_lang['back'] = 'Back';
$_lang['base_template'] = 'Базов шаблон';
$_lang['cache_manager_err'] = 'MODX кеш мениджъра не може да бъде зареден.';
$_lang['choose_language'] = 'Избери език';
$_lang['cleanup_errors_title'] = 'Важна забележка:';
$_lang['cli_install_failed'] = 'Инсталирането е неуспешно! Грешки: [[+errors]]';
$_lang['cli_no_config_file'] = 'MODX не може да намери конфигурационен файл (като config.xml) за вашата CLI инсталация. За да изпълните инсталацията на MODX от командната линия, трябва да предоставите конфигурационния xml файл. За повече информация вижте официалната документация.';
$_lang['cli_tests_failed'] = 'Предварителните тестове за инсталиране са неуспешни! Грешки: [[+errors]]';
$_lang['close'] = 'затоври';
$_lang['config_file_err_w'] = 'Грешка при записване на конфигурационния файл.';
$_lang['config_file_perms_notset'] = 'Правомощията в конфигурационния файл не са актуализирани. Може да искате да промените разрешенията за конфигурационния файл, за да подсигурите файла от подправяне.';
$_lang['config_file_perms_set'] = 'Правомощията за конфигурационния файл са актуализирани усшено.';
$_lang['config_file_written'] = 'Конфигурационния файл е успешно записан.';
$_lang['config_key'] = 'MODX конфигурационен ключ';
$_lang['config_key_change'] = 'Ако искате да проемните конфигурационния ключ на MODX, <a id="cck-href" href="javascript:void(0);">моля кликнете тук.</a>';
$_lang['config_key_override'] = 'Ако желаете да изпълните инсталацията на конфигурационния ключ не в зададения setup/includes/config.core.php, моля уточнете по-долу.';
$_lang['config_not_writable_err'] = 'Опитахте се да промените настройките в setup/includes/config.core.php, но файла не е записваем. Направете файла достъпен за запис или го редактирайте ръчно преди да продължите.';
$_lang['connection_character_set'] = 'Набор връзки:';
$_lang['connection_collation'] = 'Сравнение:';
$_lang['connection_connection_and_login_information'] = 'База данни и входяща информация';
$_lang['connection_connection_note'] = 'Моля въведете следната информация, за да свържете вашата MODX база данни. Ако все още не съществува база данни, инсталатора ще се опита да я създаде за вас. (Това може да пропадне, ако конфигурацията ви за база данни или потребителските правомощия за нея не го позволяват.)';
$_lang['connection_database_host'] = 'База данни хост:';
$_lang['connection_database_info'] = 'Сега моля да въведете входните данни за вашата база данни.';
$_lang['connection_database_login'] = 'Име за вход в база данни:';
$_lang['connection_database_name'] = 'Име за базата данни:';
$_lang['connection_database_pass'] = 'Парола за базата данни:';
$_lang['connection_database_type'] = 'Тип на базата данни:';
$_lang['connection_default_admin_email'] = 'Администраторски имейл:';
$_lang['connection_default_admin_login'] = 'Потребителско име за администратор:';
$_lang['connection_default_admin_note'] = 'Сега ще трябва да въведете някои детайли за главния администраторски акаунт. Можете да попълните вашето собствено име тук и парола, която няма да забравите. Ще се нуждаете от тези данни, за да се логнете като админ, когато инсталацията приключи.';
$_lang['connection_default_admin_password'] = 'Парола за администратор:';
$_lang['connection_default_admin_password_confirm'] = 'Потвърдете паролата:';
$_lang['connection_default_admin_user'] = 'Администарторски потребител по подразбиране';
$_lang['connection_table_prefix'] = 'Таблица префикс:';
$_lang['connection_test_connection'] = 'Тест връзка';
$_lang['connection_title'] = 'Информация за връзката';
$_lang['context_connector_options'] = '<strong>Опции за конектори</strong> (AJAX конектор услуги)';
$_lang['context_connector_path'] = 'Системен файлов път за конектори';
$_lang['context_connector_url'] = 'URL за конектори';
$_lang['context_installation'] = 'Инсталация на контекст';
$_lang['context_manager_options'] = '<strong>Мениджър контекст опции</strong> (back-end администарторски интерфейс)';
$_lang['context_manager_path'] = 'Файлово системен път за mgr контекст';
$_lang['context_manager_url'] = 'URL за mgr контекст';
$_lang['context_override'] = 'Оставете това забранено, за да разрешите на системата автоматичнотода определи тази информация, както е показано. При разрешаване на определена стойност, независимо дали сте я задали ръчно, вие посочвате, че искате пътя изрично да бъде зададен  за тази стойност на конфигурацията.';
$_lang['context_web_options'] = '<strong>Опции за уеб контекст</strong> (front-end уеб сайт)';
$_lang['context_web_path'] = 'Системен път за уеб контекст';
$_lang['context_web_url'] = 'URL за уеб контекст';
$_lang['continue'] = 'Continue';
$_lang['dau_err_save'] = 'Грешка при записване на администраторския потребител по подразбиране.';
$_lang['dau_saved'] = 'Създаден администратор по подразбиране.';
$_lang['db_check_db'] = 'Проверка на базата данни:';
$_lang['db_connecting'] = 'Свързване към сървъра за базата данни:';
$_lang['db_connected'] = 'Успешна връзка с базата данни!';
$_lang['db_created'] = 'Успешно създадена база данни.';
$_lang['db_err_connect'] = 'Не може да се свърже с базата данни.';
$_lang['db_err_connect_upgrade'] = 'Не може да се свърже със съществуващата база данни за ъпгрейд. Проверете свойствата на връзката и пробвайте отново.';
$_lang['db_err_connect_server'] = 'Не може да се свърже към сървъра на базата данни. Проверете свойствата на връзката и опитайте отново.';
$_lang['db_err_create'] = 'Грешка при опита за създаване на база данни.';
$_lang['db_err_create_database'] = 'MODX не може да създаде вашата база данни. Моля създайте ръчно вашата база аднни и след това опитайте отново.';
$_lang['db_err_show_charsets'] = 'MODX не може да получи наличните символи от вашия MySQL сървър.';
$_lang['db_err_show_collations'] = 'MODX не може да получи наличните сравнения от вашия MySQL сървър.';
$_lang['db_success'] = 'Успешно!';
$_lang['db_test_coll_msg'] = 'Създайте или тествайте селекцията на вашата база данни.';
$_lang['db_test_conn_msg'] = 'Тествайте сървъра на базата данни и вижте сравненията.';
$_lang['default_admin_user'] = 'Администарторски потребител по подразбиране';
$_lang['delete_setup_dir'] = 'Отметнете това за да ИЗТРИЕТЕ инсталационната директория от файловата система.';
$_lang['dir'] = 'ltr';
$_lang['email_err_ns'] = 'Имейл адреса е невалиден';
$_lang['err_occ'] = 'Възникнали са грешки!';
$_lang['err_update_table'] = 'Грешка при актуализиране на таблица за клас [[+class]]';
$_lang['errors_occurred'] = 'Възникнаха грешки при инсталиране на ядрото. Моля прегелдайте резултатите от инсталацията долу, коригирайте проблемите и продължете напред.';
$_lang['failed'] = 'Неуспешно!';
$_lang['fatal_error'] = 'ФАТАЛНА ГРЕШКА: Инсталацията на MODX не може да продължи.';
$_lang['home'] = 'Начало';
$_lang['congratulations'] = 'Congratulations!';
$_lang['img_banner'] = 'assets/images/img_banner.gif';
$_lang['img_box'] = 'assets/images/img_box.png';
$_lang['img_splash'] = 'assets/images/img_splash.gif';
$_lang['install'] = 'Инсталирай';
$_lang['install_packages'] = 'Инсталационни пакети';
$_lang['install_packages_desc'] = 'Можете да изберете инсталиране на отделни допълнителни пакети. Веднъж щом инсталирате всички възможни пакети, които искате, натиснете Приключи, за да завършите процеса.';
$_lang['install_packages_options'] = 'Опции за инсталиране на пакет';
$_lang['install_success'] = 'Инсталацията на ядрото беше успешна. Наиснете Следващ за да продължите процеса на инсталиране.';
$_lang['install_summary'] = 'Обобщение на инсталацията';
$_lang['install_update'] = 'Инсталирай/Актуализирай';
$_lang['installation_finished'] = 'Инсталирането приключи за [[+time]]';
$_lang['license'] = '<p class="title">Трябва да приемете условията на Лиценза преди да преминете към инсталацията.</p>
    <p>Използването на този софтуер е обект на GPL лиценз. За да ви помогнем да разберете какво е GPL лиценз и как рефлектира на способността да използвате софтуера, ви предоставяме следното обобщение:</p>
    <h4>GNU General Public License (на български превеждан като „Общ публичен лиценз на ГНУ“) е лиценз за свободен софтуер.</h4>
    <p>Като всеки лиценз за свободен софтуер, той ти гарантира следните четири права (свободи):</p>
    <ul>
        <li>Свободата да ползваш програмата за всякакви цели. </li>
        <li>Свободата да изучаваш как работи програмата и да я адаптираш за свои нужди.. </li>
        <li>Свободата да разпространяваш копия. </li>
        <li>Свободата да подобряваш програмата и да споделяш подобренията си публично, така че цялото общесто да се възползва. </li>
    </ul>
    <p>Можете да упражнявате посочените тук права, при условие, че те отговарят на изричните условия на този лиценз. основните условия са:</p>
    <ul>
        <li>Трябва да публикувате видно и на подходящо място всяко копие, подходящо обозначено с авторските права и отказ от гаранции, и да запазите непокътнати всички уведомления, които се отнасят до този лиценз и до липсата на всякаква гаранция; и да предоставите на всеки един получател на програмата копие на GNU Общия Публичен Лиценз заедно със самата програма. Всеки превод на GNU Общ Публичен Лиценз трябва да бъде придружен от GNU General Public License.</li>

        <li>Ако промените вашето копие или копия на програмата или части от нея, или ако разработите програма базирана на нея, имате право да разпространявате получената разработка при условие, че е под GNU общ публичен лиценз. Всеки превод на GNU Общ Публичен Лиценз трябва да бъде придружен от GNU General Public License. </li>

        <li>Ако копирате или разпространявате програмата, трябва ад я придружавате с напълно четлив машинно читаем изходен код, или с писмено предложени, валидно за период най-малко 3 години, за да бъде осигурено пълното съответствие на машинно четим изходен код.</li>

        <li>Всяко от тези условия може да бъде отхвърлено, ако получите разрешение от притежателя на авторските права.</li>

        <li>Вашето честно използване и останалите права няма да бъдат засегнати по никакъв начин от горното.</li>
    </ul>
    <p>Горното е обобщение на GNU Общия Публичен Лиценз. При продължаване, вие се съгласявате с GNU Общия Публичен Лиценз, а не горното. Готният текст е просто обобщение на GNU Общия Публичен Лиценз и точността му не е гарантирана. Силно препоръчително преди да продължите е да прочетете пълния<a href="http://www.gnu.org/copyleft/gpl.html" onclick="window.open(this.href); return false;" onkeypress="window.open(this.href); return false;">GNU General Public
    License</a>, който може да бъде намерен в лицензионния файл, разпространяван с този пакет.</p>
';
$_lang['license_agree'] = 'Съгласен/на съм с условията изложени в този лиценз.';
$_lang['license_agreement'] = 'License Agreement';
$_lang['license_agreement_error'] = 'Трябва да приемете условията на лиценза преди да продължите инсталирането.';
$_lang['locked'] = 'MODX Setup is locked!';
$_lang['locked_message'] = '<p>You will need to remove the setup/.locked/ directory in order to proceed.</p>';
$_lang['login'] = 'Вход';
$_lang['modx_class_err_nf'] = 'Не може да включи MODX клас файла.';
$_lang['modx_configuration_file'] = 'MODX конфигурационен файл';
$_lang['modx_err_instantiate'] = 'Не може да инстанциира MODX клас.';
$_lang['modx_err_instantiate_mgr'] = 'Не може да се инициализира контекста на MODX мениджъра.';
$_lang['modx_footer1'] = '&copy; 2005-[[+current_year]] <a href="http://www.modx.com/" onclick="window.open(this.href); return false;" onkeypress="window.open(this.href); return false;">MODX</a> Content Management Framework (CMF) проект. Всички права запазени. MODX е лицензиран под GNU GPL.';
$_lang['modx_footer2'] = 'MODX е свободен софтуер. Съветваме ви да бъдете креативни и да направите използването на MODX по начина, по който го виждате. Просто се уверете, че ако правите промени и решите да редистрибутирате вашия променен MODX, ще оставите изходния код свободен!';
$_lang['modx_install'] = 'MODX инсталация';
$_lang['modx_install_complete'] = 'Инсталацията на MODX приключи';
$_lang['modx_object_err'] = 'MODX обекта не може да бъде зареден.';
$_lang['next'] = 'Следващ';
$_lang['none'] = 'Нищо';
$_lang['ok'] = 'ОК!';
$_lang['options_core_inplace'] = 'Файловете вече са на място<br /><small>(препоръчително при инсталиране на споделени сървъри.)</small>';
$_lang['options_core_inplace_note'] = 'Проверете това, ако използвате MODX от Git или сте го разархивирали от пълния MODX пакет на сървъра преди инсталирането.';
$_lang['options_core_unpacked'] = 'Основния пакет с ядрото на системата беше разархивиран ръчно<br /><small>(Препоръчително при инсталиране на споделени сървъри.)</small>';
$_lang['options_core_unpacked_note'] = 'Проверете дали сте разархивирали ръчно основния пакет с ядрото на системата core/packages/core.transport.zip. Това ще намали времето необходимо за инсталациония процес на системи, които не позволяват промяна в настройките на PHP time_limit и Apache скрипта.';
$_lang['options_install_new_copy'] = 'Инсталирай ново копие на ';
$_lang['options_install_new_note'] = 'Моля, обърнете внимание, че тази опция може да презапише всички данни във вашата база данни.';
$_lang['options_important_upgrade'] = 'Важна бележка за актуализацията';
$_lang['options_important_upgrade_note'] = 'Уверете се, че всички потребители <strong>са излезнали преди актуализацията</strong> за да бъдат избеганти проблеми (напр., няма възможност за достъп до ресурси). Ако имате проблеми след актуализацията, излезте от всички мениджър сесии, изчистете кеша на браузъра си и влезте отново.';
$_lang['options_new_file_permissions'] = 'Нови файлови разрешения';
$_lang['options_new_file_permissions_note'] = 'Може да презапишете разрешенията, които ще използват новите създадени чрез MODX файлове, напр., 0664 или 0666.';
$_lang['options_new_folder_permissions'] = 'Нови разрешения за папка';
$_lang['options_new_folder_permissions_note'] = 'Може да презапишете разрешенията, които ще използват новите създадени чрез MODX папки, напр., 0775 или 0777.';
$_lang['options_new_installation'] = 'Нова инсталация';
$_lang['options_nocompress'] = 'Забрани CSS/JS компресия';
$_lang['options_nocompress_note'] = 'Провери дали мениджъра работи с включена CSS/JS компресия.';
$_lang['options_send_poweredby_header'] = 'Send X-Powered-By Header';
$_lang['options_send_poweredby_header_note'] = 'When enabled, MODX will send the "X-Powered-By" header to identify this site as built on MODX. This helps tracking global MODX usage through third party trackers inspecting your site. Because this makes it easier to identify what your site is built with, it might pose a slightly increased security risk if a vulnerability is found in MODX.';
$_lang['options_title'] = 'Опции за инсталиране';
$_lang['options_upgrade_advanced'] = 'Разширена актуализирана инсталация<br /><small>(редактиране конфигурацията на базата данни)</small>';
$_lang['options_upgrade_advanced_note'] = 'За разширена настройка на базата данни или при преместване на сървърите с набора от базата данни от друга връзка.<strong> Трябва да знаете пълното име на базата данни, потребител, парола и детайли за връзката. </strong>';
$_lang['options_upgrade_existing'] = 'Надграждане на съществуваща инсталация';
$_lang['options_upgrade_existing_note'] = 'Актуализиране на текущите файлове и база данни.';
$_lang['package_execute_err_retrieve'] = 'Инсталирането е неуспешно, защото MODX не можа да разархивира [[+path]]packages/core.transport.zip пакета. Уверете се, че файла [[+path]]packages/core.transport.zip съществува и е записваем, и че директорията [[+path]]packages/ е записваема.';
$_lang['package_err_install'] = 'Не може да инсталира пакет [[+package]].';
$_lang['package_err_nf'] = 'Не е възможно да се извлече инсталационен пакет [[+package]].';
$_lang['package_installed'] = 'Успешно инсталиран пакет [[+package]].';
$_lang['password_err_invchars'] = 'Вашата парола не може да съдържа невалидни символи и знаци като /, \\, &apos;, &quot;, (, ) или {}.';
$_lang['password_err_nomatch'] = 'Паролата не съвпада';
$_lang['password_err_ns'] = 'Паролата е празна';
$_lang['password_err_short'] = 'Your password must be at least [[+length]] characters long.';
$_lang['please_select_login'] = 'Моля изберете бутона "Вход" за достъп до интерфейса за управление.';
$_lang['preinstall_failure'] = 'Бяха засечени проблеми. Моля проверете резултатите от предварителната тест инсталация по-долу, поправете проблемите както е указано и след това натиснете Тест отново.';
$_lang['preinstall_success'] = 'Теста за предарителна инсталация беше успешен. Натиснете Инсталирай, за да продължите.';
$_lang['refresh'] = 'Опресни';
$_lang['request_handler_err_nf'] = 'Не е възможно да зареди заявката в [[+path]] Уверете се, че сте качили всички необходими файлове.';
$_lang['restarted_msg'] = 'MODX трябва да рестартира процеса на инсталиране като защитна мярка, защото инсталирането беше в застой повече от 15 минути. Моля повторете опита за изпълнение на инсталацията.';
$_lang['retry'] = 'Опитай отново';
$_lang['security_notice'] = 'Известие за сигурност';
$_lang['select'] = 'Изберете';
$_lang['settings_handler_err_nf'] = 'MODX не може да намери класа modInstallSettings в: [[+path]]. моля, уверете се, че сте качили всички файлове.';
$_lang['setup_err_lock'] = 'An error occurred while trying lock setup. Could not create the .locked subdirectory inside the setup directory.';
$_lang['setup_err_remove'] = 'Възникна грешка при опита за премахване на инсталационната директория.';
$_lang['setup_err_assets'] = 'Вашата assets/ директория не беше създадена в: [[+path]] <br /> Ще трябва да създадете тази директория и да я направите достъпна за писане, ако искате да използвате пакета за управление или компоненти от 3-та страна.';
$_lang['setup_err_assets_comp'] = 'Директорията assets/components/ не беше създадена в: [[+path]] <br /> Ще трябва да създадете тази директория и да я направите достъпна за писане, ако искате да използвате пакета за управление или компоненти от 3-та страна.';
$_lang['setup_err_core_comp'] = 'Директорията core/components/ не беше създадена в: [[+path]] <br /> Ще трябва да създадете тази директория и да я направите достъпна за писане, ако искате да използвате пакета за управление или компоненти от 3-та страна.';
$_lang['skip_to_bottom'] = 'превъртете до долу';
$_lang['success'] = 'Успешно';
$_lang['table_created'] = 'успешно създадена таблица за клас [[+class]]';
$_lang['table_err_create'] = 'Грешка при създаването на таблица за клас [[+class]]';
$_lang['table_updated'] = 'Успешно актуализирана таблица за клас [[+class]]';
$_lang['test_class_nf'] = 'Не може да намери инсталационен тест клас в : [[+path]]<br />Моля, уверете се, че сте качили всички необходими файлове.';
$_lang['test_version_class_nf'] = 'Не може да намери инсталационен тест Versioner клас в : [[+path]]<br />Моля, уверете се, че сте качили всички необходими файлове.';
$_lang['thank_installing'] = 'Благодарим ви за инсталирането ';
$_lang['transport_class_err_load'] = 'Грешка при зареждане на транспорт клас.';
$_lang['toggle'] = 'Превключи';
$_lang['toggle_success'] = 'Превключи съобщение за успех';
$_lang['toggle_warnings'] = 'Превключи предупрежденията';
$_lang['username_err_invchars'] = 'Вашето потребителско име на може да съдържа невалидни символи като /, \\, &apos;, &quot;, или {}.';
$_lang['username_err_ns'] = 'Потребителското име е невалидно';
$_lang['version'] = 'версия';
$_lang['warning'] = 'Внимание';
$_lang['welcome'] = 'Добре дошли в инсталационната програма на MODX.';
$_lang['welcome_message'] = '<p>Тази програма ще ви напътства през останалата част от инсталацията.</p>
	<p>Моля изберете бутона `Следващ` за да продължите:</p>
';
$_lang['workspace_err_nf'] = 'Не може да намери активна работна област.';
$_lang['workspace_err_path'] = 'Грешка при настройване пътя на активната работна област.';
$_lang['workspace_path_updated'] = 'Актуализиране пътя на активната работна област.';
$_lang['versioner_err_nf'] = 'Не може да намери истационната Versioner в: [[+path]]<br />Моля, уверете се, че сте качили всички необходими файлове.';
$_lang['xpdo_err_ins'] = 'Не може да инстанцира xPDO.';
$_lang['xpdo_err_nf'] = 'MODX не може да намери xPDO клас в: [[+path]]. Моля, уверете се, че е качен успешно.';

$_lang['preload_err_cache'] = 'Уверете се, че вашаат [[+path]]кеш директория съществува и е възможна за записване от PHP процеса.';
$_lang['preload_err_core_path'] = 'Уверете се, че сте задали валидна MODX_CORE_PATH във вашия setup/includes/config.core.php файл; това трябва да сочи към работещо MODX ядро.';
$_lang['preload_err_mysql'] = 'MODX изисква mysql разширение при използването на PHP без нативен PDO и не изглежда да е било заредено.';
$_lang['preload_err_pdo'] = 'MODX изисква PDO разширение, когато се използва родителски (нативен) PDO и не е било заредено.';
$_lang['preload_err_pdo_mysql'] = 'MODX изисква pdo_mysql при използването на нативно PDO, което не изглежда да е заредено.';

$_lang['test_config_file'] = 'Проверяване дали <span class="mono">[[+file]]</span> съществува и е достъпен за запис: ';
$_lang['test_config_file_nw'] = 'За нови Linux/Unix инсталации, моля създайте празен файл с име <span class="mono">[[+file]].inc.php</span> във вашата MODX директория на системното ядро <span class="mono">config/</span> с настроени права за запис от PHP.';
$_lang['test_db_check'] = 'CrСъздаване на връзка с базата данни: ';
$_lang['test_db_check_conn'] = 'Проверете параметрите на връзката и опитайте отново.';
$_lang['test_db_failed'] = 'Връзката с базата данни пропадна!';
$_lang['test_db_setup_create'] = 'Инсталацията ще се опита да създаде база данни.';
$_lang['test_dependencies'] = 'Проверка на PHP за zlib зависимост: ';
$_lang['test_dependencies_fail_zlib'] = 'PHP инсталацията ви не разполага с инсталирано "zlib" разширение. Това разширение е необходимо за да тръгне MODX. Моля разрешете го, за да продължите.';
$_lang['test_directory_exists'] = 'Проверка дали директорията <span class="mono">[[+dir]]</span> съществува: ';
$_lang['test_directory_writable'] = 'Проверка дали директорията <span class="mono">[[+dir]]</span> е записваема: ';
$_lang['test_memory_limit'] = 'Проверка дали лимита на паметта е настроен поне на 24M: ';
$_lang['test_memory_limit_fail'] = 'MODX намери, че настройката на memory_limit е под препоръчителната от 24M. Опита на MODX да настрои memory_limit на 24M беше неуспешен. Моля задайте memory_limit настройката във вашия php.ini файл на 24M или повече преди да продължите.';
$_lang['test_php_version_fail'] = 'Използвате PHP [[+version]], а MODX Revolution изисква PHP 4.3.0 или по-нова';
$_lang['test_php_version_sn'] = 'Докато MODX ще работи на твоята PHP версия ([[+version]]), използването му (на MODX) с тази версия не е препоръчително. Вашата версия на PHP е уязвима за множество дупки по сигурността. Моля надградете до PHP версия 4.3.11 или по-нова, за да избегнете тези пропуски. Препоръчително е да ъпгрейднете до тази версия заради сигурността на вашия сайт.';
$_lang['test_php_version_start'] = 'Проверка на PHP версия:';
$_lang['test_sessions_start'] = 'Проверка дали сесиите са правилно конфигурирани:';
$_lang['test_table_prefix'] = 'Проверка на табличния префикс `[[+prefix]]`: ';
$_lang['test_table_prefix_inuse'] = 'Табличния префикс е готов за употреба в тази база данни!';
$_lang['test_table_prefix_inuse_desc'] = 'Инсталацията не може да се инсталира в съответната база данни, тъй като тя вече съдържа таблици със зададения от вас префикс. Моля, изберете нов table_prefix и пробвайте отново.';
$_lang['test_table_prefix_nf'] = 'В тази база данни не съществува табличен префикс!';
$_lang['test_table_prefix_nf_desc'] = 'Инсталацията не може да се инсталира в съответната база данни, тъй като не съдържа таблици със зададения за актуализиране префикс. Моля, изберете нов table_prefix и пробвайте отново.';
$_lang['test_zip_memory_limit'] = 'Проверка дали лимита на паметта е настроен на поне 24M за zip разширения: ';
$_lang['test_zip_memory_limit_fail'] = 'MODX намери, че настройката на memory_limit е под препоръчителната от 24M. Опита на MODX да настрои memory_limit на 24M беше неуспешен. Моля задайте memory_limit настройката във вашия php.ini файл на 24M или повече преди да продължите, така че zip разширенията да функционират правилно.';
