<?php
/**
 * English language strings for Dashboards
 *
 * @package modx
 * @subpackage lexicon
 * @language en
 */
$_lang['dashboard'] = 'Панель управління';
$_lang['dashboard_desc_name'] = 'Назва панелі.';
$_lang['dashboard_desc_description'] = 'Невеличкий опис панелі.';
$_lang['dashboard_desc_hide_trees'] = 'Якщо відмічено, деревовидні меню зліва при відображенні даної панелі на сторінці привітання будуть сховані.';
$_lang['dashboard_hide_trees'] = 'Сховати деревовидні меню зліва';
$_lang['dashboard_desc_customizable'] = 'Дозволити користувачам налаштовувати цю панель для своїх облікових записів: створювати, видаляти і змінювати положення або розмір віджетів.';
$_lang['dashboard_customizable'] = 'Настроюваний';
$_lang['dashboard_remove_confirm'] = 'Ви впевнені, що хочете видалити цю панель?';
$_lang['dashboard_remove_multiple_confirm'] = 'Ви впевнені, що хочете видалити вибрані панелі?';
$_lang['dashboard_err_ae_name'] = 'Панель з іменем  "[[+name]]" вже існує! Будь ласка, виберіть інше ім\'я.';
$_lang['dashboard_err_duplicate'] = 'Сталася помилка при спробі створення дублікату панелі.';
$_lang['dashboard_err_nf'] = 'Панель не знайдена.';
$_lang['dashboard_err_ns'] = 'Панель не вказана.';
$_lang['dashboard_err_ns_name'] = 'Будь ласка, вкажіть ім\'я віджета.';
$_lang['dashboard_err_remove'] = 'Сталася помилка при спробі видалення панелі.';
$_lang['dashboard_err_remove_default'] = 'Ви не можете видалити панель за замовчуванням!';
$_lang['dashboard_err_save'] = 'Сталася помилка при спробі збереження панелі.';
$_lang['dashboard_usergroup_add'] = 'Призначити панель групі користувачів';
$_lang['dashboard_usergroup_remove'] = 'Видалити панель з групи користувачів';
$_lang['dashboard_usergroup_remove_confirm'] = 'Ви впевнені, що хочете відновити панель за замовчуванням для цієї групи користувачів?';
$_lang['dashboard_usergroups.intro_msg'] = 'Список усіх груп користувачів, що використовують дану панель.';
$_lang['dashboard_widget_err_placed'] = 'Цей віджет вже розміщений у даній панелі!';
$_lang['dashboard_widgets.intro_msg'] = 'Керуйте віджетами в цій панелі. Ви можете перетягувати рядки в таблицю, щоб змінити їх порядок.<br><br>Будь ласка, зверніть увагу: якщо інформаційна панель налаштовується, ці налаштування будуть застосовуватися тільки до першого навантаження для кожного користувача. Тут вони зможуть створювати, видаляти і змінювати положення або розмір своїх віджетів. Доступ користувача до віджетів може бути обмежений, застосовуючи дозволи.';
$_lang['dashboards'] = 'Панелі';
$_lang['dashboards.intro_msg'] = 'Тут Ви можете керувати усіма доступними панелями даного менеджера MODX.';
$_lang['rank'] = 'Порядок';
$_lang['user_group_filter'] = 'За групою користувачів';
$_lang['widget'] = 'Віджет';
$_lang['widget_content'] = 'Вміст віджету';
$_lang['widget_err_ae_name'] = 'Віджет з іменем "[[+name]]" вже існує! Будь ласка, оберіть інше ім\'я.';
$_lang['widget_err_nf'] = 'Віджет не знайдений!';
$_lang['widget_err_ns'] = 'Віджет не вказаний!';
$_lang['widget_err_ns_name'] = 'Будь ласка, вкажіть ім\'я віджета.';
$_lang['widget_err_remove'] = 'Сталася помилка при спробі видалення віджету.';
$_lang['widget_err_save'] = 'Сталася помилка при спробі збереження віджету.';
$_lang['widget_file'] = 'Файл';
$_lang['widget_dashboards.intro_msg'] = 'Нижче наведений перелік усіх панелей, на яких розміщений даний віджет.';
$_lang['widget_dashboard_remove'] = 'Видалити віджет з панелі';
$_lang['widget_description_desc'] = 'Описання віджету або ключ словника з описанням віджету і того, що він робить.';
$_lang['widget_html'] = 'HTML';
$_lang['widget_lexicon_desc'] = 'Тема словника, яка завантажується з цим віджетом. Використовується для перекладу імені та описання чи будь-якого іншого тексту у віджеті.';
$_lang['widget_permission_desc'] = 'Цей дозвіл потрібно для додавання цього віджета на панель користувача.';
$_lang['widget_permission'] = 'Дозвіл';
$_lang['widget_name_desc'] = 'Назва або ключ запису словника з назвою віджету.';
$_lang['widget_add'] = 'Додати віджет';
$_lang['widget_add_desc'] = 'Будь ласка, виберіть віджет, щоб додати його до вашої панелі.';
$_lang['widget_add_success'] = 'Віджет був успішно доданий у вашу панель інструментів. Він буде завантажений після закриття цього вікна.';
$_lang['widget_remove_confirm'] = 'Ви впевнені, що хочете видалити цей віджет? Це незворотньо, і видалить віджет з усіх панелей.';
$_lang['widget_remove_multiple_confirm'] = 'Ви впевнені, що хочете видалити ці віджети? Це незворотньо, і видалить віджети з усіх панелей.';
$_lang['widget_namespace'] = 'Простір імен';
$_lang['widget_namespace_desc'] = 'Простір імен, який буде використовувати цей віджет. Корисно при використанні користувацьких шляхів.';
$_lang['widget_php'] = 'Вбудований PHP-віджет';
$_lang['widget_place'] = 'Додати віджет';
$_lang['widget_size'] = 'Розмір';
$_lang['widget_size_desc'] = 'Розмір віджету. Може бути від «чверті» до «повторення розміру».';
$_lang['widget_size_double'] = 'Подвійний розмір';
$_lang['widget_size_full'] = 'Повний розмір';
$_lang['widget_size_three_quarters'] = 'Три чверті';
$_lang['widget_size_two_third'] = 'Дві третини';
$_lang['widget_size_half'] = 'Половина';
$_lang['widget_size_one_third'] = 'Одна третина';
$_lang['widget_size_quarter'] = 'Чверть';
$_lang['widget_snippet'] = 'Сніпет';
$_lang['widget_type'] = 'Тип віджету';
$_lang['widget_type_desc'] = 'Віджети типу "Сніпет" - це сніпети MODX, результати роботи яких виводяться до віджету. Віджети типу "HTML"  просто виводять HTML. Віджети типу "Файл" завантажуються з php-файлу, шлях до якого вказаний у полі вмісту віджету; php-файл повинен повертати вміст або ім\'я нащадка класу modDashboardWidgetClass, якого треба завантажити. Віджети типу "Вбудований PHP-віджет" - це віджети, які виводять результат виконання коду PHP, що вказано у полі вмісту віджета.';
$_lang['widget_unplace'] = 'Видалити віджет з панелі';
$_lang['widgets'] = 'Віджети';
$_lang['widgets.intro_msg'] = 'Нижче наведений список усіх встановлених віджетів.';

$_lang['action_new_resource'] = 'Нова сторінка';
$_lang['action_new_resource_desc'] = 'Створіть нову сторінку для свого веб-сайту.';
$_lang['action_view_website'] = 'Переглянути веб-сайт';
$_lang['action_view_website_desc'] = 'Відкрийте ваш сайт в новому вікні.';
$_lang['action_advanced_search'] = 'Розширений пошук';
$_lang['action_advanced_search_desc'] = 'Розширений пошук через ваш сайт.';
$_lang['action_manage_users'] = 'Керування користувачами';
$_lang['action_manage_users_desc'] = 'Керуйте всім своїм сайтом і керуйте користувачами.';

$_lang['w_buttons'] = 'Кнопки';
$_lang['w_buttons_desc'] = 'Відображає набір кнопок з масиву, вказаного у властивостях.';
$_lang['w_updates'] = 'Оновлення';
$_lang['w_updates_desc'] = 'Перевіряє наявність доступних оновлень для ядра і доповнень для сайту.';
$_lang['w_configcheck'] = 'Перевірка конфігурації';
$_lang['w_configcheck_desc'] = 'Відображає результат перевірки конфігурації, що гарантує безпечність Вашої установки MODX.';
$_lang['w_newsfeed'] = 'Стрічка новин MODX';
$_lang['w_newsfeed_desc'] = 'Виводить стрічку новин MODX';
$_lang['w_recentlyeditedresources'] = 'Ресурси, що нещодавно редагувалися';
$_lang['w_recentlyeditedresources_desc'] = 'Відображає список ресурсів, які нещодавно редагувалися користувачем.';
$_lang['w_securityfeed'] = 'Стрічка сповіщень безпеки MODX';
$_lang['w_securityfeed_desc'] = 'Відображає стрічку сповіщень безпеки MODX';
$_lang['w_whosonline'] = 'Користувачі онлайн';
$_lang['w_whosonline_desc'] = 'Відображає список користувачів, що знаходяться зараз в онлайні.';
$_lang['w_view_all'] = 'Подивитись все';
$_lang['w_no_data'] = 'Немає даних для відображення';