<?php
/**
 * Export English lexicon topic
 *
 * @language en
 * @package modx
 * @subpackage lexicon
 */
$_lang['export_site_cacheable'] = 'Включити некешовані файли:';
$_lang['export_site_exporting_document'] = 'Експортується файл <strong>%s</strong> з <strong>%s</strong><br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<small><i>%s</i>, id %s</small><br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;';
$_lang['export_site_failed'] = '<span style="color:#990000">Невдача!</span>';
$_lang['export_site_html'] = 'Експортувати сайт до HTML';
$_lang['export_site_maxtime'] = 'Максимальний час експортування:';
$_lang['export_site_maxtime_message'] = 'Тут Ви можете вказати кількість секунд, впродовж яких MODX може експортувати сайт (налаштування PHP будуть перевизначені). Введіть 0 для необмеженого часу. Будь ласка, зверніть увагу на те, що встановлення 0 або дуже великого значення може порушити роботу Вашого сервера і не рекомендується.';
$_lang['export_site_message'] = '<p>Скориставшись цією функцією, Ви можете експортувати весь сайт до HTML-файлів. Але, будь ласка, враховуйте, що Ви втратите значну частину функцій MODX, таких як:</p><ul><li>Перегляди сторінок до експортованих файлів не будуть записані.</li><li>Інтерактивні сніпети НЕ працюватимуть у експортованих файлах</li><li>Лише звичайні документи будуть експортовані, web-посилання не експортуватимуться.</li><li>Процес експортування може зазнати невдачі, якщо Ваші документи містять сніпети, що надсилають заголовки перенаправлення (redirection headers).</li><li>В залежності від того, як Ви записували Ваші документи,  стилі та зображення, дизайн Вашого сайту може бути зіпсовано. Щоб виправити це, Вам потрібно зберегти/перемістити Ваші експортовані файли до того ж самого каталогу, у якому знаходиться головний файл MODX index.php.</li></ul><p>Будь ласка, заповніть форму і натиснуть "Експорт" для того, щоб розпочати процес експортування. Створені файли будуть збережені у вказаному Вами місці, з використанням, де це можливо, псевдонімів в якості імен файлів.  При експортуванні Вашого сайту краще встановити в налаштуванні "Дружні URL" значення "Так". В залежності від розміру Вашого сайту, експортування може зайняти деякий час.</p><p><em>Будь-які файли, що існують, будуть перезаписані новими, якщо їх імена збігатимуться!</em></p>';
$_lang['export_site_numberdocs'] = '<p><strong>Знайдено %s документів для експортування...</strong></p>';
$_lang['export_site_prefix'] = 'Префікс файлу:';
$_lang['export_site_start'] = 'Розпочати експорт';
$_lang['export_site_success'] = '<span style="color:#009900">Успішно!</span>';
$_lang['export_site_suffix'] = 'Суфікс файлу:';
$_lang['export_site_target_unwritable'] = 'Неможливо записати у каталог. Будь ласка, переконайтеся, що каталог доступний для запису і повторіть спробу.';
$_lang['export_site_time'] = 'Експортування завершено. Експортування зайняло %s секунд.';