<?php
/**
 * Lexicon English lexicon topic
 *
 * @language en
 * @package modx
 * @subpackage lexicon
 */
$_lang['duplicate'] = 'Дублювати';
$_lang['entry'] = 'Запис';
$_lang['entry_err_ae'] = 'Запис вже існує!';
$_lang['entry_err_nf'] = 'Запис не знайдено.';
$_lang['entry_err_ns'] = 'Запис не вказано.';
$_lang['entry_err_save'] = 'Сталася помилка під час спроби збереження запису словника.';
$_lang['entry_revert'] = 'Відновити запис словника';
$_lang['language'] = 'Мова';
$_lang['languages'] = 'Мови';
$_lang['last_modified'] = 'Остання зміна';
$_lang['lexicon'] = 'Словник';
$_lang['lexicon_export_desc'] = 'Тут ви можете вибрати тему словника для експорту у файл.';
$_lang['lexicon_topics'] = 'Теми словника';
$_lang['lexicon_topics_desc'] = 'Тут ви можете керувати темами Вашого словника.';
$_lang['lexicon_import_desc'] = 'Ви можете імпортувати файл для завантаження у певну тему словника даного простору імен. Ваш файл повинен містити $_lang асоціативний масив рядків, відповідний до аналогічних у файлах core/lexicon. Якщо така тема вже існує у даному просторі імен, вона буде перезаписана.';
$_lang['lexicon_import_err_ns'] = 'Файл теми словника не вказано.';
$_lang['lexicon_import_err_upload'] = 'Виникла помилка при спробі завантаження нового файлу теми словника. Перевірте Ваші права на веб-сервері, спробувавши завантажити файли до тимчасової директорії та впевніться, що файл, який Ви хочете завантажити, не містить помилок.';
$_lang['lexicon_management'] = 'Керування словниками';
$_lang['lexicon_management_desc'] = 'Тут ви можете керувати всіма записами словника в обраному просторі iмен та вiдповiдних темах. <B> Кожен запис словника буде доступна через плейсхолдер [[%name]] </ b>. <br /> Двічі натисніть на будь-який параметр запису, щоб змінити його. Щоб додати новий запис в словник або тему, просто створіть для нього файли теми в папці з ім\'ям відповідного простору імен. ';
$_lang['lexicon_rlfb_msg'] = 'Успішно відновлено [[+num]] рядків.';
$_lang['reload_from_base'] = 'Відновити всі записи Core';
$_lang['reload_success'] = 'Успішно перезавантажено [[+total]] рядків.';
$_lang['topic'] = 'Тема';
