<?php
/**
 * Login English lexicon topic
 *
 * @language en
 * @package modx
 * @subpackage lexicon
 */
$_lang['login_language'] = 'Мова';
$_lang['login_activation_key_err'] = 'Невірний код активації! Будь-ласка, перевірте листа з кодом активації для того щоб бути впевненим, що ви перейшли по вірному посиланню URL.';
$_lang['login_blocked_admin'] = 'Ваш доступ до системи заблоковано адміністратором.';
$_lang['login_blocked_error'] = 'Ви тимчасово заблоковані і не можете увійти в систему. Спробуйте зробити це пізніше.';
$_lang['login_blocked_ip'] = 'З данної IP адреси заборонено вхід до системи.';
$_lang['login_blocked_time'] = 'На данний час ви не можете зайти в систему. Спробуйти зробити це пізніше.';
$_lang['login_blocked_too_many_attempts'] = 'Вас було заблоковано системою через надмірну кількість невдалих спроб входу.';
$_lang['login_button'] = 'Увійти';
$_lang['login_cannot_locate_account'] = 'Ім’я користувача або пароль введені невірно. Перевірте, будь-ласка введені данні та спробуйте увійти знову.';
$_lang['login_copyright'] = '&copy; 2005-2015 by <a href="http://modx.com/about/" target="_blank">MODX, LLC</a>. MODX Revolution&trade; розповсюджується за ліцензією GPLv2 або більш пізньою версією данної ліцензії.';
$_lang['login_email_label'] = 'Електронна пошта облікового запису:';
$_lang['login_err_unknown'] = 'Виникла невідома помилка при спробі авторизуватися.';
$_lang['login_forget_your_login'] = 'Забули пароль?';
$_lang['login_hostname_error'] = 'Ваше ім’я хосту не відповідає зворотньо IP адресі.';
$_lang['login_message'] = 'Будь-ласка введіть ваші данні для входу в панель управління сайтом. Зверніть увагу, що ім’я користувача і пароль чутливі до регістру!';
$_lang['login_password'] = 'Пароль';
$_lang['login_password_reset_act_sent'] = 'Листа для скидання паролю- відправлено. Будь-ласка перевірте свою електронну пошту.';
$_lang['login_remember'] = 'Запам\'ятати мене';
$_lang['login_send_activation_email'] = 'Відправити листа для активації';
$_lang['login_title'] = 'Вхід у панель управління MODX CMF';
$_lang['login_user_err_nf_email'] = 'Користувача з такою електронною адресою або іменем не знайдено. Будь-ласка, спробуйте ще раз.';
$_lang['login_username'] = 'Ім\'я користувача';
$_lang['login_username_or_email'] = 'Ім’я користувача або Email';
$_lang['login_username_password_incorrect'] = 'Ім’я користувача або пароль введені невірно. Перевірте, будь-ласка введені данні та спробуйте увійти знову.';
$_lang['login_user_inactive'] = 'Ваш обліковий запис деактивовано. Будь ласка, зв\'яжіться з системним адміністартором, щоб активувати обліковий запис.';
