<?php
/**
 * Menu English lexicon topic
 *
 * @language en
 * @package modx
 * @subpackage lexicon
 */
$_lang['action'] = 'Дія';
$_lang['action_desc'] = 'Шлях до контролера для даного пункту меню. Шлях до контролера будується так: шлях простору імен + контролер + тема менеджера + дане значення. (Прикл.: user/update для простору імен core:  [core_namespace_path]controllers/[mgr_theme]/user/update.class.php)';
$_lang['description_desc'] = 'Текст або ключ словника, який буде використано при відображенні опису даної сторінки у меню.';
$_lang['handler'] = 'Обробник';
$_lang['handler_desc'] = '(Необов\'язково) Якщо вказано, при клацанні на пункті буде ігноруватись значення поля Дія, замість цього буде запущений JavaScript з даного поля.';
$_lang['icon'] = 'Іконка';
$_lang['icon_desc'] = 'Додаткова іконка або розмітка.';
$_lang['lexicon_key'] = 'Ключ словника';
$_lang['lexicon_key_desc'] = 'Текст або ключ словника, який буде використано при відображенні заголовку цієї сторінки у меню.';
$_lang['menu_confirm_remove'] = 'Ви впевнені, що хочете видалити меню: "[[+menu]]"?<br />ПРИМІТКА: всі вкладені меню також будуть видалені!';
$_lang['menu_err_ae'] = 'Пункт меню з цим іменем вже існує. Будь ласка, вкажіть інше ім\'я.';
$_lang['menu_err_nf'] = 'Пункт меню не знайдено!';
$_lang['menu_err_ns'] = 'Пункт меню не вказано!';
$_lang['menu_err_remove'] = 'Сталася помилка при спробі видалення пункту меню.';
$_lang['menu_err_save'] = 'Сталася помилка при спробі збереження пункту меню.';
$_lang['menu_parent'] = 'Батьківський пункт меню';
$_lang['menu_parent_err_ns'] = 'Батьківський пункт меню не вказаний!';
$_lang['menu_parent_err_nf'] = 'Батьківський пункт меню не знайдено!';
$_lang['menu_top'] = 'Головне меню';
$_lang['menus'] = 'Меню';
$_lang['namespace'] = 'Простір імен';
$_lang['namespace_desc'] = 'Простір імен, на якому базується даний пункт меню. Це значення визначає шлях до контролера, який треба завантажити.';
$_lang['parameters'] = 'Параметри';
$_lang['parameters_desc'] = 'Будь-які параметри запиту, які Ви бажаєте додати до посилання, коли клацаєте по ньому у меню (Прикл.: &expire=1)';
$_lang['permissions'] = 'Дозвіл';
$_lang['permissions_desc'] = 'Ключ дозволу, необхідний для завантаження цього пункту меню.';
$_lang['topmenu'] = 'Головне меню';
$_lang['topmenu_desc'] = 'Тут Ви можете пов\'язати "дії" з пунктами верхнього меню менеджеру MODX. Просто розташуйте пункти меню у тому порядку, в якому забажаєте.';
