<?php
/**
 * Access Policy English lexicon topic
 *
 * @language en
 * @package modx
 * @subpackage lexicon
 */
$_lang['active_of'] = '[[+active]] з [[+total]]';
$_lang['active_permissions'] = 'Активні дозволи';
$_lang['no_policy_option'] = ' (немає політики) ';
$_lang['permission'] = 'Дозвіл';
$_lang['permission_add'] = 'Додати дозвіл';
$_lang['permission_add_template'] = 'Додати дозвіл до шаблону';
$_lang['permission_err_ae'] = 'Для цієї політики вже існує дозвіл. ';
$_lang['permission_err_nf'] = 'Дозвіл не знайдено.';
$_lang['permission_err_ns'] = 'Дозвіл не вказаний.';
$_lang['permission_err_remove'] = 'Сталася помилка при спробі видалення цього дозволу.';
$_lang['permission_err_save'] = 'Сталася помилка при спробі збереження цього дозволу.';
$_lang['permission_new'] = 'Новий дозвіл';
$_lang['permission_remove'] = 'Видалити дозвіл';
$_lang['permission_remove_confirm'] = 'Ви впевнені, що хочете видалити цей дозвіл?';
$_lang['permission_update'] = 'Редагувати дозвіл';
$_lang['permissions'] = 'Дозволи';
$_lang['permissions_desc'] = 'Тут ви можете визначити дозволу, які буде входити в політику доступу. Всі групи користувачів з цією політикою наслідуватимуть її дозволу.';
$_lang['policies'] = 'Політики доступу';
$_lang['policy'] = 'Політика доступу';
$_lang['policy_create'] = 'Створити політику доступу';
$_lang['policy_data'] = 'Дані політики доступу';
$_lang['policy_desc'] = 'Політики доступу - це правила, що обмежують або включають певні дії в MODX. ';
$_lang['policy_desc_name'] = 'Ім\'я політики доступу';
$_lang['policy_desc_description'] = 'Не обов\'язково. Короткий опис Політики доступу';
$_lang['policy_desc_template'] = 'Шаблон Політики використовуваний для цієї Політики. Політики отримують список дозволів зі своїх шаблонів. ';
$_lang['policy_desc_lexicon'] = 'Не обов\'язково. Тема словника яку використовує Політика для перекладу Дозволів.';
$_lang['policy_duplicate'] = 'Дублювати політику';
$_lang['policy_duplicate_confirm'] = 'Ви впевнені, що хочете копіювати цю Політику доступу разом з усіма її даними? ';
$_lang['policy_err_ae'] = 'Вже існує Політика доступу з назвою «[[+name]]». Будь ласка, вкажіть іншу назву. ';
$_lang['policy_err_nf'] = 'Політика не знайдена.';
$_lang['policy_err_ns'] = 'Політика не вказана.';
$_lang['policy_err_remove'] = 'Сталася помилка під час спроби видалення Політики. ';
$_lang['policy_err_save'] = 'Сталася помилка під час спроби зберегти Політику. ';
$_lang['policy_export'] = 'Експортувати політику';
$_lang['policy_import'] = 'Імпортувати політику';
$_lang['policy_import_msg'] = 'Виберіть XML-файл для імпорту політики доступу. Він повинен мати коректний XML-формат політик доступу.';
$_lang['policy_management'] = 'Політики доступу';
$_lang['policy_management_msg'] = 'Політики доступу керують тим, як MODX розподіляє дозволу для різних дій. ';
$_lang['policy_name'] = 'Ім\'я політики';
$_lang['policy_property_create'] = 'Створити Властивість Політики доступу ';
$_lang['policy_property_new'] = 'Нове Властивість Політики доступу';
$_lang['policy_property_remove'] = 'Видалити Властивість Політики доступу ';
$_lang['policy_property_specify_name'] = 'Будь ласка, вкажіть назву Властивості Політики доступу: ';
$_lang['policy_remove'] = 'Видалити політику';
$_lang['policy_remove_confirm'] = 'Ви впевнені, що хочете видалити Політику доступу? ';
$_lang['policy_remove_multiple'] = 'видалити Політики';
$_lang['policy_remove_multiple_confirm'] = 'Ви впевнені, що хочете видалити ці Політики доступу? Це є незворотнім. ';
$_lang['policy_update'] = 'Редагувати політику';
$_lang['policy_template'] = 'Шаблон політики';
$_lang['policy_template.desc'] = 'Шаблон Політики доступу визначає які Дозволи будуть показані в таблиці Дозволів при редагуванні Політики доступу, якої призначений цей шаблон. Ви можете додавати або видаляти Дозволу на основі цього Шаблону. Зверніть увагу, що видалення Дозволу з Шаблону буде також видаляти його з будь-якої Політики доступу, яка використовує цей Шаблон. ';
$_lang['policy_template_create'] = 'Створити шаблон політики доступу';
$_lang['policy_template_desc_name'] = 'Ім\'я шаблону політики доступу';
$_lang['policy_template_desc_description'] = 'Не обов\'язково. Короткий опис Шаблону Політики доступу ';
$_lang['policy_template_desc_lexicon'] = 'Не обов\'язково. Тема Словника яку використовує Шаблон політики для перекладу Дозволів. ';
$_lang['policy_template_desc_template_group'] = 'Група Шаблонів Політик доступу. Використовується при виборі Політики з меню, що випадає, як правило, вони фільтруються за шаблоном групи. Виберіть відповідну групу для Шаблону Політики. ';
$_lang['policy_template_duplicate'] = 'Дублювати шаблон політик';
$_lang['policy_template_duplicate_confirm'] = 'Ви впевнені, що хочете копіювати цей Шаблон? ';
$_lang['policy_template_err_ae'] = 'Шаблон політики доступу з ім\'ям `[[+name]]` вже існує. Будь ласка, оберіть інше ім\'я.';
$_lang['policy_template_err_nf'] = 'Шаблон політики доступу не знайдений.';
$_lang['policy_template_err_ns'] = 'Шаблон Політики доступу не вказано. ';
$_lang['policy_template_err_remove'] = 'Сталася помилка під час спроби видалити Шаблон Політики. ';
$_lang['policy_template_err_save'] = 'Сталася помилка під час спроби зберегти Шаблон Політики. ';
$_lang['policy_template_export'] = 'Експортувати Шаблон Політики доступу ';
$_lang['policy_template_import'] = 'Імпортувати Шаблон Політики доступу';
$_lang['policy_template_import_msg'] = 'Вкажіть XML-файл для імпорту Шаблона Політики доступу. Файл повинен бути коректним XML-файлом формату Шаблона Політики. ';
$_lang['policy_template_remove'] = 'Видалити Шаблон Політики доступу ';
$_lang['policy_template_remove_confirm'] = 'Ви впевнені, що хочете видалити Шаблон Політики доступу? Це видалить всі Політики прикріплені до цього Шаблону, а також - це може порушити роботу MODX, якщо будь-яка активна Політика додається до цього Шаблону. ';
$_lang['policy_template_remove_multiple'] = 'Видалити вибрані Шаблони Політик';
$_lang['policy_template_remove_multiple_confirm'] = 'Ви впевнені, що хочете видалити ці Шаблони Політик доступу? Це видалить всі Політики використовують ці Шаблони, а також - це може порушити роботу MODX, якщо будь-які активні Політики використовують цей Шаблон. ';
$_lang['policy_template_update'] = 'Редагувати Шаблон Політики доступу ';
$_lang['policy_templates'] = 'Шаблони політик';
$_lang['policy_templates.intro_msg'] = 'Це список Шаблонів Політик доступу. Шаблон Політики доступу складається зі списку Дозволів. Ці Дозволи можуть бути включені або виключені під час редагування Політики доступу. ';
$_lang['template_group'] = 'Група шаблонів';