<?php
/**
 * Property Set English lexicon topic
 *
 * @language en
 * @package modx
 * @subpackage lexicon
 */
$_lang['area'] = 'Розділ';
$_lang['areas'] = 'Розділи';
$_lang['class_name'] = 'Ім\'я класу';
$_lang['default'] = 'За замовчуванням';
$_lang['duplicate_of'] = 'Копія [[+name]]';
$_lang['element_properties_desc'] = 'Тут ви можете редагувати параметри за замовчуванням для елемента, або редагувати набори параметрів. <B>Примітка</b>: Коли ви редагуєте параметри за замовчуванням, ви зберігаєте ці параметри в параметри за замовчуванням. Редагування набору параметрів буде зберігати ці параметри в набір параметрів. <br /> <br /> Коли ви вибираєте набір параметрів для редагування, параметри за замовчуванням показуються в таблиці <b style = "color: gray"> сірим</b> кольором. Параметри сірого кольору не входять до набір параметрів, але вони показані для полегшення редагування. Параметри <b style = "color: green"> зеленого </b> кольору це ті параметри значення за замовчуванням яких було змінено. Параметри <b style = "color: purple"> фіолетового </b> кольору це нові параметри в наборі, їх немає в параметрах за замовчуванням. <br /> <br /> <b> Увага: </ b> Краще не редагувати параметри елемента за замовчуванням, так як під час оновлення ці параметри будуть перезаписані. Використовуйте набори параметрів замість цього. ';
$_lang['file'] = 'Файл';
$_lang['color'] = 'Колір';
$_lang['new_name'] = 'Нове ім\'я';
$_lang['object'] = 'Об\'єкт';
$_lang['properties'] = 'Параметри';
$_lang['properties_default_locked'] = 'Параметри за замовчуванням заблоковані';
$_lang['properties_default_locked_msg'] = 'Тільки користувач з правами «unlock_element_properties» може розблокувати параметри за замовчуванням. ';
$_lang['properties_default_unlocked'] = 'Параметри за замовчуванням розблоковані';
$_lang['properties_import_err_invalid'] = 'Обраний Вами файл не є правильним файлом параметрів. Будь ласка, повторіть спробу.';
$_lang['properties_import_err_upload'] = 'Будь ласка, виберіть для завантаження файл параметрів вірного формату.';
$_lang['properties_import_msg'] = 'Будь ласка, оберіть правильний файл параметрів.';
$_lang['properties_remove'] = 'Видалити параметри';
$_lang['properties_remove_confirm'] = 'Ви впевнені, що хочете видалити ці параметри?';
$_lang['property'] = 'Параметр';
$_lang['property_area_desc'] = 'Розділ або група, до якої належить даний параметр.';
$_lang['property_create'] = 'Створити параметр';
$_lang['property_description_desc'] = 'Коротке описання параметру. Може бути ключем словнику, що відноситься до даного параметру.';
$_lang['property_lexicon_desc'] = 'Не обов\'язково. Словник за допомогою якого цей параметр може бути переведений. ';
$_lang['property_name_desc'] = 'Ім\'я параметру, параметр буде доступний через : [[+ім\'яПараметру]]';
$_lang['property_option_create'] = 'Створити Параметр для Властивості ';
$_lang['property_option_remove'] = 'Видалити Параметр Властивості ';
$_lang['property_option_remove_confirm'] = 'Ви впевнені, що хочете видалити цей параметр властивості? ';
$_lang['property_options'] = 'Опції властивостей';
$_lang['property_revert'] = 'Відновити властивість за замовчуванням ';
$_lang['property_revert_confirm'] = 'Ви впевнені, що хочете відновити значення цього параметра за замовчуванням? ';
$_lang['property_revert_all'] = 'Відновити все за замовчуванням';
$_lang['property_revert_all_confirm'] = 'Ви впевнені, що хочете відновити значення всіх параметрів за замовчуванням? ';
$_lang['property_remove'] = 'Видалити параметр';
$_lang['property_remove_confirm'] = 'Ви впевнені, що хочете видалити цей параметр?';
$_lang['property_update'] = 'Редагувати параметр';
$_lang['property_xtype_desc'] = 'Тип вводу для параметра.';
$_lang['propertyset'] = 'Набір параметрів';
$_lang['propertyset_add'] = 'Додати набір параметрів';
$_lang['propertyset_create'] = 'Створити набір параметрів';
$_lang['propertyset_create_new'] = 'Створити набір параметрів';
$_lang['propertyset_duplicate'] = 'Дублювати набір параметрів';
$_lang['propertyset_duplicate_copyels'] = 'Копіювати зв\'язки з елементами?';
$_lang['propertyset_element_add'] = 'Зв\'язати набір параметрів з елементом';
$_lang['propertyset_element_remove'] = 'Видалити елемент з набору параметрів';
$_lang['propertyset_element_remove_confirm'] = 'Ви впевнені, що хочете видалити зв\'язок елемента і набору параметрів? ';
$_lang['propertyset_err_ae'] = 'Набір параметрів з таким іменем вже існує. Будь ласка, вкажіть інше ім\'я.';
$_lang['propertyset_err_associate'] = 'Сталася помилка при спробі зв\'язування набору параметрів з елементом.';
$_lang['propertyset_err_create'] = 'Сталася помилка при спробі створення набору параметрів.';
$_lang['propertyset_err_element_add'] = 'Сталася помилка при спробі додавання елемента до набору параметрів.';
$_lang['propertyset_err_element_nf'] = 'Даний елемент не зв\'язаний з цим набором параметрів.';
$_lang['propertyset_err_element_remove'] = 'Сталася помилка при спробі видалення елемента з набору параметрів.';
$_lang['propertyset_err_nf'] = 'Набір параметрів не знайдений.';
$_lang['propertyset_err_nfs'] = 'Набір параметрів з ID [[+id]] не знайдений.';
$_lang['propertyset_err_ns'] = 'Набір параметрів не вказаний.';
$_lang['propertyset_err_ns_name'] = 'Будь ласка, вкажіть ім\'я для набору параметрів.';
$_lang['propertyset_err_remove'] = 'Сталася помилка при спробі видалення набору параметрів.';
$_lang['propertyset_err_update'] = 'Сталася помилка при спробі редагування набору параметрів.';
$_lang['propertyset_new'] = 'Створити набір параметрів';
$_lang['propertyset_panel_desc'] = 'Тут ви можете створити набір параметрів, або вибрати сушествующих набір параметрів і зв\'язати його з цим елементом. ';
$_lang['propertyset_remove'] = 'Видалити набір параметрів';
$_lang['propertyset_remove_confirm'] =  'Ви впевнені, що хочете видалити цей набір параметрів?';
$_lang['propertyset_save'] = 'Зберегти набір параметрів';
$_lang['propertyset_update'] = 'Редагувати набір параметрів';
$_lang['propertysets'] = 'Набори параметрів';
$_lang['propertysets_desc'] = 'Тут ви можете управляти наборами параметрів. Натисніть по набору параметрів в деревовидному меню для того щоб завантажити параметри з набору в таблицю, де ви можете їх редагувати. Якщо ви натиснете правою кнопкою мишки по набору параметрів в деревовидному меню, то зможете створити або видалити зв\'язок набору параметрів з елементом. ';
$_lang['propertysets_err_item_class_ns'] = 'Елемент класу не було вказано ';