<?php
/**
 * TV English lexicon topic
 *
 * @language en
 * @package modx
 * @subpackage lexicon
 */
$_lang['has_access'] = 'Доступно для редагування?';
$_lang['filter_by_category'] = 'Фільтр за категорією...';
$_lang['rank'] = 'Порядок';
$_lang['rendering_options'] = 'Налаштування відображення';
$_lang['tv'] = 'Змінна шаблону';
$_lang['tv_access_msg'] = 'Виберіть групу ресурсів, до якої належить TV. Тільки користувачі, які мають доступ до цієї групи, зможуть змінювати значення TV. Якщо група не буде обрана, то TV зможуть змінювати всі користувачі, які мають доступ до системи управління. ';
$_lang['tv_binding_msg'] = 'Це TV підтримує прив\'язку даних з використанням @-команд';
$_lang['tv_caption'] = 'Підпис';
$_lang['tv_change_template_msg'] = 'Зміна цього шаблону призведе до перезавантаження TV для сторінки з втратою всіх не збережених змін. <br /> <br /> Ви впевнені, що хочете змінити цей шаблон? ';
$_lang['tv_delete_confirm'] = 'Ви впевнені, що хочете видалити цей TV? ';
$_lang['tv_desc_caption'] = 'Текст буде показаний поруч з TV при редагуванні ресурсу. ';
$_lang['tv_desc_category'] = 'Категорія, до якої належить ця змінна шаблону.';
$_lang['tv_desc_description'] = 'Короткий опис цієї змінної шаблону.';
$_lang['tv_desc_name'] = 'Ім\'я цієї змінної шаблону. Вона буде доступна через теґ [[*Ім\'яЗмінної]].';
$_lang['tv_description'] = 'Описання';
$_lang['tv_err_delete'] = 'Сталася помилка під час видалення TV. ';
$_lang['tv_err_duplicate'] = 'Сталася помилка під час копіювання TV. ';
$_lang['tv_err_duplicate_templates'] = 'Сталася помилка під час копіювання TV шаблону. ';
$_lang['tv_err_duplicate_documents'] = 'Сталася помилка під час копіювання TV ресурсів. ';
$_lang['tv_err_duplicate_documentgroups'] = 'Сталася помилка під час копіювання TV груп ресурсів. ';
$_lang['tv_err_ae'] = 'Змінна шаблону з іменем "[[+name]]" вже існує.';
$_lang['tv_err_invalid_name'] = 'Ім\'я Вашої змінної шаблону містить некоректні символи.';
$_lang['tv_err_locked'] = 'Змінна шаблону заблокована!';
$_lang['tv_err_nf'] = 'Змінна шаблону не знайдена.';
$_lang['tv_err_nfs'] = 'Не знайдена змінна шаблона з ключем: [[+id]]';
$_lang['tv_err_ns'] = 'Змінну шаблона не вказано.';
$_lang['tv_err_reserved_name'] = 'TV не може мати таку ж назву як у ресурсу. ';
$_lang['tv_err_save_access_permissions'] = 'Сталася помилка при збереженні права доступу для TV. ';
$_lang['tv_err_save'] = 'Сталася помилка при збереженні TV. ';
$_lang['tv_inuse'] = 'Наступні ресурси використовують це TV. Для продовження видалення натисніть кнопку «Видалити». Якщо ви передумали, то натисніть кнопку «Скасувати». ';
$_lang['tv_inuse_template'] = 'Наступний шаблон (або шаблони) використовує це TV: [[+templates]]. <br /> <br /> Будь ласка, Відв\'яжіть TV від шаблону (або шаблонів) перед його видаленням. ';
$_lang['tv_input_options'] = 'Параметри вводу';
$_lang['tv_input_options_msg'] = '<p>Тут Ви можете редагувати параметри вводу змінної шаблону, характерні для типу вводу, який Ви вибрали.</p>';
$_lang['tv_lock'] = 'Заборонити редагування змінної';
$_lang['tv_lock_msg'] = 'Користувачі повинні мати атрибут «edit_locked» для редагування цього TV. ';
$_lang['tv_management_msg'] = 'Управління TV для ваших ресурсів. ';
$_lang['tv_msg'] = 'Тут ви можете створити / редагувати додаткові поля (TV). Пам\'ятайте, TV має бути доступне для шаблонів, щоб його можна було використовувати в сниппета і ресурсах.';
$_lang['tv_name'] = 'Ім\'я змінної';
$_lang['tv_new'] = 'Нова змінна шаблону';
$_lang['tv_novars'] = 'Не знайдено змінних шаблону';
$_lang['tv_output_options'] = 'Параметри виводу';
$_lang['tv_output_options_msg'] = '<p>Тут Ви можете змінити параметри виводу змінної шаблону, характерні для обраного типу виводу.</p>';
$_lang['tv_properties'] = 'Параметри за замовчуванням';
$_lang['tv_rank'] = 'Порядок сортування';
$_lang['tv_reset_params'] = 'Скинути параметри';
$_lang['tv_sources.intro_msg'] = 'Тут Ви можете призначити джерела медіа, які будуть використані цією змінною шаблону для кожного окремого контексту. Для зміни двічі клацніть по імені джерела у таблиці.';
$_lang['tv_tmpl_access'] = 'Доступ шаблонів';
$_lang['tv_tmpl_access_msg'] = 'Виберіть шаблони, для яких доступно це TV. ';
$_lang['tv_widget'] = 'Віджет';
$_lang['tv_widget_prop'] = 'Параметри віджету';
$_lang['tvd_err_remove'] = 'Сталася помилка під час спроби видалити TV з ресурсу. ';
$_lang['tvdg_err_remove'] = 'Сталася помилка під час спроби видалити TV з групи ресурсів. ';
$_lang['tvdg_err_save'] = 'Сталася помилка під час спроби прикріпити TV до групи ресурсів.';
$_lang['tvs'] = 'Змінні шаблону';
$_lang['tvt_err_nf'] = 'TV не має доступу до зазначеного шаблоном. ';
$_lang['tvt_err_remove'] = 'Сталася помилка під час видалення TV з шаблону. ';
$_lang['tvt_err_save'] = 'Сталася помилка під час спроби прикріпити TV до шаблону. ';
