<?php
/**
 * Export English lexicon topic
 *
 * @language en
 * @package modx
 * @subpackage lexicon
 */
$_lang['export_site_cacheable'] = 'Включи некеширани файлове:';
$_lang['export_site_exporting_document'] = 'Експортиране на файл <strong>%s</strong> от <strong>%s</strong><br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<small><i>%s</i>, id %s</small><br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;';
$_lang['export_site_failed'] = '<span style="color:#990000">Неуспешно!</span>';
$_lang['export_site_html'] = 'Експортиране на сайта в HTML';
$_lang['export_site_maxtime'] = 'Максимално врене на експортиране:';
$_lang['export_site_maxtime_message'] = 'Тук може да зададете броя секунди, които MODX може да отдели за експортиране на сайта (презаписвайки PHP настройките). Вкарайте 0 за неограничено време. Моля отбелжете, че 0 или по-високи стойности могат до доведат до забавяне и странни процеси на сървъра, което не е препоръчително.';
$_lang['export_site_message'] = '<p>Използвайки тази функция можете да експортрате целия сайт в HTML файлове. Моля имайте в предвид, че ще загубите много от MODX функционалността като направите така:</p><ul><li>Четенето на страници от експортираните файлове няма да бъде записано.</li><li>Интерактивни снипети НЯМА да работят в експортираните файлове</li><li>Само регулярни документи ще бъдат експортирани, уеблинкове няма да бъдат експортирани.</li><li> Процеса на експортиране може да пропадне, ако документите ви съдържат снипети, които изпращат препратени хедъри. .</li><li>В зависиост от това как сте написали документите, стилизацията и изображенията, дизайна на вашия сайт може да се повреди. За да шредотваратите или поправите това, може да съхраните/преместите експортираните файлове в същата директория, където се намира основния MODX index.php файл.</li></ul><p>Моля попълнете формата и натиснете \'Експорт\' за да стартирате процеса на експортиране.  Създадените файлове ще бъдат съхранени на зададено от вас място, използвайки където е възможно псевдонимите на документите като файлови имена. Докато експортирате вашия сайт, е препоръчително настройката на MODX \'Приятелски псевдоними\' да е \'да\'. В зависимост ор размера на сайта, експортирането може да отнеме време.</p><p><em>Всички съществуващи файлове ще бъдат презаписани от новите файловеако имената им са идентични!</em></p>';
$_lang['export_site_numberdocs'] = '<p><strong>Намерени са %s документи за експорт...</strong></p>';
$_lang['export_site_prefix'] = 'Префикс на файл:';
$_lang['export_site_start'] = 'Започни експортиране';
$_lang['export_site_success'] = '<span style="color:#009900">Успешно!</span>';
$_lang['export_site_suffix'] = 'Файл суфикс:';
$_lang['export_site_target_unwritable'] = 'Таргет директорията не е записваема. Моля уверете се, че директорията е записваема и пробвайте отново.';
$_lang['export_site_time'] = 'Експорта приключен. Експортирането отне %s секунди.';