<?php
/**
 * Menu English lexicon topic
 *
 * @language en
 * @package modx
 * @subpackage lexicon
 */
$_lang['action'] = 'Действие';
$_lang['action_desc'] = 'Пътят на контролера, който да се използва за този елемент на менюто. Пътят към контролера е изграден чрез пътя на пространството от имена, контролери и мениджър теми с тази стойност. ( user/update за ядрото на пространството от имена отива до  [core_namespace_path]sontrollers/ [mgr_theme]/user/update.class.php )';
$_lang['description_desc'] = 'Текстът или речник ключа, които ще бъдат използвни за рендване описанието на текста от тази страница в менюто.';
$_lang['handler'] = 'Handler';
$_lang['handler_desc'] = '(По избор) Ако е зададено, няма да използва полето на действие, но вместо да използвате този JavaScript щракнете върху елемент отменюто.';
$_lang['icon'] = 'Икона';
$_lang['icon_desc'] = 'Незадължителна икона/маркиране.';
$_lang['lexicon_key'] = 'Лексикон ключ';
$_lang['lexicon_key_desc'] = 'Текст или ключ на лексикон, който ще бъде използван за рендване на заглавието на текста от тази страница в менюто.';
$_lang['menu_create'] = 'Създай меню';
$_lang['menu_confirm_remove'] = 'Сигурен ли сте, че искате да премахнете това меню?';
$_lang['menu_err_ae'] = 'Меню с това име вече съществува. Моля задайте различна стойност на текста.';
$_lang['menu_err_nf'] = 'Не е намерено меню!';
$_lang['menu_err_ns'] = 'Не е зададено меню!';
$_lang['menu_err_remove'] = 'Възникна грешка при опита за пемахване на меню.';
$_lang['menu_err_save'] = 'Възникна грешка при опита за съхранение на меню.';
$_lang['menu_parent'] = 'Родителско меню';
$_lang['menu_parent_err_ns'] = 'Не е посочено родителско (главно) меню!';
$_lang['menu_parent_err_nf'] = 'Не е намерено родителско (главно) меню!';
$_lang['menu_remove'] = 'Изтрий елемент от меню';
$_lang['menu_top'] = 'Главно меню';
$_lang['menu_update'] = 'Актуализирай меню';
$_lang['menus'] = 'Менюта';
$_lang['namespace'] = 'Пространство от имена';
$_lang['namespace_desc'] = 'Пространство от имена, на което се базира  този елемент от менюто. Това ще определи пътя за контролера, който е зареден. Това ще определи пътя за контролера, който е зреден.';
$_lang['parameters'] = 'Параметри';
$_lang['parameters_desc'] = 'Всички параметри на заявката, които искате да бъдат приложени към URL резултата, когато кликнете това меню. (Ex: &expire=1)';
$_lang['permissions'] = 'Разрешение';
$_lang['permissions_desc'] = 'Разрешителен ключ, изискващ се за зареждане на този елемент от менюто.';
$_lang['topmenu'] = 'Главно меню';
$_lang['topmenu_desc'] = 'Това ви позволява да свържете деиствия с елементи на менюто в горната лента на менюто на MODX мениджъра. просто поставете менюта къдетоги искате в съответните им позиции.';
